[
    {
        "Category":"Rice Range",
        "Product":"Sindhi Biryani Recipe Mix",
        "Description":"“Making biryani from scratch can take time and effort however with National’s famous Sindhi biryani mix, we guarantee you will be indulging in Daigi style traditional biryani without the extra hassle. This recipe mix will ensure your chicken\/meat and potatoes are cooked in our perfect blend of spices and herbs that give maximum flavour and heat with each grain of rice infused in fragrant aroma that you just can’t resist!",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/Sindhi-Biryani.jpg"
    },
    {
        "Category":"Rice Range",
        "Product":"Pulao Recipe Mix",
        "Description":"Prepare delicious Pulao in no time with the help of National Pulao Mix. Mixed with varieties of herbs and spices, this mix adds a fragrant aroma and wholesome flavour to every grain of rice and meat. Create your own variation of Pulao with our mix as this can be added to chicken, meat, chickpeas and\/or vegetables. Best served with Raita.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/pulao-scaled.jpg"
    },
    {
        "Category":"Rice Range",
        "Product":"Biryani Recipe Mix",
        "Description":"Making biryani from scratch can take time and effort however with National\\’s famous Biryani mix, we guarantee you will be indulging in Daigi style traditional biryani without the extra hassle. This recipe mix will ensure your chicken\/meat and potatoes are cooked in our perfect blend of spices and herbs that give maximum flavour and heat with each grain of rice infused in fragrant aroma that you just can\\’t resist",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/biryani-new-pack-scaled.jpg"
    },
    {
        "Category":"Rice Range",
        "Product":"Bombay Biryani Recipe Mix",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/bombay-biryani--scaled.jpg"
    },
    {
        "Category":"Stir-Fried Range",
        "Product":"Karahi Gosht Recipe Mix",
        "Description":"Add excitement to the dining table by serving delicious authentic Karahi Gosht with the help of National karahi gosht Recipe Mix. A flavorful blend of spices and herbs that delivers aroma and flavorsome taste. Now serve restaurant quality food from the comfort of your home.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/karahi-gosht-scaled.jpg"
    },
    {
        "Category":"Stir-Fried Range",
        "Product":"Achar Gosht Recipe Mix",
        "Description":"Prepare traditional chatkharidar Achar Gosht in no time with the help of National Achar Gosht Masala Mix. Mixed with varieties of herbs and spices, this mix adds a fragrant aroma and a spicy tangy flavour of pickles to your meat.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/achar-gosht-pack-scaled.jpg"
    },
    {
        "Category":"Salan Range",
        "Product":"Quorma Recipe Mix",
        "Description":"Prepare traditional Daigi style Quorma with National Quorma Recipe Mix. A combination of rich and fragrant spices and herbs that helps you prepare a delicious quorma in no time! Includes a Free ” National Bombay Biryani Recipe Mix” Sachet in the box, to add more to your dinner table.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/quoroma-scaled.jpg"
    },
    {
        "Category":"Salan Range",
        "Product":"Paya Recipe Mix",
        "Description":"Prepare delicious Paya salan with the help of National Paya Recipe Mix. A perfect blend of aromatic and rich herbs and spices creating a flavorsome traditional meal. An ideal dish to serve in dawat and events in the winter season.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/paya.jpg"
    },
    {
        "Category":"Salan Range",
        "Product":"Curry Powder Recipe Mix",
        "Description":"Traditional mix of cumin, turmeric, ginger spices and dry herbs, blended to form the perfect home-made style curry mix. A delicious flavorsome desi taste and a fragrant aroma to make your meal burst with flavour. A perfect option for easy cooking &amp; instant serving for any event.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/curry-scaled.jpg"
    },
    {
        "Category":"Salan Range",
        "Product":"Murghi Recipe Mix",
        "Description":"National Murghi Masala provides the ultimate blend of spices and herbs to give your Chicken Gravy a distinctive flavor and aroma. Conveniently prepare dishes without compromising on taste with help of our recipe mix.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/murghi-scaled.jpg"
    },
    {
        "Category":"Salan Range",
        "Product":"Kofta Recipe Mix",
        "Description":"Prepare delicious kofta curry with the help of National Kofta Recipe Mix. A perfect blend of aromatic and rich herbs and spices that seasons and flavors the kofta meat perfectly.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/kofta.jpg"
    },
    {
        "Category":"Salan Range",
        "Product":"Delhi Nihari Recipe Mix",
        "Description":"Indulge in traditional Delhi Nihari from the comfort of your home using National Delhi Nihari Recipe Mix; which is prepared by Pakistani cuisine experts; using the ultimate blend of spices and herbs.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/nihari-scaled.jpg"
    },
    {
        "Category":"BBQ Range",
        "Product":"Tikka Boti Recipe mix",
        "Description":"Indulge in a traditional BBQ by making delicious mouth watering tikka with National Tikka Boti Masala. A tantalizing blend of spices and fragrant herbs that helps make the meat tender and juicy. Now you can enjoy your favourite Tikka recipe at home without the extra hassle.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/tikka-boti.jpg"
    },
    {
        "Category":"BBQ Range",
        "Product":"Seekh Kabab Recipe Mix",
        "Description":"Indulge in a traditional BBQ by using National’s Bihari Kabab Mix to create signature Bihari style kebabs with the perfect blend of hot spices for a delicious marinade. Now you can enjoy spicy, delicious Bihari Style BBQ meat without the extra hassle.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/seekh-kabab.jpg"
    },
    {
        "Category":"BBQ Range",
        "Product":"Chicken Tandouri Recipe Mix",
        "Description":"Indulge in a traditional desi BBQ by using National’s Chicken Tandoori Mix to create signature tandoori with the perfect blend of hot spices for succulant and juicy chicken. Now you can enjoy authentic spicy and delicious chicken tandoori at home without the extra hassle.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/Chicken-Tandoori.jpg"
    },
    {
        "Category":"BBQ Range",
        "Product":"Chicken Tikka Recipe Mix",
        "Description":"Indulge in a traditional desi BBQ by using National’s Chicken Tikka Mix to create signature chicken tikka with the perfect blend of hot spices for succulant and juicy chicken. Now you can enjoy authentic spicy and delicious chicken tandoori at home without the extra hassle. This mix can be used as a seasoning or flavouring for other dishes like sandwiches, pasta and many more.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/chicken-tikka-scaled.jpg"
    },
    {
        "Category":"Fried Range",
        "Product":"Fish Recipe Mix",
        "Description":"Create your favourite spicy Fish recipe with the help of National Fish Recipe Mix. A blend of flavorful spices and fragrant herbs to make the perfect marination for any kind of fish. Helps in tenderizing and absorbing flavour. Perfect for fried, grilled and roasted fish.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/fish-scaled.jpg"
    },
    {
        "Category":"Fried Range",
        "Product":"Shami Kabab",
        "Description":"National’s Shami Kabab Recipe Mix helps you prepare delicious shami Kababs at home with the perfect blend mix of spices and herbs to give you that authentic flavour. Now you can enjoy home made spicy, mouth watering Shami Kababs without the extra hassle.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/Shami-Kabab.jpg"
    },
    {
        "Category":"Fried Range",
        "Product":"Broast Recipe Mix",
        "Description":"Prepare delicious crispy and spicy coating for your broast with National Broast Batter Mix Masala. Incredibly easy to prepare and cook. Flavorsome spices and herbs blended in a batter mix that coats the meat to perfection and brings out the classic broast look and taste at home in a matter of minutes. Serve it with fries and National’s Garlic Mayo to enhance the eating experience.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/broast.jpg"
    },
    {
        "Category":"Fried Range",
        "Product":"Chapli Kabab Recipe Mix",
        "Description":"Indulge in a traditional BBQ by using National’s Chapli Kabab Mix to create signature kebabs with the perfect blend of hot spices for delicious tender meat. Now you can enjoy authentic spicy and delicious chapli kebabs at home without the extra hassle.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/chapli-kabab.jpg"
    },
    {
        "Category":"Haleem Range",
        "Product":"Quick Cook Haleem",
        "Description":"Looking for a convenient Haleem Mix with an authentic Haleem flavor? Look no further than National\\’s Quick Cook Haleem. This recipe mix is a blend of spices and lentils that will help you cook traditional Haleem in no time.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/easy-haleem-scaled.jpg"
    },
    {
        "Category":"Haleem Range",
        "Product":"Haleem Recipe Mix",
        "Description":"Prepare delicious authentic Haleem with National. A blend of spices, lentils mix and your choice of meat, stirred and cooked to perfection to make this wholesome meal for any event.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/haleem.jpg"
    },
    {
        "Category":"Haleem Range",
        "Product":"Daigi Danedar Haleem Recipe Mix",
        "Description":"Get the familiar taste of Traditional Daighi Danedar Haleem with National. A blend of spices, lentils mix and your choice of meat, stirred to perfection to make the ideal traditional meal for any event.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/dandar-haleem-scaled.jpg"
    },
    {
        "Category":"Rozana Range",
        "Product":"Chatkharaydaar Sabzi Recipe Mix",
        "Description":"Are you tired of cooking repetitive Sabzi recipes with the same ordinary taste? Add a burst of flavor and irresistible aroma by using National Chatkharaydaar Sabzi Recipe Mix and amaze your family. Used and recommended by Pakistani cuisine experts; the Chatkharaydaar Sabzi Recipe mix adds a tangy twist to your vegetarian dishes. Just one sachet prepares a delicious meal for your entire family of 5-6 people.Get your Rozana box now, that contains 2 sachets of Rozana Recipes and a whole load of tangy, spicy goodness.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/chatkharaydaar-sabzi.jpg"
    },
    {
        "Category":"Rozana Range",
        "Product":"Mazedaar Daal Recipe Mix",
        "Description":"Are you tired of cooking repetitive recipes with the same ordinary taste? Add a burst of flavor and irresistible aroma by using National Mazedaar Daal Recipe Mix and amaze your family. Used and recommended by Pakistani cuisine experts; the Mazedaar Daal Recipe mix is prepared with a special taste of chicken flavour to enhance your meal. Just one sachet prepares a delicious meal for your entire family of 5-6 people.Get your Rozana box now, that contains 2 sachets of Rozana Recipes and a whole load of flavour and spicy goodness.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/mazedaar-daal.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Turmeric Powder",
        "Description":"Add a unique flavor and irresistible savour to your dishes with the help of National Turmeric Powder. The rich yellow color; tempting aroma and fine texture makes this the perfect ingredient to add in your delicacies for a burst of flavor.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/turmeric-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Garam Masala",
        "Description":"National Foods provides you with the finest and most exquisite seasonings and condiments. National Garam Masala is a blend of premium spices which gives a unique flavor and irresistible aroma to your dishes.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/garam-masala-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Chilli Powder",
        "Description":"National’s Chilli Powder adds the perfect amount of pungency and hotness to your dishes and gives them a burst of flavor. Made from pure and fresh spices, gives this a natural red color. The spiciness will enhance the taste of your dishes, especially Pakistani cuisines.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/red-chilli-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Ginger Powder",
        "Description":"Give your dishes a burst of flavor and an enticing aroma. National Ginger Powder is made from premium quality natural ginger; without any artificial colors and flavors. Our fine textured Ginger Powder is a healthy choice to add in your food due to its antioxidant and anti-inflammatory properties.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/ginger-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Coriander Powder",
        "Description":"Pure and freshly ground, National Coriander Powder is a fragrant, antioxidant-rich herb that adds a mild flavour and a pleasing aroma to savoury foods.\nNational ensures that you get the purest spices by only selecting the finest raw materials and carefully packaging them under strict hygienic conditions, ensuring quality at every step of the process following international and GMP standards.\nNational Coriander Powder comes packaged in a bag and sealed in a box.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/coriander-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Cumin Seeds",
        "Description":"National Foods provides you with the finest and most exquisite seasonings and condiments. National’s Cumin Seeds are loaded with antioxidants and nutrients that are beneficial for your health. Make your dishes more flavorsome and aromatic with the help of our Cumin Seeds.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/cumin-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Kasuri Methi",
        "Description":"This multi-purpose herb provides a fragrant aroma and rich flavor by transforming your meals by adding a sweetness and depth of flavour to any dish. Typically, Kasuri Methi pairs well with potatoes and is used to make “Aloo Methi”. It is also used in doughs for Parathas and Naan and is sprinkled over curries with meat.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/kasuri-methi-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Black Pepper Powder",
        "Description":"National Foods Limited is the pioneer of branded spices in clean packaged form in Pakistan. We ensure that you get the purest spices by selecting only the finest raw materials and maintaining strict quality control at our state-of-the art manufacturing facilities. National Black Pepper gives the perfect hot flavor to your dishes.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/black-papper-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Garlic Powder",
        "Description":"National Garlic Powder is a great addition to make your dishes exceedingly appetizing and aromatic. Our fine textured Garlic Powder is the perfect choice to add to your cooking because it enhances the overall flavour of your dish.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Ingredients-Garlic-Powder.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Refined Salt",
        "Description":"National iodized Refined salt is a specially refined; brilliant white food grade salt with free flow properties. Enjoy great tasting and healthy food prepared with National iodized Refined Salt.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/salt-mocup-green.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Iodized Refined Salt",
        "Description":"National iodized Salt is a specially refined; brilliant white food grade salt. It includes essential iodine which helps in the proper mental development of children and prevents iodine deficiency in adults.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/salt-mocup-blue.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Iodized Pink Himalayan Salt",
        "Description":"National Iodized Salt is a specially refined; food grade salt. It includes essential Iodine which helps in the proper mental development of children and prevents Iodine deficiency in adults.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/salt-mocup-Pink.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Tomato Ketchup",
        "Description":"National tomato ketchup is prepared using the finest tomatoes that give it, its signature thick and delicious taste! The perfect accompaniment for all your snacks and meals, National ketchup is made from premium ingredients without any artificial colours or flavourings. All our products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/ketchup-1-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Tomato Ketchup",
        "Description":"National tomato ketchup is prepared using the finest tomatoes that give it, its signature thick and delicious taste! The perfect accompaniment for all your snacks and meals, National ketchup is made from premium ingredients without any artificial colours or flavourings. All our products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Tomato-Ketchup-250G-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Chilli Garlic Sauce",
        "Description":"Savor the tantalizing combination of juicy red tomatoes; mingled with the taste of hot chilies and garlic. The perfect way to top off any meal specially BBQ, broast, samosas and rolls. Made with real garlic chunks, National Chilli Garlic Sauce is bound to entice your tastebuds with its perfectly delicious taste!",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/chilli-garlic-sauce-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Mixed Pickle",
        "Description":"National Mixed Pickle is prepared with high quality ingredients including flavorsome oils, freshly picked succulent mixed vegetables and the perfect balance of spices to give it a delicious spicy and tangy flavor. It contains the perfect mix of vegetables including chatkharaydaar keri, green chillies, carrots and more, tossed in a delicious blend of aromatic spices. This is a favourite of all Pickle lovers, and is enjoyed thouroughly with traditional desi dishes.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/mixed-pickle-jar.png"
    },
    {
        "Category":"Our Products",
        "Product":"Mango Pickle",
        "Description":"National Mango Pickle contains the goodness of tangy chatkharaydaar keri, tossed in the perfect blend of aromatic spices including red chillies, turmeric, aniseed, fenugreek seed and other savory ingredients. This is a favourite of all Pickle lovers, and is enjoyed thouroughly with traditional desi dishes.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/mango-pickle-jar.png"
    },
    {
        "Category":"Our Products",
        "Product":"Crushed Pickle",
        "Description":"National Crushed Pickles offers a perfectly balanced taste of crushed mixed vegetables in every bite, making it the perfect meal companion. Its unique crushed format makes it easy to eat and allows you to pair it up with anything and everything. Whether used as a condiment, stuffing, topping, ingredient for cooking or even as a spread over paratha, National Crushed Pickle will add just the right excitement to your meal! It is packed in a convenient jar with foil seal which helps keep the freshness intact.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Crushed-Pickles-Bottle.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Hyderabadi Mixed Pickle",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/04\/Hyderabadi-Mix-Pickle-Jar-1KG.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Classic Mayo",
        "Description":"National Classic Mayo is made from premium quality natural ingredients and high grade procedures which makes it thick, creamy and flavorsome. Made with real eggs, National Classic Mayo offers the authentic taste of Mayonnaise along with essential nutrients such as Omega 3 &amp; 6 and Vitamin A. Our Mayo can be used as a spread for burgers, sandwiches and wraps and also as a dip for fries. National products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/classic-mayo-scaled.jpg"
    },
    {
        "Category":"Our Products",
        "Product":"Garlic Mayo",
        "Description":"National Garlic Mayo is a delicious blend of Garlic and Mayonnaise which will perfectly complement your snacks and meals. It is made from premium quality natural ingredients which makes it thick, creamy and flavorsome. Prepared with real eggs, National Garlic Mayo offers essential nutrients such as Omega 3 &amp; 6 and Vitamin A. National products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/garlic-mayo-1-scaled.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Vanilla Custard",
        "Description":"National Vanilla custard powder is the perfect treat for your everyday sweet cravings with its delightful Vanilla flavor and creamy texture. National ensures you get irresistibly delicious custard in no time! Add it to tarts and trifles, donuts and pies, top with your favourite fruit, or indulge in this creamy delight all on its own.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Vanilla-Custard-3D-scaled-1.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Mango Custard",
        "Description":"National Mango custard powder is the perfect treat for your everyday sweet cravings with its fruity mango flavor and creamy texture. National ensures you get irresistibly delicious custard in no time! Add it to tarts and trifles, donuts and pies, top with your favourite fruit, or indulge in this creamy delight all on its own.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Mango-Custard-3D-scaled-1.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Strawberry Custard",
        "Description":"National Strawberry custard powder is the perfect treat for your everyday sweet cravings with its fruity strawberry flavor and creamy texture. National ensures you get irresistbly delicious custard in no time! Add it to tarts and trifles, donuts and pies, top with your favourite fruit, or indulge in this creamy delight all on its own.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/STRAWBERRY-CUSTARD-120g-scaled-1.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Banana Jelly",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/Banana-Jelly-pack-scaled-1.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Mango Jelly",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Mango-Jelly-pack-scaled-1.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Strawberry Jelly",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Strawberry-Jelly-pack-scaled-1.jpg"
    },
    {
        "Category":"Modern Desserts",
        "Product":"Mixed Fruit Jelly",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/mixed-fruit-Jelly-pack-scaled-1.jpg"
    },
    {
        "Category":"Traditional Desserts",
        "Product":"Feerni Mix",
        "Description":"Recreate your favorite traditional dessert with National Feerni Mix. This easy to prepare mix will give you an authentic flavor, creamy thick texture and just the right amount of sweetness, making it the perfect dessert for all your special occasions. Garnish with your favorite dry fruits and nuts.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Feerni-Mix-155g-scaled-1.jpg"
    },
    {
        "Category":"Traditional Desserts",
        "Product":"Pistachio Kheer Mix",
        "Description":"Recreate your favorite traditional dessert with National Pistachio Kheer Mix. This easy to prepare mix will give you an authentic flavor, creamy texture and just the right amount of sweetness, making it the perfect dessert for all your special occasions.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Pistachio-Kheer-Mix-155g-scaled-1.jpg"
    },
    {
        "Category":"Traditional Desserts",
        "Product":"Kheer Mix",
        "Description":"Recreate your favorite traditional dessert with National Kheer Mix. This easy to prepare mix will give you an authentic flavor, creamy texture and just the right amount of sweetness, making it the perfect dessert for all your special occasions.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/kheer-3.png"
    },
    {
        "Category":"Traditional Desserts",
        "Product":"Vermicelli",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/vermicelli.png"
    },
    {
        "Category":"Premium Jams",
        "Product":"Chunky Apple Jam",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/chunky-apple-jam.png"
    },
    {
        "Category":"Premium Jams",
        "Product":"Chunky Mango Jam",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/mango-chunky-jam.png"
    },
    {
        "Category":"Premium Jams",
        "Product":"Chunky Strawberry Jam",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/strawberry-chunky-jam.png"
    },
    {
        "Category":"Premium Jams",
        "Product":"Chunky Mixed Fruit Jam",
        "Description":"",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2022\/05\/mix-fruit-chunky-jam.png"
    },
    {
        "Category":"Jams & Jellies",
        "Product":"Apple Jam",
        "Description":"Experience the delicious taste of National Apple jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/apple-jam.png"
    },
    {
        "Category":"Jams & Jellies",
        "Product":"Mixed Fruit Jam",
        "Description":"Experience the delicious taste of National Mixed fruit jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/mix-fruit-jam.png"
    },
    {
        "Category":"Jams & Jellies",
        "Product":"Mango Jam",
        "Description":"Experience the delicious taste of National Mango jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/mango-jam.png"
    },
    {
        "Category":"Jams & Jellies",
        "Product":"Mango Jam",
        "Description":"Experience the delicious taste of National Mango jam, the perfect start to your breakfast every morning This easy to spread jam makes a wonderful spread on all kinds of breads, adds a perfect flavour to your yoghurt and can be used to prepare a wide variety of desserts too.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/mango-small.png"
    },
    {
        "Category":"Jams & Jellies",
        "Product":"Apple Jam",
        "Description":"Experience the delicious taste of National Apple jam, the perfect start to your breakfast every morning This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/apple-small.png"
    },
    {
        "Category":"Jams & Jellies",
        "Product":"Mixed Fruit Jam",
        "Description":"Experience the delicious taste of National Mixed fruit jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/mixfruit-small.png"
    },
    {
        "Category":"Chutneys",
        "Product":"Coriander Chutney",
        "Description":"National Spicy Coriander Chutney brings the flavor of the fresh coriander with a touch of spice and give your food a unique twist.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Coriander-Chutney.png"
    },
    {
        "Category":"Chutneys",
        "Product":"Plum Chutney",
        "Description":"National Sweet &amp; Sour Plum Chutney Sauce gives you a unique twist of flavors that hits the spot every time and add a touch of sweetness with a tangy kick to any snack.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Plum-Chuyney.png"
    },
    {
        "Category":"Chutneys",
        "Product":"Mango Chutney",
        "Description":"National Hot Mango Chutney Sauce is a traditional chutney made with the sweetness of mangoes and our signature spices that gives it a flavorful kick.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Hot-Mango-Chutney.png"
    },
    {
        "Category":"Chutneys",
        "Product":"fresh mint-chutney",
        "Description":"National Fresh Mint Chutney gives you the refreshing taste of mint to enjoy with any boring old snack, so give your taste buds a treat with National Fresh Mint Chutney Sauce.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Freshmint-Chutney.png"
    },
    {
        "Category":"Chutneys",
        "Product":"Tamarnd Chutney",
        "Description":"National Tangy Tamarind Chutney Sauce has the ultimate sweet, sour and tangy flavor. It’s sure to make any dish pop whether its seafood, chicken, snacks or plain french fries.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/chutney.png"
    },
    {
        "Category":"Sauces",
        "Product":"Red Chilli Sauce",
        "Description":"National Red Chilli Sauce is the ultimate explosion of flavor that wakes up those taste buds and add some heat to boring snacks.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/red-chilli.png"
    },
    {
        "Category":"Sauces",
        "Product":"Green Chilli Sauce",
        "Description":"National Green Chilli Sauce is the ultimate symphony of flavors with a zesty burst of green chillies and our signature spices.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Green-Chilli-Sauce.png"
    },
    {
        "Category":"Sauces",
        "Product":"Imli Sauce",
        "Description":"National Khatti Meethi Imli Sauce has the ultimate sweet, sour and tangy flavor. It adds a wonderful depth of flavor to various meals and snacks such as samosas, chaats and rolls. Enhance the taste of your snacks with the help of this delicious condiment to get an authentic experience of Pakistani Cuisine.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/imli-souce.png"
    },
    {
        "Category":"Sauces",
        "Product":"Imli Souce",
        "Description":"National Khatti Meethi Imli Sauce has the ultimate sweet, sour and tangy flavor. It adds a wonderful depth of flavor to various meals and snacks such as samosas, chaats and rolls. Enhance the taste of your snacks with the help of this delicious condiment to get an authentic experience of Pakistani Cuisine.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/imili-souce-2.png"
    },
    {
        "Category":"Chinese Sauces",
        "Product":"Chilli Sauce",
        "Description":"Prepared with the highest quality ingredients, National Chilli Sauce has a distinct aroma and a spicy kick, it is just what you need to enjoy the perfect authentic Chinese taste. Whether you are looking for the right ingredient to prepare a perfect authentic Chinese recipe, or want to add more flavor to your favorite meals, National Chilli Sauce is what you need to enhance the flavour and spiciness of your favourite meals.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/chinese-chilli-sause-scaled.jpg"
    },
    {
        "Category":"Chinese Sauces",
        "Product":"Soy Sauce",
        "Description":"Prepared with the highest quality ingredients, National Soy Sauce offers the best taste for enhancing your meals. Whether you are looking for the right ingredient to prepare a perfect authentic Chinese recipe, or want to add more flavor to your favorite meals, National Soy Sauce is just what you need to enjoy the perfect authentic Chinese taste.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/soy-sause-scaled.jpg"
    },
    {
        "Category":"Chinese Sauces",
        "Product":"White Vinegar",
        "Description":"National Synthetic Vinegar is the ideal companion for your favorite salads.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/chinese_white_vinegar-scaled.jpg"
    },
    {
        "Category":"Ginger Garlic Pastes",
        "Product":"Ginger Paste",
        "Description":"National Ginger Paste is prepared with pure and fresh ginger. It is your secret kitchen companion to help you prepare delicious meals everyday with convenience.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Ginger-Paste-300G.png"
    },
    {
        "Category":"Ginger Garlic Pastes",
        "Product":"Ginger Garlic Paste",
        "Description":"National Ginger &amp; Garlic Paste is prepared with pure and fresh ginger &amp; garlic. It is your secret kitchen companion to help you prepare delicious meals everyday with convenience.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Ginger-Garlic-Paste-750G.png"
    },
    {
        "Category":"Ginger Garlic Pastes",
        "Product":"Garlic Paste",
        "Description":"National Garlic Paste is prepared with pure and fresh garlic. It is your secret kitchen companion to help you prepare delicious meals everyday with convenience.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/Garlic-Paste-750G.png"
    },
    {
        "Category":"seasonings",
        "Product":"Chat Masala",
        "Description":"National Foods offers a range of savory snack mixes and seasonings; which are a combination of spices used in the preparation of traditional snack dishes.",
        "Image URL":"https:\/\/www.nfoods.com\/app\/uploads\/2021\/06\/chat-masala-2.jpg"
    }
]