[
    {
        "Category": "Rice Range",
        "Product": "Sindhi Biryani Recipe Mix",
        "Description": "“Making biryani from scratch can take time and effort however with National’s famous Sindhi biryani mix, we guarantee you will be indulging in Daigi style traditional biryani without the extra hassle. This recipe mix will ensure your chicken/meat and potatoes are cooked in our perfect blend of spices and herbs that give maximum flavour and heat with each grain of rice infused in fragrant aroma that you just can’t resist!",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/Sindhi-Biryani.jpg",
        "Recipe": "Here's a simple Sindhi Biryani recipe using the Sindhi Biryani Mix from National Foods:\n\nIngredients:\n1. National Foods Sindhi Biryani Mix (1 packet)\n2. 2 cups of basmati rice (washed and soaked for 30 minutes)\n3. 1.5 liters of water\n4. 2 tablespoons of vegetable oil\n5. 1 large onion, finely chopped\n6. 2 medium-sized tomatoes, finely chopped\n7. 2 green chilies, slit\n8. 1 inch piece of cinnamon\n9. 2 cloves\n10. 2 cardamoms\n11. 2 bay leaves\n12. 1 cup of yogurt (whisked until smooth)\n13. 1 cup of boiled and peeled potatoes\n14. 1 cup of boiled and peeled peas\n15. Salt to taste\n16. Fresh coriander leaves for garnish\n\nInstructions:\n1. Heat oil in a deep pot over medium heat. Add the chopped onions and sauté until they turn golden brown.\n2. Add the finely chopped tomatoes, green chilies, cinnamon, cloves, cardamoms, and bay leaves. Sauté until the tomatoes are soft.\n3. Add the Sindhi Biryani Mix to the pot and stir well to combine with the onions and tomatoes.\n4. Add the soaked rice to the pot, followed by 1.5 liters of water. Stir well to ensure that there are no lumps.\n5. Season with salt and bring the mixture to a boil. Once boiling, reduce the heat to low, cover the pot, and let it simmer for 15-20 minutes or until the rice is cooked and the water has been absorbed.\n6. Stir in the whisked yogurt, boiled potatoes, and peas. Mix well and let the biryani cook for an additional 5 minutes.\n7. Turn off the heat, garnish with fresh coriander leaves, and serve hot with raita and papad.\n\nEnjoy your Sindhi Biryani!",
        "Ingredients": [
            "1. National Foods Sindhi Biryani Mix (1 packet)",
            "2. 2 cups of basmati rice (washed and soaked for 30 minutes)",
            "3. 1.5 liters of water",
            "4. 2 tablespoons of vegetable oil",
            "5. 1 large onion, finely chopped",
            "6. 2 medium-sized tomatoes, finely chopped",
            "7. 2 green chilies, slit",
            "8. 1 inch piece of cinnamon",
            "9. 2 cloves",
            "10. 2 cardamoms",
            "11. 2 bay leaves",
            "12. 1 cup of yogurt (whisked until smooth)",
            "13. 1 cup of boiled and peeled potatoes",
            "14. 1 cup of boiled and peeled peas",
            "15. Salt to taste",
            "16. Fresh coriander leaves for garnish"
        ]
    },
    {
        "Category": "Rice Range",
        "Product": "Pulao Recipe Mix",
        "Description": "Prepare delicious Pulao in no time with the help of National Pulao Mix. Mixed with varieties of herbs and spices, this mix adds a fragrant aroma and wholesome flavour to every grain of rice and meat. Create your own variation of Pulao with our mix as this can be added to chicken, meat, chickpeas and/or vegetables. Best served with Raita.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/pulao-scaled.jpg",
        "Recipe": "Here's a simple and delicious recipe for Vegetable Pulao:\n\nIngredients:\n1. National Foods Pulao Recipe Mix (1 packet)\n2. Vegetable Oil (2 tablespoons)\n3. Onion (1 large, finely chopped)\n4. Garlic (2 cloves, minced)\n5. Green Chili (1-2, finely chopped) (Optional, for spice)\n6. Carrots (1 medium, sliced)\n7. Peas (1 cup, frozen)\n8. Cauliflower (1 cup, chopped)\n9. Green Bell Pepper (1 medium, chopped)\n10. Salt to taste\n11. Water (2 cups)\n12. Fresh Coriander Leaves (for garnish)\n\nInstructions:\n1. Heat oil in a large pot over medium heat. Add onions, garlic, and green chili (if using). Sauté until the onions turn translucent.\n2. Add the sliced carrots and stir-fry for a couple of minutes.\n3. Add the chopped cauliflower, peas, and green bell pepper. Stir-fry until the vegetables are slightly tender.\n4. Add the contents of the Pulao Recipe Mix packet and mix well.\n5. Add salt to taste.\n6. Pour in 2 cups of water and stir well. Bring the mixture to a boil.\n7. Reduce heat to low, cover the pot, and let it simmer for about 10-12 minutes, or until the water is fully absorbed and the rice is cooked.\n8. Turn off the heat and let it rest for a few minutes before fluffing with a fork.\n9. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Vegetable Pulao!",
        "Ingredients": [
            "1. National Foods Pulao Recipe Mix (1 packet)",
            "2. Vegetable Oil (2 tablespoons)",
            "3. Onion (1 large, finely chopped)",
            "4. Garlic (2 cloves, minced)",
            "5. Green Chili (1-2, finely chopped) (Optional)",
            "6. Carrots (1 medium, sliced)",
            "7. Peas (1 cup, frozen)",
            "8. Cauliflower (1 cup, chopped)",
            "9. Green Bell Pepper (1 medium, chopped)",
            "10. Salt to taste",
            "11. Water (2 cups)",
            "12. Fresh Coriander Leaves (for garnish)"
        ]
    },
    {
        "Category": "Rice Range",
        "Product": "Biryani Recipe Mix",
        "Description": "Making biryani from scratch can take time and effort however with National\\’s famous Biryani mix, we guarantee you will be indulging in Daigi style traditional biryani without the extra hassle. This recipe mix will ensure your chicken/meat and potatoes are cooked in our perfect blend of spices and herbs that give maximum flavour and heat with each grain of rice infused in fragrant aroma that you just can\\’t resist",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/biryani-new-pack-scaled.jpg",
        "Recipe": "Here's a simple and delicious Biryani recipe using National Foods Biryani Recipe Mix:\n\nIngredients:\n1. National Foods Biryani Recipe Mix (1 packet)\n2. 2 cups of basmati rice (washed and soaked for 30 minutes)\n3. 1.5 liters of water\n4. 4 tablespoons of vegetable oil\n5. 1 large onion (finely chopped)\n6. 2 cloves of garlic (minced)\n7. 1 inch piece of ginger (grated)\n8. 2 green chilies (slit)\n9. 1 cup of mixed vegetables (like peas, carrots, and corn)\n10. 1 cup of chopped tomatoes\n11. 1 cup of yogurt\n12. 1-2 cups of water (for the yogurt)\n13. 1 tablespoon of lemon juice\n14. Salt to taste\n15. 2 boiled potatoes, sliced (optional)\n16. 2 hard-boiled eggs, sliced (optional)\n17. 2 tablespoons of garam masala\n18. 2 tablespoons of chopped coriander leaves for garnish\n19. 2-3 green chilies, slit (for garnish)\n20. 2 limes, cut into wedges (for serving)\n\nInstructions:\n1. Heat 2 tablespoons of oil in a large pot over medium heat. Add the chopped onions, garlic, and ginger, and sauté until golden brown.\n2. Add the green chilies and mixed vegetables, and sauté for 2-3 minutes.\n3. Add the chopped tomatoes and salt, and cook until the tomatoes are soft and mushy.\n4. In a separate bowl, mix the Biryani Recipe Mix powder with yogurt and water (as per the package instructions). Add lemon juice.\n5. Add this yogurt mixture to the pot and stir well.\n6. Drain the soaked rice and add it to the pot. Stir well to ensure the rice is well coated with the mixture.\n7. Add 1.5 liters of water, and bring the mixture to a boil. Reduce the heat to low, cover the pot, and let it simmer for 15-20 minutes, or until the rice is cooked and the water has been absorbed.\n8. After the rice is cooked, fluff it with a fork and mix in the boiled potatoes and eggs (if using).\n9. Sprinkle garam masala and mix well.\n10. Garnish with chopped coriander leaves, slit green chilies, and lime wedges before serving.\n\nEnjoy your delicious Biryani!",
        "Ingredients": [
            "1. National Foods Biryani Recipe Mix (1 packet)",
            "2. 2 cups of basmati rice (washed and soaked for 30 minutes)",
            "3. 1.5 liters of water",
            "4. 4 tablespoons of vegetable oil",
            "5. 1 large onion (finely chopped)",
            "6. 2 cloves of garlic (minced)",
            "7. 1 inch piece of ginger (grated)",
            "8. 2 green chilies (slit)",
            "9. 1 cup of mixed vegetables (like peas, carrots, and corn)",
            "10. 1 cup of chopped tomatoes",
            "11. 1 cup of yogurt",
            "12. 1-2 cups of water (for the yogurt)",
            "13. 1 tablespoon of lemon juice",
            "14. Salt to taste",
            "15. 2 boiled potatoes, sliced (optional)",
            "16. 2 hard-boiled eggs, sliced (optional)",
            "17. 2 tablespoons of garam masala",
            "18. 2 tablespoons of chopped coriander leaves for garnish",
            "19. 2-3 green chilies, slit (for garnish)",
            "20. 2 limes, cut into wedges (for serving)"
        ]
    },
    {
        "Category": "Rice Range",
        "Product": "Bombay Biryani Recipe Mix",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/bombay-biryani--scaled.jpg",
        "Recipe": "Here's a simple recipe for Chicken Biryani using the Bombay Biryani Recipe Mix from National Foods:\n\nIngredients:\n1. 500g (1.1 lbs) Boneless Chicken Breasts, cut into cubes\n2. 2 tablespoons Oil\n3. 1 packet Bombay Biryani Recipe Mix from National Foods\n4. 2 cups Basmati Rice, rinsed and drained\n5. 4 cups Water\n6. 1 large Onion, finely chopped\n7. 2 medium Tomatoes, finely chopped\n8. 2 Green Chillies, slit\n9. 2 cloves Garlic, minced\n10. 1 inch Ginger, grated\n11. 1/2 cup Coriander Leaves, chopped\n12. 1 cup Yogurt (optional, for a creamier texture)\n13. Salt to taste\n14. 2 Boiled Eggs (optional)\n15. Sliced Almonds, dried fruits, and fresh coriander leaves for garnish\n\nInstructions:\n1. Heat oil in a large, heavy-bottomed pot over medium heat. Add the chopped onions and sauté until they turn golden brown.\n2. Add garlic, ginger, and green chillies to the pot and sauté for a minute.\n3. Add the finely chopped tomatoes and stir until they soften.\n4. Add the Bombay Biryani Recipe Mix and stir well to combine with the onions, tomatoes, and spices.\n5. Add the chicken cubes to the pot and stir well to coat them in the spice mixture. Cook for about 5 minutes, until the chicken is lightly browned.\n6. If using, add the yogurt and stir well to combine with the chicken and spices. Cook for another 2 minutes.\n7. Add the rinsed Basmati rice to the pot and stir well to ensure each grain is coated with the spice mixture.\n8. Add 4 cups of water to the pot and stir well. Season with salt.\n9. Bring the mixture to a boil, then reduce the heat to low, cover the pot, and let it simmer for about 20 minutes, or until the rice is cooked and the water has been absorbed.\n10. Turn off the heat and let the biryani rest for 10 minutes, covered.\n11. Fluff the rice with a fork and mix in the chopped coriander leaves.\n12. Garnish with sliced almonds, dried fruits, and fresh coriander leaves. If desired, you can also add boiled eggs to the biryani.\n13. Serve hot with raita or your choice of side dish.\n\nEnjoy your Chicken Biryani!",
        "Ingredients": [
            "1. 500g Boneless Chicken Breasts, cut into cubes",
            "2. 2 tablespoons Oil",
            "3. 1 packet Bombay Biryani Recipe Mix from National Foods",
            "4. 2 cups Basmati Rice, rinsed and drained",
            "5. 4 cups Water",
            "6. 1 large Onion, finely chopped",
            "7. 2 medium Tomatoes, finely chopped",
            "8. 2 Green Chillies, slit",
            "9. 2 cloves Garlic, minced",
            "10. 1 inch Ginger, grated",
            "11. 1/2 cup Coriander Leaves, chopped",
            "12. Yogurt (optional)",
            "13. Salt to taste",
            "14. 2 Boiled Eggs (optional)",
            "15. Sliced Almonds",
            "16. Dried fruits",
            "17. Fresh coriander leaves for garnish"
        ]
    },
    {
        "Category": "Stir-Fried Range",
        "Product": "Karahi Gosht Recipe Mix",
        "Description": "Add excitement to the dining table by serving delicious authentic Karahi Gosht with the help of National karahi gosht Recipe Mix. A flavorful blend of spices and herbs that delivers aroma and flavorsome taste. Now serve restaurant quality food from the comfort of your home.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/karahi-gosht-scaled.jpg",
        "Recipe": "Karahi Gosht Recipe Mix is a convenient preparation for making Pakistani-style mutton curry. Here's a simple recipe using this mix:\n\n**Karahi Gosht Recipe using National Foods Karahi Gosht Mix**\n\nIngredients:\n1. National Foods Karahi Gosht Mix (1 packet)\n2. 500g Mutton, cut into cubes\n3. 2 medium-sized onions, finely chopped\n4. 2 tomatoes, finely chopped\n5. 2 cloves garlic, minced\n6. 1 inch ginger, minced\n7. 2 green chilies, slit\n8. 2 tablespoons oil\n9. 1 cup water\n10. Salt to taste\n11. 2 tablespoons coriander leaves, chopped (for garnish)\n\nInstructions:\n1. Heat oil in a karahi (wok) over medium heat.\n2. Add the chopped onions and fry until they turn golden brown.\n3. Add the minced garlic and ginger, and sauté for a minute.\n4. Add the green chilies and fry for another minute.\n5. Add the chopped tomatoes and cook until they become soft and mushy.\n6. Add the contents of the Karahi Gosht Mix packet. Stir well to mix it with the onion-tomato mixture.\n7. Add mutton cubes, salt, and water. Stir well to ensure that the mutton is well coated with the spice mix.\n8. Cover the karahi and let it simmer on medium-low heat for about 30 minutes or until the mutton is tender. Stir occasionally.\n9. Garnish with chopped coriander leaves before serving.\n\nEnjoy your Karahi Gosht! Remember, you can adjust the spiciness according to your taste by adding more or fewer green chilies.",
        "Ingredients": [
            "1. National Foods Karahi Gosht Mix (1 packet)",
            "2. 500g Mutton, cut into cubes",
            "3. 2 medium-sized onions, finely chopped",
            "4. 2 tomatoes, finely chopped",
            "5. 2 cloves garlic, minced",
            "6. 1 inch ginger, minced",
            "7. 2 green chilies, slit",
            "8. 2 tablespoons oil",
            "9. 1 cup water",
            "10. Salt to taste",
            "11. 2 tablespoons coriander leaves, chopped (for garnish)"
        ]
    },
    {
        "Category": "Stir-Fried Range",
        "Product": "Achar Gosht Recipe Mix",
        "Description": "Prepare traditional chatkharidar Achar Gosht in no time with the help of National Achar Gosht Masala Mix. Mixed with varieties of herbs and spices, this mix adds a fragrant aroma and a spicy tangy flavour of pickles to your meat.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/achar-gosht-pack-scaled.jpg",
        "Recipe": "Here's a simple recipe for Achar Gosht using the mix:\n\nIngredients:\n1. 500g (1.1 lbs) boneless mutton or beef, cut into cubes\n2. 3 tablespoons Achar Gosht Recipe Mix\n3. 2 tablespoons vegetable oil\n4. 1 large onion, finely chopped\n5. 2-3 cloves garlic, minced\n6. 1 inch piece of ginger, grated\n7. 2 green chilies, slit\n8. 1 teaspoon cumin seeds\n9. 1 cup (250 ml) water\n10. Salt to taste\n11. 2 tablespoons lemon juice\n12. Fresh coriander leaves for garnish\n\nInstructions:\n1. Wash the mutton or beef cubes and pat dry with a clean kitchen towel. Set aside.\n2. Heat oil in a large pot over medium heat. Add cumin seeds and let them sizzle for a few seconds.\n3. Add the chopped onions, minced garlic, grated ginger, and slit green chilies to the pot. Sauté until the onions turn golden brown.\n4. Add the Achar Gosht Recipe Mix to the pot and stir well, making sure the spices are well-coated with the oil. Cook for a minute or two, until the aroma of the spices is released.\n5. Add the mutton or beef cubes to the pot and stir well to ensure they are evenly coated with the spice mixture. Cook for a few minutes until the meat starts to change color.\n6. Add water to the pot and stir well. Season with salt. Bring the mixture to a boil, then reduce heat to low, cover the pot, and let it simmer for about 45 minutes to an hour, or until the meat is tender. Stir occasionally to prevent the meat from sticking to the bottom of the pot.\n7. Check the seasoning and add more salt if needed. Stir in the lemon juice.\n8. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Achar Gosht with rice or roti!",
        "Ingredients": [
            "1. 500g boneless mutton or beef, cut into cubes",
            "2. 3 tablespoons Achar Gosht Recipe Mix",
            "3. 2 tablespoons vegetable oil",
            "4. 1 large onion, finely chopped",
            "5. 2-3 cloves garlic, minced",
            "6. 1 inch piece of ginger, grated",
            "7. 2 green chilies, slit",
            "8. 1 teaspoon cumin seeds",
            "9. 1 cup water",
            "10. Salt to taste",
            "11. 2 tablespoons lemon juice",
            "12. Fresh coriander leaves for garnish"
        ]
    },
    {
        "Category": "Salan Range",
        "Product": "Quorma Recipe Mix",
        "Description": "Prepare traditional Daigi style Quorma with National Quorma Recipe Mix. A combination of rich and fragrant spices and herbs that helps you prepare a delicious quorma in no time! Includes a Free ” National Bombay Biryani Recipe Mix” Sachet in the box, to add more to your dinner table.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/quoroma-scaled.jpg",
        "Recipe": "Here's a simple recipe using Quorma Recipe Mix:\n\nQuorma with Quorma Recipe Mix\n\nIngredients:\n1. Quorma Recipe Mix - 1 pack (usually around 450 grams)\n2. Vegetable Oil - 3 tablespoons\n3. Onions, finely chopped - 2 large\n4. Garlic, minced - 2 cloves\n5. Ginger, grated - 1 inch piece\n6. Tomatoes, finely chopped - 2 medium\n7. Green Chilies, finely chopped - 2 (adjust to taste)\n8. Water - 4 cups\n9. Salt to taste\n10. Coriander Leaves, finely chopped - 1 bunch\n11. Garam Masala - 1 teaspoon\n12. Red Chili Powder - 1 teaspoon\n13. Turmeric Powder - 1/2 teaspoon\n14. Yogurt, whisked - 1/2 cup (optional)\n\nInstructions:\n1. Heat oil in a large pot over medium heat. Add onions, garlic, and ginger, and sauté until they turn golden brown.\n2. Add tomatoes and green chilies, and cook until the tomatoes are soft and mushy.\n3. Add the Quorma Recipe Mix to the pot, stirring continuously to prevent burning.\n4. Pour in water, salt, garam masala, red chili powder, and turmeric. Stir well.\n5. Bring the mixture to a boil, then reduce heat and let it simmer for about 20 minutes, or until the Quorma mix has thickened.\n6. If you prefer a creamier Quorma, stir in the whisked yogurt at this point.\n7. Taste and adjust the seasoning if necessary.\n8. Garnish with chopped coriander leaves before serving.\n\nEnjoy your Quorma with rice or naan bread!",
        "Ingredients": [
            "1. Quorma Recipe Mix - 1 pack (450 grams)",
            "2. Vegetable Oil - 3 tablespoons",
            "3. Onions, finely chopped - 2 large",
            "4. Garlic, minced - 2 cloves",
            "5. Ginger, grated - 1 inch piece",
            "6. Tomatoes, finely chopped - 2 medium",
            "7. Green Chilies, finely chopped - 2",
            "8. Water - 4 cups",
            "9. Salt to taste",
            "10. Coriander Leaves, finely chopped - 1 bunch",
            "11. Garam Masala - 1 teaspoon",
            "12. Red Chili Powder - 1 teaspoon",
            "13. Turmeric Powder - 1/2 teaspoon",
            "14. Yogurt, whisked - 1/2 cup (optional)"
        ]
    },
    {
        "Category": "Salan Range",
        "Product": "Paya Recipe Mix",
        "Description": "Prepare delicious Paya salan with the help of National Paya Recipe Mix. A perfect blend of aromatic and rich herbs and spices creating a flavorsome traditional meal. An ideal dish to serve in dawat and events in the winter season.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/paya.jpg",
        "Recipe": "Here's a simple recipe for Paya, using Paya Recipe Mix:\n\n**Paya (Tripe Stew) Recipe using National Foods Paya Recipe Mix**\n\nIngredients:\n1. 1 pack of National Foods Paya Recipe Mix\n2. 1 kg of tripe (honeycomb tripe is the best for this recipe)\n3. 1 large onion, sliced\n4. 2-3 tomatoes, chopped\n5. 2-3 cloves of garlic, minced\n6. 1 thumb-sized piece of ginger, grated\n7. 4-5 cups of water\n8. Salt to taste\n9. Optional: 1-2 green chilies for spice\n10. 1 tablespoon of oil\n\nInstructions:\n1. Rinse the tripe thoroughly under cold running water. Soak it in salted water for at least 30 minutes to an hour to remove any impurities. Drain and rinse again.\n2. Heat oil in a large pot over medium heat. Add the sliced onions and sauté until they turn golden brown.\n3. Add the minced garlic and grated ginger to the pot. Stir well to mix with the onions.\n4. Add the chopped tomatoes to the pot and cook until they soften.\n5. Add the drained tripe to the pot and stir well to coat it with the tomato mixture.\n6. Dissolve the Paya Recipe Mix in 4 cups of water. Pour this mixture over the tripe.\n7. Add the remaining water (up to 5 cups) to the pot. If you prefer a thicker stew, you can add less water.\n8. Season with salt. If you like spicy food, add the green chilies at this stage.\n9. Stir well, ensure the Paya Mix is well distributed.\n10. Cover the pot and let it simmer on low heat for about 1.5 hours or until the tripe is tender. Stir occasionally to prevent the stew from sticking to the bottom of the pot.\n11. Taste and adjust the seasoning if necessary.\n12. Serve hot with rice or bread.\n\nEnjoy your Paya stew! Remember, you can always adjust the ingredients and spices to fit your personal taste preferences.",
        "Ingredients": [
            "1. National Foods Paya Recipe Mix",
            "2. 1 kg of tripe (honeycomb tripe)",
            "3. 1 large onion",
            "4. 2-3 tomatoes",
            "5. 2-3 cloves of garlic",
            "6. 1 thumb-sized piece of ginger",
            "7. Salt",
            "8. 4-5 cups of water",
            "9. Optional: 1-2 green chilies"
        ]
    },
    {
        "Category": "Salan Range",
        "Product": "Curry Powder Recipe Mix",
        "Description": "Traditional mix of cumin, turmeric, ginger spices and dry herbs, blended to form the perfect home-made style curry mix. A delicious flavorsome desi taste and a fragrant aroma to make your meal burst with flavour. A perfect option for easy cooking &amp; instant serving for any event.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/curry-scaled.jpg",
        "Recipe": "A simple recipe for Chicken Curry using National Foods Curry Powder Recipe Mix. Here it is:\n\nIngredients:\n1. 500g boneless and skinless chicken breasts, cut into bite-sized pieces\n2. 2 tablespoons vegetable oil\n3. 1 large onion, finely chopped\n4. 2 cloves garlic, minced\n5. 1 tablespoon grated ginger\n6. 2 green chilies, finely chopped (optional, for spiciness)\n7. 1 can (400g) diced tomatoes\n8. 1 can (400g) chickpeas, drained and rinsed\n9. 1 cup coconut milk\n10. 1 packet National Foods Curry Powder Recipe Mix\n11. Salt to taste\n12. Fresh coriander leaves for garnish\n13. 2 cups of cooked basmati rice to serve\n\nInstructions:\n1. Heat the oil in a large pan over medium heat. Add the chicken pieces and cook until they are browned and cooked through. Remove the chicken from the pan and set aside.\n2. In the same pan, add the onion, garlic, ginger, and green chilies. Cook until the onion is translucent.\n3. Stir in the Curry Powder Recipe Mix and cook for about a minute, until the spices are fragrant.\n4. Add the diced tomatoes, chickpeas, and coconut milk to the pan. Stir well to combine.\n5. Return the cooked chicken to the pan and season with salt to taste.\n6. Simmer the curry for about 10-15 minutes, until the flavors have melded together.\n7. Garnish with fresh coriander leaves before serving with cooked basmati rice.\n\nEnjoy your Chicken Curry! Remember, you can adjust the ingredients to your liking. If you like it spicier, you can add more green chilies, or if you prefer a creamier curry, you can add more coconut milk.",
        "Ingredients": [
            "1. 500g boneless and skinless chicken breasts",
            "2. 2 tablespoons vegetable oil",
            "3. 1 large onion",
            "4. 2 cloves garlic",
            "5. 1 tablespoon grated ginger",
            "6. 2 green chilies (optional)",
            "7. 1 can (400g) diced tomatoes",
            "8. 1 can (400g) chickpeas, drained and rinsed",
            "9. 1 cup coconut milk",
            "10. 1 packet National Foods Curry Powder Recipe Mix",
            "11. Salt to taste",
            "12. Fresh coriander leaves",
            "13. 2 cups of cooked basmati rice"
        ]
    },
    {
        "Category": "Salan Range",
        "Product": "Murghi Recipe Mix",
        "Description": "National Murghi Masala provides the ultimate blend of spices and herbs to give your Chicken Gravy a distinctive flavor and aroma. Conveniently prepare dishes without compromising on taste with help of our recipe mix.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/murghi-scaled.jpg",
        "Recipe": "Here's a simple Murghi Tikka recipe using National Foods Murghi Recipe Mix. This recipe serves 4 people.\n\nIngredients:\n1. 500g boneless chicken, cut into cubes\n2. 1 packet (250g) of National Foods Murghi Recipe Mix\n3. 1 cup yogurt\n4. 2 tablespoons oil\n5. 2 tablespoons lemon juice\n6. 2 tablespoons chopped coriander leaves\n7. Salt to taste\n8. 2 large onions, sliced\n9. 2 large green bell peppers, sliced\n10. Skewers (if you have them, otherwise you can use a baking tray)\n\nInstructions:\n1. In a large bowl, mix the Murghi Recipe Mix with yogurt, oil, lemon juice, salt, and half of the chopped coriander leaves. Add the chicken cubes and mix well to ensure all pieces are well coated. Let it marinate for at least 30 minutes or up to 2 hours in the refrigerator.\n2. Preheat your grill or broiler to medium-high heat. If using skewers, thread the marinated chicken pieces onto them. If not, you can place the pieces directly on the grill or in a single layer on a baking sheet.\n3. Grill the chicken for about 5-7 minutes on each side, or until the outside is browned and the inside is cooked through.\n4. While the chicken is grilling, heat some oil in a pan and sauté the sliced onions and bell peppers until they are softened. Season with salt to taste.\n5. Once the chicken is done, serve it with the sautéed onions and bell peppers on top. Garnish with the remaining coriander leaves.\n\nEnjoy your Murghi Tikka!",
        "Ingredients": [
            "1. 500g boneless chicken",
            "2. 1 packet (250g) of National Foods Murghi Recipe Mix",
            "3. 1 cup yogurt",
            "4. 2 tablespoons oil",
            "5. 2 tablespoons lemon juice",
            "6. 2 tablespoons chopped coriander leaves",
            "7. Salt to taste",
            "8. 2 large onions",
            "9. 2 large green bell peppers",
            "10. Skewers or a baking tray",
            "These are the ingredients listed in the Murghi Tikka recipe."
        ]
    },
    {
        "Category": "Salan Range",
        "Product": "Kofta Recipe Mix",
        "Description": "Prepare delicious kofta curry with the help of National Kofta Recipe Mix. A perfect blend of aromatic and rich herbs and spices that seasons and flavors the kofta meat perfectly.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/kofta.jpg",
        "Recipe": "Here's a simple recipe you can try:\n\n**Easy Kofta Curry**\n\nIngredients:\n1. National Foods Kofta Recipe Mix (follow the package instructions for the amount)\n2. 500g ground beef or lamb\n3. 1 large onion, finely chopped\n4. 2 cloves garlic, minced\n5. 1 cup breadcrumbs\n6. 1 egg\n7. 1 can (400g) chopped tomatoes\n8. 1 can (400g) chickpeas, drained and rinsed\n9. 2 tablespoons vegetable oil\n10. 1 teaspoon cumin seeds\n11. 1 teaspoon coriander seeds\n12. 1 teaspoon turmeric\n13. 1 teaspoon chili powder (optional)\n14. Salt to taste\n15. Fresh cilantro for garnish\n16. 2 cups water\n17. 1 can (400ml) coconut milk\n\nInstructions:\n1. In a large bowl, combine the Kofta Recipe Mix, ground meat, chopped onion, minced garlic, breadcrumbs, and egg. Mix until well combined.\n2. Shape the mixture into small oval or cylindrical balls (about 2 inches in diameter). Set aside.\n3. Heat 1 tablespoon of oil in a large pot over medium heat. Add cumin seeds and coriander seeds and let them sizzle for a few seconds.\n4. Add the kofta balls to the pot and cook until lightly browned on all sides. Remove the kofta from the pot and set aside.\n5. In the same pot, add the chopped tomatoes, chickpeas, turmeric, chili powder (if using), and salt. Stir well and cook for 5 minutes.\n6. Add water and bring the mixture to a boil. Once boiling, reduce heat to low, add the browned kofta balls, and simmer for 20-30 minutes.\n7. Stir in the coconut milk and cook for an additional 5 minutes.\n8. Garnish with fresh cilantro before serving.\n\nEnjoy your Easy Kofta Curry! Keep in mind that you may need to adjust the ingredients or cooking times based on your personal taste preferences or the specific Kofta Recipe Mix you're using.",
        "Ingredients": [
            "1. National Foods Kofta Recipe Mix",
            "2. 500g ground beef or lamb",
            "3. 1 large onion, finely chopped",
            "4. 2 cloves garlic, minced",
            "5. 1 cup breadcrumbs",
            "6. 1 egg",
            "7. 1 can (400g) chopped tomatoes",
            "8. 1 can (400g) chickpeas, drained and rinsed",
            "9. 2 tablespoons vegetable oil",
            "10. 1 teaspoon cumin seeds",
            "11. 1 teaspoon coriander seeds",
            "12. 1 teaspoon turmeric",
            "13. 1 teaspoon chili powder (optional)",
            "14. Salt to taste",
            "15. Fresh cilantro for garnish",
            "16. 2 cups water",
            "17. 1 can (400ml) coconut milk"
        ]
    },
    {
        "Category": "Salan Range",
        "Product": "Delhi Nihari Recipe Mix",
        "Description": "Indulge in traditional Delhi Nihari from the comfort of your home using National Delhi Nihari Recipe Mix; which is prepared by Pakistani cuisine experts; using the ultimate blend of spices and herbs.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/nihari-scaled.jpg",
        "Recipe": "Here's a simple recipe using Delhi Nihari Recipe Mix from National Foods. Please note that you'll need some additional ingredients to complete the dish.\n\nDelhi Nihari with National Foods Recipe Mix\n\nIngredients:\n1. National Foods Delhi Nihari Recipe Mix (1 packet)\n2. 1 kg boneless beef (cut into 1-inch cubes)\n3. 1 liter of water\n4. 2 large onions (finely chopped)\n5. 5 cloves of garlic (minced)\n6. 1-inch piece of ginger (grated)\n7. 2 green chilies (slit)\n8. 2 tbsp oil\n9. 2 tbsp ghee (clarified butter)\n10. Salt to taste\n11. 2 tbsp lemon juice\n12. Coriander leaves for garnish\n13. Seedless dates for garnish (optional)\n\nInstructions:\n1. Wash the beef cubes thoroughly and set aside.\n2. Heat oil in a large pot over medium heat. Add the beef cubes and fry until they are browned on all sides. Remove the beef from the pot and set aside.\n3. In the same pot, add ghee. Once it's hot, add the chopped onions, minced garlic, and grated ginger. Sauté until the onions are golden brown.\n4. Add the slit green chilies to the pot and stir for a minute.\n5. Now, add the Delhi Nihari Recipe Mix to the pot. Stir well to ensure it's evenly distributed.\n6. Pour water into the pot and mix well. Bring the mixture to a boil.\n7. Once boiling, add the browned beef cubes back into the pot. Reduce the heat to low, cover the pot, and let it simmer for about 1.5 to 2 hours, or until the beef is tender and the gravy has thickened. Stir occasionally to prevent burning.\n8. Season with salt to taste. Add lemon juice and stir well.\n9. Garnish with coriander leaves and seedless dates (if using).\n10. Serve hot with rice or naan bread.\n\nEnjoy your Delhi Nihari! Keep in mind that the cooking time may vary depending on the size and cut of the beef cubes. Always ensure that the beef is fully cooked before serving.",
        "Ingredients": [
            "1. National Foods Delhi Nihari Recipe Mix (1 packet)",
            "2. 1 kg boneless beef (cut into 1-inch cubes)",
            "3. 1 liter of water",
            "4. 2 large onions (finely chopped)",
            "5. 5 cloves of garlic (minced)",
            "6. 1-inch piece of ginger (grated)",
            "7. 2 green chilies (slit)",
            "8. 2 tbsp oil",
            "9. 2 tbsp ghee (clarified butter)",
            "10. Salt to taste",
            "11. 2 tbsp lemon juice",
            "12. Coriander leaves for garnish",
            "13. Seedless dates for garnish (optional)"
        ]
    },
    {
        "Category": "BBQ Range",
        "Product": "Tikka Boti Recipe mix",
        "Description": "Indulge in a traditional BBQ by making delicious mouth watering tikka with National Tikka Boti Masala. A tantalizing blend of spices and fragrant herbs that helps make the meat tender and juicy. Now you can enjoy your favourite Tikka recipe at home without the extra hassle.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/tikka-boti.jpg",
        "Recipe": "Here's a simple Tikka Boti recipe using the Tikka Boti Recipe Mix from National Foods:\n\nIngredients:\n1. 500g boneless chicken breast, cut into 1-inch cubes\n2. 1 packet of National Foods Tikka Boti Recipe Mix\n3. 1 large onion, finely chopped\n4. 2-3 cloves garlic, minced\n5. 1 inch ginger, grated\n6. 2 green chilies, slit\n7. 2 tomatoes, finely chopped\n8. 1 tsp coriander powder\n9. 1 tsp cumin powder\n10. 1 tsp red chili powder (optional)\n11. 1 tsp garam masala\n12. 2 tbsp oil\n13. Salt to taste\n14. 2 tbsp fresh coriander leaves, chopped\n15. 2 tbsp yogurt (optional)\n\nInstructions:\n1. Rinse the chicken cubes under cold water and pat dry with a paper towel.\n2. In a bowl, mix the chicken cubes with half the packet of Tikka Boti Recipe Mix, salt, and yogurt (if using). Let it marinate for at least 30 minutes, or overnight for best results.\n3. Heat oil in a non-stick pan over medium heat. Add the marinated chicken cubes and cook until they are browned on all sides. Remove the chicken from the pan and set aside.\n4. In the same pan, add onions, garlic, and ginger. Sauté until the onions are translucent.\n5. Add green chilies and tomatoes to the pan. Cook until the tomatoes are soft and mushy.\n6. Add the remaining Tikka Boti Recipe Mix, coriander powder, cumin powder, red chili powder (if using), and garam masala to the pan. Stir well to coat the vegetables.\n7. Add the cooked chicken back into the pan. Stir well to combine with the vegetables and spices. Cook for another 5 minutes.\n8. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Tikka Boti with rice or naan bread!",
        "Ingredients": [
            "1. 500g boneless chicken breast",
            "2. 1 packet of National Foods Tikka Boti Recipe Mix",
            "3. 1 large onion",
            "4. 2-3 cloves garlic",
            "5. 1 inch ginger",
            "6. 2 green chilies",
            "7. 2 tomatoes",
            "8. 1 tsp coriander powder",
            "9. 1 tsp cumin powder",
            "10. 1 tsp red chili powder (optional)",
            "11. 1 tsp garam masala",
            "12. 2 tbsp oil",
            "13. Salt to taste",
            "14. 2 tbsp fresh coriander leaves",
            "15. 2 tbsp yogurt (optional)"
        ]
    },
    {
        "Category": "BBQ Range",
        "Product": "Seekh Kabab Recipe Mix",
        "Description": "Indulge in a traditional BBQ by using National’s Bihari Kabab Mix to create signature Bihari style kebabs with the perfect blend of hot spices for a delicious marinade. Now you can enjoy spicy, delicious Bihari Style BBQ meat without the extra hassle.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/seekh-kabab.jpg",
        "Recipe": "Here's a simple Seekh Kabab recipe using the Seekh Kabab Recipe Mix from National Foods:\n\nIngredients:\n1. National Foods Seekh Kabab Recipe Mix (1 packet)\n2. 500g of minced lamb or mutton\n3. 1 large onion, finely chopped\n4. 2 cloves of garlic, minced\n5. 1 inch ginger, grated\n6. 1 green chili, finely chopped (optional)\n7. 1 egg\n8. 1 tsp garam masala\n9. Salt to taste\n10. Oil for frying\n11. Skewers (soaked in water for at least 30 minutes)\n\nInstructions:\n1. In a large bowl, combine the minced meat, finely chopped onions, minced garlic, grated ginger, and green chili (if using).\n2. Add the contents of the National Foods Seekh Kabab Recipe Mix packet to the meat mixture.\n3. Beat the egg in a separate bowl, then add it to the meat mixture and mix well until all the ingredients are thoroughly combined.\n4. Season the mixture with salt and garam masala, then mix again.\n5. Shape the meat mixture into long, cylindrical shapes and thread them onto the soaked skewers.\n6. Preheat a grill or griddle pan over medium-high heat. Brush the skewers with oil.\n7. Place the skewers on the grill or griddle pan and cook for about 5-6 minutes on each side, or until the kababs are cooked through and slightly charred.\n8. Serve the Seekh Kababs hot with naan bread, rice, or your favorite side dish.\n\nEnjoy your Seekh Kababs!",
        "Ingredients": [
            "1. National Foods Seekh Kabab Recipe Mix (1 packet)",
            "2. 500g of minced lamb or mutton",
            "3. 1 large onion, finely chopped",
            "4. 2 cloves of garlic, minced",
            "5. 1 inch ginger, grated",
            "6. 1 green chili, finely chopped (optional)",
            "7. 1 egg",
            "8. 1 tsp garam masala",
            "9. Salt to taste",
            "10. Oil for frying",
            "11. Skewers (soaked in water for at least 30 minutes)"
        ]
    },
    {
        "Category": "BBQ Range",
        "Product": "Chicken Tandouri Recipe Mix",
        "Description": "Indulge in a traditional desi BBQ by using National’s Chicken Tandoori Mix to create signature tandoori with the perfect blend of hot spices for succulant and juicy chicken. Now you can enjoy authentic spicy and delicious chicken tandoori at home without the extra hassle.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/Chicken-Tandoori.jpg",
        "Recipe": "Here's a simple recipe for Chicken Tandori using the National Foods Chicken Tandori Recipe Mix:\n\nIngredients:\n1. 1 kg (2.2 lbs) boneless, skinless chicken breasts or thighs, cut into pieces\n2. 1 packet of National Foods Chicken Tandori Recipe Mix\n3. 1 cup of yogurt\n4. 2-3 tablespoons of oil\n5. 2-3 cloves of garlic, minced\n6. 1 inch piece of ginger, grated\n7. 1-2 green chilies, finely chopped (optional, for spiciness)\n8. Juice of 1 lemon\n9. Salt to taste\n10. Fresh coriander leaves for garnish\n\nInstructions:\n1. In a large bowl, combine the chicken pieces, yogurt, garlic, ginger, green chilies, and salt. Mix well to ensure the chicken is well coated.\n2. Add the contents of the Chicken Tandori Recipe Mix packet to the bowl and mix again. Make sure all the chicken pieces are well coated with the spice mix.\n3. Cover the bowl and let it marinate in the refrigerator for at least 2 hours, or overnight for best results.\n4. Preheat your oven to 200 degrees Celsius (400 degrees Fahrenheit).\n5. Line a baking tray with aluminum foil and brush it with oil. Place the marinated chicken pieces on the tray, ensuring they are not overlapping.\n6. Drizzle the lemon juice over the chicken and sprinkle a little oil on top.\n7. Bake in the preheated oven for about 20-25 minutes, or until the chicken is cooked through and the exterior is slightly charred.\n8. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Chicken Tandori! Remember, you can adjust the spiciness by adding more or less green chilies, and you can also use chicken breasts or thighs, depending on your preference.",
        "Ingredients": [
            "1. 1 kg (2.2 lbs) boneless, skinless chicken breasts or thighs, cut into pieces",
            "2. 1 packet of National Foods Chicken Tandori Recipe Mix",
            "3. 1 cup of yogurt",
            "4. 2-3 tablespoons of oil",
            "5. 2-3 cloves of garlic, minced",
            "6. 1 inch piece of ginger, grated",
            "7. 1-2 green chilies, finely chopped (optional)",
            "8. Juice of 1 lemon",
            "9. Salt to taste",
            "10. Fresh coriander leaves for garnish"
        ]
    },
    {
        "Category": "BBQ Range",
        "Product": "Chicken Tikka Recipe Mix",
        "Description": "Indulge in a traditional desi BBQ by using National’s Chicken Tikka Mix to create signature chicken tikka with the perfect blend of hot spices for succulant and juicy chicken. Now you can enjoy authentic spicy and delicious chicken tandoori at home without the extra hassle. This mix can be used as a seasoning or flavouring for other dishes like sandwiches, pasta and many more.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/chicken-tikka-scaled.jpg",
        "Recipe": "Here's a simple Chicken Tikka recipe using National Foods Chicken Tikka Recipe Mix:\n\nIngredients:\n1. 500g Chicken Breast, cut into cubes\n2. 1 packet of National Foods Chicken Tikka Recipe Mix\n3. 1 cup of Greek Yogurt\n4. 2 tablespoons of Vegetable Oil\n5. 2 tablespoons of Lemon Juice\n6. Salt to taste\n7. Optional: Chopped coriander for garnish\n\nSteps:\n1. In a large bowl, mix the Chicken Tikka Recipe Mix, yogurt, vegetable oil, lemon juice, and salt. Make sure all the chicken cubes are well coated.\n2. Marinate the chicken for at least 2 hours, or preferably overnight, in the refrigerator.\n3. Preheat your grill or broiler. If using a grill, thread the chicken cubes onto skewers.\n4. Grill or broil the chicken for about 5-7 minutes on each side, or until the chicken is fully cooked and slightly charred.\n5. Once cooked, let the chicken rest for a few minutes before serving.\n6. Garnish with chopped coriander before serving.\n\nEnjoy your Chicken Tikka! Remember, you can always adjust the spice level to your liking by adding more or less Recipe Mix.",
        "Ingredients": [
            "1. 500g Chicken Breast, cut into cubes",
            "2. 1 packet of National Foods Chicken Tikka Recipe Mix",
            "3. 1 cup of Greek Yogurt",
            "4. 2 tablespoons of Vegetable Oil",
            "5. 2 tablespoons of Lemon Juice",
            "6. Salt to taste",
            "7. Optional: Chopped coriander for garnish"
        ]
    },
    {
        "Category": "Fried Range",
        "Product": "Fish Recipe Mix",
        "Description": "Create your favourite spicy Fish recipe with the help of National Fish Recipe Mix. A blend of flavorful spices and fragrant herbs to make the perfect marination for any kind of fish. Helps in tenderizing and absorbing flavour. Perfect for fried, grilled and roasted fish.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/fish-scaled.jpg",
        "Recipe": "A recipe you can make using National Foods Fish Recipe Mix is a \"Spicy Fried Fish.\" Here's a simple recipe:\n\nIngredients:\n1. 500g of your preferred fish fillets (like cod or hake), cut into bite-sized pieces\n2. 1 packet of National Foods Fish Recipe Mix\n3. 2 cups of vegetable oil for frying\n4. Salt to taste\n5. Lemon wedges and fresh coriander leaves for garnish (optional)\n\nInstructions:\n1. Rinse the fish fillets under cold water and pat dry with a kitchen towel. Season with a little salt.\n2. In a large bowl, add the fish fillets and sprinkle the entire packet of National Foods Fish Recipe Mix over them. Make sure each piece is well coated.\n3. Heat the vegetable oil in a deep frying pan or wok over medium-high heat. The oil is ready when a drop of water sizzles and pops.\n4. Carefully add a few pieces of coated fish into the hot oil. Do not overcrowd the pan. Fry for about 2-3 minutes on each side, or until the fish is golden brown and crispy.\n5. Remove the fried fish from the oil and drain on a paper towel-lined plate. Repeat with the remaining fish pieces.\n6. Serve the spicy fried fish hot, garnished with lemon wedges and fresh coriander leaves if desired.\n\nEnjoy your meal! Remember, you can adjust the spiciness of the recipe by adding more or less chili powder in the Fish Recipe Mix.",
        "Ingredients": [
            "1. 500g of preferred fish fillets (like cod or hake), cut into bite-sized pieces",
            "2. 1 packet of National Foods Fish Recipe Mix",
            "3. 2 cups of vegetable oil for frying",
            "4. Salt to taste",
            "5. Lemon wedges (optional)",
            "6. Fresh coriander leaves (optional)"
        ]
    },
    {
        "Category": "Fried Range",
        "Product": "Shami Kabab",
        "Description": "National’s Shami Kabab Recipe Mix helps you prepare delicious shami Kababs at home with the perfect blend mix of spices and herbs to give you that authentic flavour. Now you can enjoy home made spicy, mouth watering Shami Kababs without the extra hassle.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/Shami-Kabab.jpg",
        "Recipe": "Here's a simple recipe using National Foods Shami Kabab:\n\n**Shami Kabab with National Foods Shami Kabab**\n\nIngredients:\n1. 1 pack of National Foods Shami Kabab (approximately 450g)\n2. 1 large onion, finely chopped\n3. 2 cloves of garlic, minced\n4. 1 inch ginger, grated\n5. 1 green chili, finely chopped (optional, for spice)\n6. 1 egg\n7. 2-3 tbsp breadcrumbs\n8. 2 tbsp oil for frying\n9. Coriander leaves for garnish\n10. Salt to taste\n\nInstructions:\n1. Thaw the National Foods Shami Kabab according to the package instructions. Once thawed, crumble the Shami Kabab into a large bowl.\n2. Add the finely chopped onion, minced garlic, grated ginger, and chopped green chili (if using) to the bowl. Mix well to combine with the Shami Kabab.\n3. Crack the egg into the bowl and mix it in. The egg acts as a binder to help the Shami Kabab hold its shape when fried.\n4. Add breadcrumbs to the mixture. This will help in binding the Shami Kabab better and also give it a nice crust when fried. Add breadcrumbs until the mixture is no longer sticky.\n5. Season with salt to taste.\n6. Shape the mixture into small patties. You can make them as big or small as you like, but smaller patties will cook faster.\n7. Heat oil in a non-stick frying pan over medium heat. Once the oil is hot, carefully place the Shami Kabab patties into the pan.\n8. Fry the Shami Kabab on both sides until they are golden brown and crispy. This should take about 3-4 minutes per side.\n9. Once done, drain the Shami Kabab on a paper towel to remove excess oil.\n10. Garnish with coriander leaves before serving.\n\nEnjoy your Shami Kabab with National Foods Shami Kabab! You can serve it with rice, roti, or naan, and a side of raita or chutney.",
        "Ingredients": [
            "1. National Foods Shami Kabab (approximately 450g)",
            "2. 1 large onion, finely chopped",
            "3. 2 cloves of garlic, minced",
            "4. 1 inch ginger, grated",
            "5. 1 green chili, finely chopped (optional)",
            "6. 1 egg",
            "7. 2-3 tbsp breadcrumbs",
            "8. 2 tbsp oil for frying",
            "9. Coriander leaves for garnish",
            "10. Salt to taste"
        ]
    },
    {
        "Category": "Fried Range",
        "Product": "Broast Recipe Mix",
        "Description": "Prepare delicious crispy and spicy coating for your broast with National Broast Batter Mix Masala. Incredibly easy to prepare and cook. Flavorsome spices and herbs blended in a batter mix that coats the meat to perfection and brings out the classic broast look and taste at home in a matter of minutes. Serve it with fries and National’s Garlic Mayo to enhance the eating experience.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/broast.jpg",
        "Recipe": "Here's a simple recipe for Broasted Chicken using National Foods Broast Recipe Mix:\n\nIngredients:\n1. 4-5 pounds of whole chicken, cut into pieces (breasts, legs, wings, and drums)\n2. 1 1/2 cups of National Foods Broast Recipe Mix\n3. 2 cups of water\n4. Vegetable oil for frying\n\nInstructions:\n1. Rinse the chicken pieces under cold water and pat dry with paper towels. Set aside.\n2. In a large bowl, combine the Broast Recipe Mix and water. Stir until the mix is completely dissolved.\n3. Submerge the chicken pieces in the mixture, making sure they are fully coated. Let them soak for at least 30 minutes, or up to 2 hours for a more intense flavor.\n4. Heat vegetable oil in a deep fryer to 350 degrees Fahrenheit. If you don't have a deep fryer, you can also use a large, deep pot with at least 4 inches of oil.\n5. Carefully place the coated chicken pieces into the hot oil, being careful not to overcrowd the pot. Fry for 12-15 minutes, or until the chicken is golden brown and cooked through. Make sure to turn the pieces over halfway through the cooking time.\n6. Remove the chicken from the oil and drain on paper towels. Season with salt if desired.\n7. Serve the Broasted Chicken hot, with your choice of sides.\n\nEnjoy your meal! Remember, you can always adjust the ingredients to your taste. If you want the chicken to be spicier, you can add some cayenne pepper to the Broast Recipe Mix. If you prefer a milder flavor, you can use less of the mix or use less water when mixing it.",
        "Ingredients": [
            "1. 4-5 pounds of whole chicken, cut into pieces (breasts, legs, wings, and drums)",
            "2. 1 1/2 cups of National Foods Broast Recipe Mix",
            "3. 2 cups of water",
            "4. Vegetable oil for frying"
        ]
    },
    {
        "Category": "Fried Range",
        "Product": "Chapli Kabab Recipe Mix",
        "Description": "Indulge in a traditional BBQ by using National’s Chapli Kabab Mix to create signature kebabs with the perfect blend of hot spices for delicious tender meat. Now you can enjoy authentic spicy and delicious chapli kebabs at home without the extra hassle.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/chapli-kabab.jpg",
        "Recipe": "Here's a simple Chapli Kabab recipe using the Chapli Kabab Recipe Mix from National Foods:\n\nIngredients:\n1. National Foods Chapli Kabab Recipe Mix (1 packet)\n2. 500g Minced Meat (Beef or Lamb)\n3. 1 Large Onion, finely chopped\n4. 2-3 Green Chilies, finely chopped\n5. 2 cloves Garlic, minced\n6. 1 inch Ginger, grated\n7. 1 Egg\n8. 2-3 tablespoons Oil\n9. Salt to taste\n10. Water as required\n\nInstructions:\n1. In a large bowl, mix the Chapli Kabab Recipe Mix with the minced meat.\n2. Add the finely chopped onion, green chilies, minced garlic, and grated ginger to the bowl.\n3. Beat an egg and add it to the mixture.\n4. Season with salt to your taste.\n5. Gradually add water to the mixture, a tablespoon at a time, until the mixture holds together but is not too wet.\n6. Using your hands, shape the mixture into flat, round patties.\n7. Heat oil in a non-stick pan over medium heat.\n8. Place the Chapli Kabab patties in the pan and cook until they are golden brown on both sides. This usually takes about 3-4 minutes per side.\n9. Once cooked, drain the excess oil on a paper towel.\n10. Serve the Chapli Kababs hot with your favorite side dishes.\n\nEnjoy your Chapli Kababs! Remember, you can always adjust the ingredients to your taste. Happy cooking!",
        "Ingredients": [
            "1. National Foods Chapli Kabab Recipe Mix (1 packet)",
            "2. 500g Minced Meat (Beef or Lamb)",
            "3. 1 Large Onion, finely chopped",
            "4. 2-3 Green Chilies, finely chopped",
            "5. 2 cloves Garlic, minced",
            "6. 1 inch Ginger, grated",
            "7. 1 Egg",
            "8. Salt to taste",
            "9. Water as required",
            "10. 2-3 tablespoons Oil"
        ]
    },
    {
        "Category": "Haleem Range",
        "Product": "Quick Cook Haleem",
        "Description": "Looking for a convenient Haleem Mix with an authentic Haleem flavor? Look no further than National\\’s Quick Cook Haleem. This recipe mix is a blend of spices and lentils that will help you cook traditional Haleem in no time.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/easy-haleem-scaled.jpg",
        "Recipe": "Here's a simple recipe using Quick Cook Haleem from National Foods:\n\n**Quick Cook Haleem One-Pot Meal**\n\nIngredients:\n1. 1 pack (600g) of National Foods Quick Cook Haleem\n2. 4 cups of water\n3. 2 tablespoons of vegetable oil\n4. 1 large onion, finely chopped\n5. 2 cloves of garlic, minced\n6. 1 inch piece of ginger, grated\n7. 1 teaspoon cumin seeds\n8. 1 teaspoon coriander seeds\n9. 2 green chilies, slit\n10. 1/2 teaspoon turmeric powder\n11. Salt to taste\n12. 1 cup of chopped mixed vegetables (like carrots, peas, and corn) (optional)\n13. 1 cup of chopped nuts (like almonds and cashews) (optional)\n14. Fresh coriander leaves for garnish\n15. Lemon wedges for serving\n\nInstructions:\n1. Heat the vegetable oil in a large pot over medium heat.\n2. Add the cumin seeds and coriander seeds. Let them sizzle for a few seconds.\n3. Add the chopped onion, garlic, and ginger. Sauté until the onion turns golden brown.\n4. Add the green chilies and turmeric powder. Stir for a minute.\n5. Add the Quick Cook Haleem and mix well with the onion mixture.\n6. Pour in 4 cups of water and stir well. If you're using vegetables or nuts, add them now.\n7. Bring the mixture to a boil, then reduce the heat and let it simmer for about 10 minutes, or until the vegetables are tender if you're using them.\n8. Season with salt to taste.\n9. Garnish with fresh coriander leaves and serve hot with lemon wedges.\n\nEnjoy your Quick Cook Haleem!",
        "Ingredients": [
            "1. National Foods Quick Cook Haleem (600g pack)",
            "2. 4 cups of water",
            "3. Vegetable oil (2 tablespoons)",
            "4. 1 large onion, finely chopped",
            "5. 2 cloves of garlic, minced",
            "6. 1 inch piece of ginger, grated",
            "7. 1 teaspoon cumin seeds",
            "8. 1 teaspoon coriander seeds",
            "9. 2 green chilies, slit",
            "10. 1/2 teaspoon turmeric powder",
            "11. Salt to taste",
            "12. 1 cup of chopped mixed vegetables (optional)",
            "13. 1 cup of chopped nuts (optional)",
            "14. Fresh coriander leaves for garnish",
            "15. Lemon wedges for serving"
        ]
    },
    {
        "Category": "Haleem Range",
        "Product": "Haleem Recipe Mix",
        "Description": "Prepare delicious authentic Haleem with National. A blend of spices, lentils mix and your choice of meat, stirred and cooked to perfection to make this wholesome meal for any event.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/haleem.jpg",
        "Recipe": "Here's a simple Haleem recipe using National Foods Haleem Recipe Mix. Please note that you'll need to adjust the quantities based on the size of your serving.\n\nIngredients:\n1. National Foods Haleem Recipe Mix (follow package instructions for amount)\n2. 2 cups of water\n3. 2 cups of cooked lentils (chana dal or toor dal)\n4. 2 cups of cooked meat (like mutton or chicken, optional)\n5. 2 medium-sized onions, finely chopped\n6. 2 cloves of garlic, minced\n7. 1-inch piece of ginger, grated\n8. 2 green chilies, finely chopped (optional, for spice)\n9. 1 tablespoon ghee or oil\n10. Salt to taste\n11. 2 tablespoons of finely chopped coriander leaves for garnish\n12. Water as needed (for cooking)\n\nInstructions:\n1. Heat ghee or oil in a large pot over medium heat. Add the chopped onions, garlic, and ginger. Sauté until the onions turn golden brown.\n2. Add the green chilies (if using) and sauté for a minute.\n3. Add the Haleem Recipe Mix to the pot and stir well to combine with the onion mixture.\n4. Add 2 cups of water and stir until the mix is well combined. Bring the mixture to a boil.\n5. Once boiling, reduce heat to low and let it simmer for about 10-15 minutes, stirring occasionally.\n6. Add the cooked lentils and meat (if using) to the pot. Stir well to combine.\n7. If the mixture is too thick, add more water as needed to reach your desired consistency.\n8. Season with salt and let it simmer for another 10-15 minutes, stirring occasionally.\n9. Taste and adjust seasoning if necessary.\n10. Garnish with chopped coriander leaves before serving.\n11. Serve hot with raita or lemon wedges.\n\nEnjoy your homemade Haleem!",
        "Ingredients": [
            "1. National Foods Haleem Recipe Mix",
            "2. 2 cups of water",
            "3. 2 cups of cooked lentils (chana dal or toor dal)",
            "4. 2 cups of cooked meat (like mutton or chicken, optional)",
            "5. 2 medium-sized onions, finely chopped",
            "6. 2 cloves of garlic, minced",
            "7. 1-inch piece of ginger, grated",
            "8. 2 green chilies, finely chopped (optional, for spice)",
            "9. 1 tablespoon ghee or oil",
            "10. Salt to taste",
            "11. 2 tablespoons of finely chopped coriander leaves for garnish",
            "12. Water as needed (for cooking)"
        ]
    },
    {
        "Category": "Haleem Range",
        "Product": "Daigi Danedar Haleem Recipe Mix",
        "Description": "Get the familiar taste of Traditional Daighi Danedar Haleem with National. A blend of spices, lentils mix and your choice of meat, stirred to perfection to make the ideal traditional meal for any event.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/dandar-haleem-scaled.jpg",
        "Recipe": "Here's a simple Daali Danedar Haleem recipe using Daagi Danedar Haleem Recipe Mix from National Foods. Please note that you'll need to add some additional ingredients to make it complete.\n\nIngredients:\n1. Daagi Danedar Haleem Recipe Mix (1 packet, approximately 350g)\n2. Water (4 cups)\n3. Ghee or vegetable oil (2 tablespoons)\n4. Onions (1 medium, finely chopped)\n5. Garlic (2 cloves, minced)\n6. Green chilies (2, finely chopped)\n7. Tomatoes (2 medium, finely chopped)\n8. Salt to taste\n9. Garam Masala (1 teaspoon)\n10. Chili powder (1 teaspoon)\n11. Cumin seeds (1 teaspoon)\n12. Boiled chickpeas (1 cup)\n13. Boiled lentils (1 cup)\n14. Roasted chana (1/2 cup)\n15. Garnish with chopped coriander leaves and fried onions\n\nInstructions:\n1. In a large pot, heat ghee or vegetable oil over medium heat. Add cumin seeds and let them sizzle for a few seconds.\n2. Add finely chopped onions and sauté until they turn golden brown.\n3. Add minced garlic and green chilies and sauté for a minute.\n4. Add finely chopped tomatoes and cook until they soften.\n5. Add salt, garam masala, and chili powder. Stir well.\n6. Add Daagi Danedar Haleem Recipe Mix to the pot. Mix it well with the onion, tomato, and spice mix.\n7. Gradually add 4 cups of water to the pot. Stir well to avoid lumps.\n8. Bring the mixture to a boil, then reduce the heat to low and let it simmer for about 20 minutes, stirring occasionally.\n9. Once the mixture has thickened, add boiled chickpeas, lentils, and roasted chana. Stir well.\n10. Cook for another 5 minutes.\n11. Garnish with chopped coriander leaves and fried onions before serving.\n\nEnjoy your Daali Danedar Haleem!",
        "Ingredients": [
            "1. Daagi Danedar Haleem Recipe Mix (approximately 350g)",
            "2. Water (4 cups)",
            "3. Ghee or vegetable oil (2 tablespoons)",
            "4. Onions (1 medium, finely chopped)",
            "5. Garlic (2 cloves, minced)",
            "6. Green chilies (2, finely chopped)",
            "7. Tomatoes (2 medium, finely chopped)",
            "8. Salt to taste",
            "9. Garam Masala (1 teaspoon)",
            "10. Chili powder (1 teaspoon)",
            "11. Cumin seeds (1 teaspoon)",
            "12. Boiled chickpeas (1 cup)",
            "13. Boiled lentils (1 cup)",
            "14. Roasted chana (1/2 cup)",
            "15. Chopped coriander leaves",
            "16. Fried onions"
        ]
    },
    {
        "Category": "Rozana Range",
        "Product": "Chatkharaydaar Sabzi Recipe Mix",
        "Description": "Are you tired of cooking repetitive Sabzi recipes with the same ordinary taste? Add a burst of flavor and irresistible aroma by using National Chatkharaydaar Sabzi Recipe Mix and amaze your family. Used and recommended by Pakistani cuisine experts; the Chatkharaydaar Sabzi Recipe mix adds a tangy twist to your vegetarian dishes. Just one sachet prepares a delicious meal for your entire family of 5-6 people.Get your Rozana box now, that contains 2 sachets of Rozana Recipes and a whole load of tangy, spicy goodness.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/chatkharaydaar-sabzi.jpg",
        "Recipe": "Here's a simple recipe you can follow:\n\n**Chatkharaydaar Sabzi Recipe**\n\nIngredients:\n1. Chatkharaydaar Sabzi Recipe Mix - 1 packet (contains turmeric, chili, coriander, cumin, and other spices)\n2. Vegetables (like carrots, cauliflower, French beans, peas, and potatoes) - 2 cups, cut into bite-sized pieces\n3. Oil - 2 tablespoons\n4. Water - 1.5 cups\n5. Salt to taste\n6. Fresh coriander leaves for garnish (optional)\n\nSteps:\n1. Heat oil in a pan over medium heat.\n2. Add the vegetables to the pan and sauté for a few minutes until they start to soften.\n3. Add the contents of the Chatkharaydaar Sabzi Recipe Mix packet to the pan. Stir well to coat the vegetables evenly.\n4. Add water and salt to the pan. Bring the mixture to a boil.\n5. Reduce heat, cover the pan, and let it simmer until the vegetables are tender. This should take about 10-15 minutes.\n6. Stir occasionally to prevent the vegetables from sticking to the bottom of the pan.\n7. Once the vegetables are cooked, turn off the heat. Garnish with fresh coriander leaves if desired.\n8. Serve hot with roti, rice, or any other Indian bread.\n\nEnjoy your Chatkharaydaar Sabzi!",
        "Ingredients": [
            "1. Chatkharaydaar Sabzi Recipe Mix",
            "2. Vegetables (carrots, cauliflower, French beans, peas, potatoes)",
            "3. Oil",
            "4. Water",
            "5. Salt",
            "6. Fresh coriander leaves (optional)"
        ]
    },
    {
        "Category": "Rozana Range",
        "Product": "Mazedaar Daal Recipe Mix",
        "Description": "Are you tired of cooking repetitive recipes with the same ordinary taste? Add a burst of flavor and irresistible aroma by using National Mazedaar Daal Recipe Mix and amaze your family. Used and recommended by Pakistani cuisine experts; the Mazedaar Daal Recipe mix is prepared with a special taste of chicken flavour to enhance your meal. Just one sachet prepares a delicious meal for your entire family of 5-6 people.Get your Rozana box now, that contains 2 sachets of Rozana Recipes and a whole load of flavour and spicy goodness.",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/mazedaar-daal.jpg",
        "Recipe": "Here's a simple recipe using Mazedaar Daal Recipe Mix from National Foods. This is a one-pot lentil curry that's quick and easy to prepare.\n\nIngredients:\n1. Mazedaar Daal Recipe Mix (1 packet, about 200g)\n2. 4 cups of water\n3. 2 tablespoons of vegetable oil\n4. 1 medium-sized onion, finely chopped\n5. 2 cloves of garlic, minced\n6. 1 inch piece of ginger, grated\n7. 1 green chili, finely chopped (optional, for spiciness)\n8. 1 teaspoon cumin seeds\n9. 1 teaspoon coriander seeds\n10. 1/2 teaspoon turmeric powder\n11. Salt to taste\n12. 2 tablespoons of lemon juice\n13. Fresh coriander leaves for garnish\n\nInstructions:\n1. Heat the oil in a large pot over medium heat.\n2. Add the cumin seeds and coriander seeds. Once they start to sizzle, add the chopped onion, garlic, ginger, and green chili (if using). Sauté until the onion is translucent.\n3. Add the Mazedaar Daal Recipe Mix to the pot and stir well to coat it with the oil and spices.\n4. Pour in 4 cups of water and stir well. Add turmeric powder and salt.\n5. Bring the mixture to a boil, then reduce the heat to low, cover the pot, and let it simmer for about 20-25 minutes, or until the lentils are tender.\n6. Once the daal is cooked, stir in the lemon juice. Taste and adjust the seasoning if needed.\n7. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Mazedaar Daal! This dish is typically served with rice or flatbread, like roti or naan.",
        "Ingredients": [
            "1. Mazedaar Daal Recipe Mix (about 200g)",
            "2. 4 cups of water",
            "3. Vegetable oil (2 tablespoons)",
            "4. Medium-sized onion (1), finely chopped",
            "5. Garlic (2 cloves), minced",
            "6. Ginger (1 inch piece), grated",
            "7. Green chili (1), finely chopped (optional)",
            "8. Cumin seeds (1 teaspoon)",
            "9. Coriander seeds (1 teaspoon)",
            "10. Turmeric powder (1/2 teaspoon)",
            "11. Salt (to taste)",
            "12. Lemon juice (2 tablespoons)",
            "13. Fresh coriander leaves (for garnish)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Turmeric Powder",
        "Description": "Add a unique flavor and irresistible savour to your dishes with the help of National Turmeric Powder. The rich yellow color; tempting aroma and fine texture makes this the perfect ingredient to add in your delicacies for a burst of flavor.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/turmeric-scaled.jpg",
        "Recipe": "Here's a simple and delicious Turmeric Golden Milk recipe for you:\n\nIngredients:\n1. 1 cup of almond milk (or any other plant-based milk of your preference)\n2. 1 teaspoon of Turmeric Powder from National Foods\n3. 1 teaspoon of honey (or any other natural sweetener of your choice)\n4. A small piece of fresh ginger (about 1 inch long, peeled and sliced)\n5. A pinch of black pepper (this enhances the bioavailability of turmeric)\n6. A pinch of cinnamon (optional, for added flavor)\n\nInstructions:\n1. In a small saucepan, combine the almond milk, turmeric powder, honey, ginger, and black pepper.\n2. Heat the mixture over medium heat, stirring occasionally, until it just begins to simmer.\n3. Remove from heat and let it steep for a few minutes to allow the flavors to meld together.\n4. Strain the mixture to remove the ginger pieces. You can choose to leave them in if you prefer a stronger ginger flavor.\n5. If you like, you can sprinkle a pinch of cinnamon on top before serving.\n6. Enjoy your Golden Milk warm!\n\nThis recipe is not only delicious but also packed with health benefits due to the turmeric and ginger. Enjoy your cooking!",
        "Ingredients": [
            "1. 1 cup of almond milk",
            "2. 1 teaspoon of Turmeric Powder from National Foods",
            "3. 1 teaspoon of honey",
            "4. 1 inch long piece of fresh ginger, peeled and sliced",
            "5. Pinch of black pepper",
            "6. Pinch of cinnamon (optional)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Garam Masala",
        "Description": "National Foods provides you with the finest and most exquisite seasonings and condiments. National Garam Masala is a blend of premium spices which gives a unique flavor and irresistible aroma to your dishes.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/garam-masala-scaled.jpg",
        "Recipe": "Here's a simple recipe for Chicken Curry using Garam Masala from National Foods as an example.\n\nIngredients:\n1. 500g boneless, skinless chicken breasts, cut into bite-sized pieces\n2. 2 tablespoons vegetable oil\n3. 1 large onion, finely chopped\n4. 2 cloves garlic, minced\n5. 1 inch piece of ginger, grated\n6. 1 green chili, finely chopped (optional, for heat)\n7. 2 tablespoons National Foods Garam Masala\n8. 1 can (400g) diced tomatoes\n9. 1 can (400g) chickpeas, drained and rinsed\n10. 1 can (400g) coconut milk\n11. Salt to taste\n12. Fresh coriander leaves for garnish\n\nInstructions:\n1. Heat the oil in a large pan over medium heat. Add the chicken pieces and cook until they are browned on all sides. Remove the chicken from the pan and set aside.\n2. In the same pan, add the onions, garlic, ginger, and green chili. Sauté until the onions are translucent.\n3. Add the Garam Masala to the pan and stir well to coat the onions. Cook for about 30 seconds.\n4. Add the diced tomatoes, chickpeas, and salt to the pan. Stir well and let it simmer for about 5 minutes.\n5. Add the browned chicken and coconut milk to the pan. Stir well and let it simmer for about 20 minutes, or until the chicken is fully cooked and the sauce has thickened.\n6. Taste and adjust the seasoning if necessary. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Chicken Curry with rice or naan bread!",
        "Ingredients": [
            "1. 500g boneless, skinless chicken breasts",
            "2. 2 tablespoons vegetable oil",
            "3. 1 large onion",
            "4. 2 cloves garlic",
            "5. 1 inch piece of ginger",
            "6. 1 green chili (optional)",
            "7. National Foods Garam Masala (2 tablespoons)",
            "8. 1 can diced tomatoes (400g)",
            "9. 1 can chickpeas (400g)",
            "10. 1 can coconut milk (400g)",
            "11. Salt to taste",
            "12. Fresh coriander leaves"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Chilli Powder",
        "Description": "National’s Chilli Powder adds the perfect amount of pungency and hotness to your dishes and gives them a burst of flavor. Made from pure and fresh spices, gives this a natural red color. The spiciness will enhance the taste of your dishes, especially Pakistani cuisines.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/red-chilli-scaled.jpg",
        "Recipe": "Here's a simple recipe for Chilli Con Carne, a popular Mexican dish:\n\nIngredients:\n1. 500g of lean minced beef\n2. 1 large onion, finely chopped\n3. 2 cloves of garlic, minced\n4. 1 can of chopped tomatoes (400g)\n5. 1 can of red kidney beans (400g), drained and rinsed\n6. 2 tablespoons of National Foods Chilli Powder\n7. 1 teaspoon of ground cumin\n8. 1 teaspoon of salt\n9. 1 tablespoon of vegetable oil\n10. 1 cup of water\n11. Optional: 1 tablespoon of tomato paste, 1 bell pepper, diced, 1 can of corn (400g), drained\n\nInstructions:\n1. Heat the oil in a large pan over medium heat. Add the minced beef and cook until browned. Remove the beef from the pan and set aside.\n2. In the same pan, add the onion and garlic. Cook until the onion is softened.\n3. Add the National Foods Chilli Powder, cumin, and salt to the pan. Stir well to coat the onion and garlic.\n4. Return the cooked beef to the pan. Add the can of chopped tomatoes, kidney beans, water, and optional tomato paste. If you're using bell pepper and corn, add them now.\n5. Stir well, bring the mixture to a boil, then reduce heat to low. Let it simmer for at least 20 minutes, or until the flavors have melded together.\n6. Taste and adjust the seasoning if necessary. Serve the Chilli Con Carne hot, over rice or with tortilla chips.\n\nEnjoy your meal! Remember, you can always adjust the amount of chilli powder to suit your taste.",
        "Ingredients": [
            "1. 500g of lean minced beef",
            "2. 1 large onion",
            "3. 2 cloves of garlic",
            "4. 1 can of chopped tomatoes (400g)",
            "5. 1 can of red kidney beans (400g), drained and rinsed",
            "6. 2 tablespoons of National Foods Chilli Powder",
            "7. 1 teaspoon of ground cumin",
            "8. 1 teaspoon of salt",
            "9. 1 tablespoon of vegetable oil",
            "10. 1 cup of water",
            "11. Optional: 1 tablespoon of tomato paste, 1 bell pepper, diced, 1 can of corn (400g), drained."
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Ginger Powder",
        "Description": "Give your dishes a burst of flavor and an enticing aroma. National Ginger Powder is made from premium quality natural ginger; without any artificial colors and flavors. Our fine textured Ginger Powder is a healthy choice to add in your food due to its antioxidant and anti-inflammatory properties.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/ginger-scaled.jpg",
        "Recipe": "Here's a simple and delicious recipe for Ginger Tea using National Foods Ginger Powder.\n\nIngredients:\n1. 1 teaspoon of National Foods Ginger Powder\n2. 1 cup of water\n3. 1 tablespoon of honey (optional, for sweetness)\n4. Lemon slice (optional, for flavor)\n\nInstructions:\n1. Boil 1 cup of water in a saucepan.\n2. Once the water is boiling, reduce the heat to low and add 1 teaspoon of National Foods Ginger Powder. Stir well to dissolve the ginger powder.\n3. Let the mixture simmer for about 5 minutes.\n4. If you prefer a sweeter taste, you can add 1 tablespoon of honey at this stage and stir until it's fully dissolved.\n5. Strain the ginger tea into a cup to remove any solids.\n6. Squeeze the juice of half a lemon into the cup for an extra flavor boost (this is optional).\n7. Your Ginger Tea is now ready to enjoy!\n\nEnjoy your homemade Ginger Tea! It's not only delicious but also has numerous health benefits due to the anti-inflammatory and antioxidant properties of ginger.",
        "Ingredients": [
            "1. National Foods Ginger Powder",
            "2. 1 cup of water",
            "3. Honey (optional)",
            "4. Lemon slice (optional)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Coriander Powder",
        "Description": "Pure and freshly ground, National Coriander Powder is a fragrant, antioxidant-rich herb that adds a mild flavour and a pleasing aroma to savoury foods.\nNational ensures that you get the purest spices by only selecting the finest raw materials and carefully packaging them under strict hygienic conditions, ensuring quality at every step of the process following international and GMP standards.\nNational Coriander Powder comes packaged in a bag and sealed in a box.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/coriander-scaled.jpg",
        "Recipe": "A simple and delicious recipe using Coriander Powder from National Foods is Chicken Tikka Masala. Here's a basic recipe for you:\n\nIngredients:\n1. 500g boneless, skinless chicken breasts, cut into bite-sized pieces\n2. 3 tablespoons natural yogurt\n3. 2 tablespoons lemon juice\n4. 2 tablespoons Coriander Powder from National Foods\n5. 1 teaspoon Cumin Powder\n6. 1 teaspoon Paprika\n7. 1 teaspoon Garam Masala\n8. 1 teaspoon Salt\n9. 2 tablespoons vegetable oil\n10. 1 large onion, finely chopped\n11. 3 cloves garlic, minced\n12. 1-inch piece of ginger, grated\n13. 1 can (400g) chopped tomatoes\n14. 1 can (200g) chopped tomato puree\n15. 1 tablespoon Tomato Paste\n16. 2 green chilies, finely chopped\n17. 1 tablespoon sugar\n18. 1 teaspoon Tumeric Powder\n19. 1 teaspoon Red Chili Powder\n20. 200ml single cream\n21. Fresh coriander leaves for garnish\n22. Naan bread or basmati rice to serve\n\nInstructions:\n1. In a bowl, mix the chicken with yogurt, lemon juice, Coriander Powder, Cumin Powder, Paprika, Garam Masala, and salt. Marinate for at least 30 minutes, or up to 24 hours in the fridge.\n2. Preheat your oven to 200°C (180°C fan) or gas mark 6. Thread the marinated chicken pieces onto skewers and grill for 10-12 minutes, turning occasionally, until cooked through. Alternatively, you can cook the chicken in a non-stick frying pan over medium heat until browned and cooked through. Set aside.\n3. Heat the oil in a large pan over medium heat. Add the onion, garlic, and ginger, and cook until softened.\n4. Add the chopped tomatoes, tomato puree, tomato paste, green chilies, sugar, Tumeric Powder, and Red Chili Powder to the pan. Stir well and bring to a boil. Reduce heat and simmer for 10 minutes, until the sauce has thickened.\n5. Add the cooked chicken to the pan and stir well to coat with the sauce. Cook for a few minutes to heat through.\n6. Stir in the single cream and season with salt if needed. Simmer for a few more minutes.\n7. Garnish with fresh coriander leaves and serve with naan bread or basmati rice.\n\nEnjoy your Chicken Tikka Masala! Remember, you can adjust the spices to your taste. Enjoy cooking!",
        "Ingredients": [
            "1. 500g boneless, skinless chicken breasts",
            "2. 3 tablespoons natural yogurt",
            "3. 2 tablespoons lemon juice",
            "4. 2 tablespoons Coriander Powder from National Foods",
            "5. 1 teaspoon Cumin Powder",
            "6. 1 teaspoon Paprika",
            "7. 1 teaspoon Garam Masala",
            "8. 1 teaspoon Salt",
            "9. 2 tablespoons vegetable oil",
            "10. 1 large onion",
            "11. 3 cloves garlic",
            "12. 1-inch piece of ginger",
            "13. 1 can (400g) chopped tomatoes",
            "14. 1 can (200g) chopped tomato puree",
            "15. 1 tablespoon Tomato Paste",
            "16. 2 green chilies",
            "17. 1 tablespoon sugar",
            "18. 1 teaspoon Tumeric Powder",
            "19. 1 teaspoon Red Chili Powder",
            "20. 200ml single cream",
            "21. Fresh coriander leaves",
            "22. Naan bread or basmati rice"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Cumin Seeds",
        "Description": "National Foods provides you with the finest and most exquisite seasonings and condiments. National’s Cumin Seeds are loaded with antioxidants and nutrients that are beneficial for your health. Make your dishes more flavorsome and aromatic with the help of our Cumin Seeds.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/cumin-scaled.jpg",
        "Recipe": "Here's a simple and delicious recipe for Cumin Seed Roasted Chickpeas. This recipe uses Cumin Seeds from National Foods.\n\nIngredients:\n1. 2 cans (15 oz each) of chickpeas, drained and rinsed\n2. 2 tablespoons of Cumin Seeds from National Foods\n3. 2 tablespoons of Olive Oil\n4. 1 teaspoon of Salt\n5. 1/2 teaspoon of Black Pepper\n\nInstructions:\n1. Preheat your oven to 400 degrees Fahrenheit (204 degrees Celsius).\n2. Line a baking sheet with parchment paper.\n3. In a bowl, combine drained and rinsed chickpeas, cumin seeds, olive oil, salt, and black pepper. Make sure the chickpeas are well coated with the spices and oil.\n4. Spread the chickpeas evenly on the baking sheet.\n5. Roast in the preheated oven for about 40-45 minutes, stirring every 15 minutes to ensure they don't burn.\n6. Once they're golden-brown, remove from the oven and let them cool.\n7. Enjoy your roasted chickpeas as a snack or use them as a topping for salads or rice bowls.",
        "Ingredients": [
            "1. 2 cans (15 oz each) of chickpeas",
            "2. 2 tablespoons of Cumin Seeds",
            "3. 2 tablespoons of Olive Oil",
            "4. 1 teaspoon of Salt",
            "5. 1/2 teaspoon of Black Pepper"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Kasuri Methi",
        "Description": "This multi-purpose herb provides a fragrant aroma and rich flavor by transforming your meals by adding a sweetness and depth of flavour to any dish. Typically, Kasuri Methi pairs well with potatoes and is used to make “Aloo Methi”. It is also used in doughs for Parathas and Naan and is sprinkled over curries with meat.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/kasuri-methi-scaled.jpg",
        "Recipe": "Here's a simple and delicious recipe for a dish called \"Kasuri Methi Paneer\" (Kasuri Methi with cottage cheese).\n\nIngredients:\n1. 200 grams of Paneer (cottage cheese)\n2. 3 tablespoons of Kasuri Methi (National Foods)\n3. 2 medium-sized onions, finely chopped\n4. 2 medium-sized tomatoes, finely chopped\n5. 2 green chilies, finely chopped\n6. 1 teaspoon of cumin seeds\n7. 1 teaspoon of turmeric powder\n8. 1 tablespoon of coriander powder\n9. 1 teaspoon of red chili powder (adjust according to your spice tolerance)\n10. 1 tablespoon of oil\n11. Salt to taste\n12. 2 tablespoons of chopped coriander leaves for garnish\n\nInstructions:\n1. Crumble the paneer into small pieces and set aside.\n2. Heat oil in a pan over medium heat. Add the cumin seeds and let them sizzle for a few seconds.\n3. Add the chopped onions to the pan and sauté until they turn soft and golden brown.\n4. Add the chopped green chilies and tomatoes to the pan. Sauté until the tomatoes are soft and the mixture is well combined.\n5. Add the turmeric powder, coriander powder, and red chili powder to the pan. Stir well to ensure the spices are evenly distributed.\n6. Add the crumbled paneer to the pan and mix well. Cook for a few minutes until the paneer is well coated with the spice mixture.\n7. Add the crushed Kasuri Methi to the pan and stir well. Cook for another minute or two, ensuring that the Kasuri Methi is well mixed into the dish.\n8. Season with salt to taste.\n9. Garnish with chopped coriander leaves before serving.\n\nEnjoy your Kasuri Methi Paneer! This dish is often served with roti (Indian flatbread) or rice.",
        "Ingredients": [
            "1. Paneer (cottage cheese) - 200 grams",
            "2. Kasuri Methi (National Foods) - 3 tablespoons",
            "3. Onions - 2 medium-sized, finely chopped",
            "4. Tomatoes - 2 medium-sized, finely chopped",
            "5. Green chilies - 2, finely chopped",
            "6. Cumin seeds - 1 teaspoon",
            "7. Turmeric powder - 1 teaspoon",
            "8. Coriander powder - 1 tablespoon",
            "9. Red chili powder - 1 teaspoon (adjust according to spice tolerance)",
            "10. Oil - 1 tablespoon",
            "11. Salt - to taste",
            "12. Chopped coriander leaves - 2 tablespoons (for garnish)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Black Pepper Powder",
        "Description": "National Foods Limited is the pioneer of branded spices in clean packaged form in Pakistan. We ensure that you get the purest spices by selecting only the finest raw materials and maintaining strict quality control at our state-of-the art manufacturing facilities. National Black Pepper gives the perfect hot flavor to your dishes.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/black-papper-scaled.jpg",
        "Recipe": "A simple and delicious recipe using National Foods Black Pepper Powder is Black Pepper Chicken. Here's the recipe:\n\nIngredients:\n1. 500 grams of boneless chicken breasts, cut into bite-sized pieces\n2. 3 tablespoons of National Foods Vegetable Oil\n3. 3 cloves of garlic, minced\n4. 1 medium-sized onion, finely chopped\n5. 2 tablespoons of National Foods Black Pepper Powder\n6. 1 tablespoon of soy sauce\n7. 1 tablespoon of honey\n8. 1 tablespoon of cornstarch mixed with 2 tablespoons of water (for thickening)\n9. Salt to taste\n10. 2 green chilies (optional)\n11. Fresh coriander leaves for garnish\n\nInstructions:\n1. Heat 2 tablespoons of vegetable oil in a large skillet or wok over medium heat.\n2. Add the chicken pieces and cook until they are browned and fully cooked. Remove the chicken from the skillet and set aside.\n3. In the same skillet, add another tablespoon of vegetable oil. Add the minced garlic and chopped onion, and sauté until they are soft and fragrant.\n4. Add the National Foods Black Pepper Powder, soy sauce, and honey to the skillet. Stir well to combine.\n5. Return the cooked chicken to the skillet and stir to coat it with the pepper sauce.\n6. Add the cornstarch slurry to the skillet and stir until the sauce thickens.\n7. Season with salt to taste. If you like your food spicy, you can add sliced green chilies at this stage.\n8. Cook for another 2-3 minutes to let the flavors meld together.\n9. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Black Pepper Chicken! It pairs well with rice or noodles.",
        "Ingredients": [
            "1. 500 grams of boneless chicken breasts",
            "2. 3 tablespoons of National Foods Vegetable Oil",
            "3. 3 cloves of garlic",
            "4. 1 medium-sized onion",
            "5. 2 tablespoons of National Foods Black Pepper Powder",
            "6. 1 tablespoon of soy sauce",
            "7. 1 tablespoon of honey",
            "8. 1 tablespoon of cornstarch",
            "9. 2 tablespoons of water",
            "10. Salt to taste",
            "11. 2 green chilies (optional)",
            "12. Fresh coriander leaves"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Garlic Powder",
        "Description": "National Garlic Powder is a great addition to make your dishes exceedingly appetizing and aromatic. Our fine textured Garlic Powder is the perfect choice to add to your cooking because it enhances the overall flavour of your dish.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Ingredients-Garlic-Powder.jpg",
        "Recipe": "A simple and delicious recipe using Garlic Powder from National Foods is Garlic Bread. Here's a simple recipe for you:\n\nGarlic Bread Recipe:\n\nIngredients:\n1. 1 loaf of Italian bread\n2. 1/2 cup of unsalted butter, softened\n3. 2 teaspoons of Garlic Powder from National Foods\n4. 2 teaspoons of dried parsley\n5. 1/2 teaspoon of salt (optional, depending on your taste)\n6. 2 cloves of garlic (optional, for extra garlic flavor)\n\nSteps:\n1. Preheat your oven to 375°F (190°C).\n2. In a microwave-safe bowl, combine the softened butter, Garlic Powder, dried parsley, and salt. If you prefer a stronger garlic flavor, you can also mince and add 2 cloves of garlic to this mixture.\n3. Microwave the butter mixture for about 30 seconds until the butter is melted. Stir until the ingredients are well combined.\n4. Cut the loaf of bread into slices, but not all the way through. You want the slices to be connected at the bottom.\n5. Brush the garlic butter mixture generously between the slices of bread.\n6. Wrap the bread in aluminum foil.\n7. Bake in the preheated oven for 10-15 minutes, or until the bread is toasted and the garlic butter is melted and fragrant.\n8. Remove from the oven and let it cool for a few minutes before serving.\n\nEnjoy your homemade Garlic Bread!",
        "Ingredients": [
            "1. 1 loaf of Italian bread",
            "2. 1/2 cup of unsalted butter, softened",
            "3. 2 teaspoons of Garlic Powder from National Foods",
            "4. 2 teaspoons of dried parsley",
            "5. 1/2 teaspoon of salt (optional)",
            "6. 2 cloves of garlic (optional)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Refined Salt",
        "Description": "National iodized Refined salt is a specially refined; brilliant white food grade salt with free flow properties. Enjoy great tasting and healthy food prepared with National iodized Refined Salt.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/salt-mocup-green.jpg",
        "Recipe": "Here's a simple recipe for homemade seasoned fries using Refined Salt:\n\nIngredients:\n1. 4 large potatoes, washed and cut into fry shapes\n2. 2-3 tablespoons of vegetable oil\n3. 1 tablespoon of National Foods Refined Salt\n4. 1 teaspoon of paprika\n5. 1 teaspoon of garlic powder\n6. 1/2 teaspoon of onion powder\n\nInstructions:\n1. Preheat your oven to 220 degrees Celsius (428 degrees Fahrenheit).\n2. In a large bowl, toss the potato fries with the vegetable oil until they're all evenly coated.\n3. In a separate bowl, mix together the National Foods Refined Salt, paprika, garlic powder, and onion powder.\n4. Sprinkle the seasoning mix over the fries and toss until they're evenly coated.\n5. Spread the seasoned fries out on a baking sheet in a single layer.\n6. Bake in the preheated oven for 20-25 minutes, or until they're golden brown and crispy. Make sure to turn the fries halfway through to ensure they cook evenly.\n7. Remove from the oven and let them cool for a minute or two before serving. Enjoy your homemade seasoned fries!",
        "Ingredients": [
            "1. 4 large potatoes",
            "2. Vegetable oil",
            "3. National Foods Refined Salt (quantity not specified, assume 1 tablespoon is used in step 4)",
            "4. Paprika",
            "5. Garlic powder",
            "6. Onion powder"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Iodized Refined Salt",
        "Description": "National iodized Salt is a specially refined; brilliant white food grade salt. It includes essential iodine which helps in the proper mental development of children and prevents iodine deficiency in adults.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/salt-mocup-blue.jpg",
        "Recipe": "Here's a simple recipe for homemade bread that uses iodized refined salt:\n\n**Recipe: Homemade Bread**\n\nIngredients:\n1. 5 cups bread flour\n2. 2 1/2 teaspoons iodized refined salt\n3. 2 tablespoons sugar\n4. 2 1/4 teaspoons active dry yeast\n5. 2 cups warm water (110°F to 115°F)\n6. 2 tablespoons vegetable oil\n\nInstructions:\n1. In a large bowl, combine 4 cups of flour, salt, sugar, and yeast. Make a well in the center.\n2. Add warm water and vegetable oil to the well. Gradually mix the dry ingredients into the liquid until a soft dough forms. If the dough is too sticky, add more flour, 1 tablespoon at a time.\n3. Turn the dough out onto a floured surface and knead until smooth and elastic, about 5 to 7 minutes.\n4. Place the dough in a greased bowl, cover with a clean kitchen towel, and let it rise in a warm place until doubled in size, about 1 to 1 1/2 hours.\n5. Punch down the dough and turn it out onto a floured surface. Shape into a loaf and place in a greased 9x5-inch loaf pan.\n6. Cover with a clean kitchen towel and let it rise again until nearly doubled in size, about 30 to 45 minutes.\n7. Preheat your oven to 375°F (190°C) with a rack in the lower third.\n8. Bake the bread for 30 to 35 minutes, or until golden brown and the loaf sounds hollow when tapped on the bottom. Remove from the pan and let cool on a wire rack.\n\nEnjoy your homemade bread! Remember to use the iodized refined salt as specified in the recipe for optimal nutritional benefits.",
        "Ingredients": [
            "1. 5 cups bread flour",
            "2. 2 1/2 teaspoons iodized refined salt",
            "3. 2 tablespoons sugar",
            "4. 2 1/4 teaspoons active dry yeast",
            "5. 2 cups warm water (110°F to 115°F)",
            "6. 2 tablespoons vegetable oil"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Iodized Pink Himalayan Salt",
        "Description": "National Iodized Salt is a specially refined; food grade salt. It includes essential Iodine which helps in the proper mental development of children and prevents Iodine deficiency in adults.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/salt-mocup-Pink.jpg",
        "Recipe": "A simple recipe you can make using Iodized Pink Himalayan Salt is a simple Grilled Chicken Breast. Here's a simple recipe:\n\nIngredients:\n1. 4 boneless, skinless chicken breasts\n2. 2 tablespoons of olive oil\n3. 1 teaspoon of Iodized Pink Himalayan Salt\n4. 1 teaspoon of black pepper\n5. 1 teaspoon of garlic powder\n6. 1 teaspoon of paprika\n7. 1 lemon, cut into wedges\n\nInstructions:\n1. Preheat your grill to medium-high heat.\n2. In a bowl, mix together the Iodized Pink Himalayan Salt, black pepper, garlic powder, and paprika.\n3. Brush the chicken breasts with olive oil on both sides.\n4. Coat the chicken breasts evenly with the salt and spice mixture on both sides.\n5. Place the chicken breasts on the grill and cook for 6-7 minutes on each side, or until the internal temperature reaches 165°F (74°C).\n6. Serve the grilled chicken breasts with lemon wedges.\n\nEnjoy your meal! Remember, the salt is there to enhance the flavor, so use it sparingly, especially if you're sensitive to salt.",
        "Ingredients": [
            "1. 4 boneless, skinless chicken breasts",
            "2. 2 tablespoons of olive oil",
            "3. 1 teaspoon of Iodized Pink Himalayan Salt",
            "4. 1 teaspoon of black pepper",
            "5. 1 teaspoon of garlic powder",
            "6. 1 teaspoon of paprika",
            "7. 1 lemon"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Tomato Ketchup",
        "Description": "National tomato ketchup is prepared using the finest tomatoes that give it, its signature thick and delicious taste! The perfect accompaniment for all your snacks and meals, National ketchup is made from premium ingredients without any artificial colours or flavourings. All our products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/ketchup-1-scaled.jpg",
        "Recipe": "Here's a simple recipe for Tomato Ketchup Chicken Wings using the National Foods Tomato Ketchup.\n\nIngredients:\n1. 1 kg chicken wings\n2. 1 cup National Foods Tomato Ketchup\n3. 2 tablespoons soy sauce\n4. 2 tablespoons vinegar\n5. 1 tablespoon honey\n6. 1 tablespoon minced garlic\n7. 1 tablespoon chopped onion\n8. 1 teaspoon ground black pepper\n9. Salt to taste\n\nInstructions:\n1. Preheat your oven to 200 degrees Celsius (392 degrees Fahrenheit).\n2. In a bowl, mix together the tomato ketchup, soy sauce, vinegar, honey, minced garlic, chopped onion, and ground black pepper. Season with salt to taste.\n3. Coat the chicken wings evenly with the sauce mixture.\n4. Place the coated chicken wings on a baking sheet lined with parchment paper.\n5. Bake in the preheated oven for about 45 minutes, turning the wings halfway through to ensure they're evenly cooked.\n6. Once done, remove from the oven and let them cool for a few minutes before serving.\n\nEnjoy your Tomato Ketchup Chicken Wings! Remember, you can always adjust the ingredients to your liking. Have fun cooking!",
        "Ingredients": [
            "1. 1 kg chicken wings",
            "2. 1 cup National Foods Tomato Ketchup",
            "3. 2 tablespoons soy sauce",
            "4. 2 tablespoons vinegar",
            "5. 1 tablespoon honey",
            "6. 1 tablespoon minced garlic",
            "7. 1 tablespoon chopped onion",
            "8. 1 teaspoon ground black pepper",
            "9. Salt (to taste)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Tomato Ketchup",
        "Description": "National tomato ketchup is prepared using the finest tomatoes that give it, its signature thick and delicious taste! The perfect accompaniment for all your snacks and meals, National ketchup is made from premium ingredients without any artificial colours or flavourings. All our products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Tomato-Ketchup-250G-scaled.jpg",
        "Recipe": "Here's a simple recipe for a classic dish using Tomato Ketchup:\n\nRecipe: Tomato Ketchup Chicken Wings\n\nIngredients:\n1. 1 kg Chicken Wings\n2. Salt to taste\n3. Black Pepper to taste\n4. 1 cup All-purpose Flour\n5. 2 cups Vegetable Oil for frying\n6. 1 cup Tomato Ketchup\n7. 2 tbsp Honey\n8. 2 tbsp Vinegar\n9. 1 tbsp Worcestershire Sauce\n10. 2 cloves Garlic, minced\n11. 1 tbsp Chili Sauce (optional, for extra heat)\n\nInstructions:\n1. Wash and dry the chicken wings. Season them with salt and black pepper.\n2. Coat the chicken wings in flour, shaking off any excess.\n3. Heat the vegetable oil in a deep frying pan or wok over medium-high heat. Fry the chicken wings until they are golden brown and crispy. Remove the fried wings from the oil and drain on a paper towel-lined plate.\n4. In a saucepan, combine the Tomato Ketchup, honey, vinegar, Worcestershire sauce, minced garlic, and chili sauce (if using). Stir to mix well.\n5. Bring the sauce to a boil over medium heat, then reduce the heat and let it simmer for a few minutes, until it thickens.\n6. Toss the fried chicken wings in the Tomato Ketchup sauce until they are well coated.\n7. Serve the Tomato Ketchup Chicken Wings hot, with additional sauce on the side if desired. Enjoy!",
        "Ingredients": [
            "1. 1 kg Chicken Wings",
            "2. Salt",
            "3. Black Pepper",
            "4. 1 cup All-purpose Flour",
            "5. 2 cups Vegetable Oil",
            "6. 1 cup Tomato Ketchup",
            "7. 2 tbsp Honey",
            "8. 2 tbsp Vinegar",
            "9. 1 tbsp Worcestershire Sauce",
            "10. 2 cloves Garlic",
            "11. 1 tbsp Chili Sauce (optional)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Chilli Garlic Sauce",
        "Description": "Savor the tantalizing combination of juicy red tomatoes; mingled with the taste of hot chilies and garlic. The perfect way to top off any meal specially BBQ, broast, samosas and rolls. Made with real garlic chunks, National Chilli Garlic Sauce is bound to entice your tastebuds with its perfectly delicious taste!",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/chilli-garlic-sauce-scaled.jpg",
        "Recipe": "Here's a simple yet delicious recipe for Chilli Garlic Pasta using National Foods Chilli Garlic Sauce.\n\nIngredients:\n1. 250g Spaghetti or any pasta of your choice\n2. 3 tablespoons of National Foods Chilli Garlic Sauce\n3. 2 tablespoons of olive oil\n4. 2 cloves of garlic, minced\n5. 1 small onion, finely chopped\n6. 1 bell pepper (any color), sliced\n7. 1 can (400g) of chopped tomatoes\n8. Salt to taste\n9. 1 tablespoon of sugar\n10. 1 cup of water\n11. 100g of feta cheese, crumbled\n12. Fresh basil leaves for garnish\n\nInstructions:\n1. Cook the pasta according to the package instructions until al dente. Drain and set aside.\n2. Heat olive oil in a large pan over medium heat. Add minced garlic and chopped onion, sauté until softened.\n3. Add sliced bell pepper and sauté for another 2-3 minutes.\n4. Stir in the National Foods Chilli Garlic Sauce and canned chopped tomatoes. Add salt and sugar to taste.\n5. Pour in 1 cup of water and let it simmer for about 10 minutes, or until the sauce thickens.\n6. Add the cooked pasta to the pan and stir well to coat it evenly with the sauce.\n7. Remove from heat and stir in the crumbled feta cheese.\n8. Garnish with fresh basil leaves before serving.\n\nEnjoy your Chilli Garlic Pasta! Remember, you can always adjust the ingredients to your liking. If you prefer it spicier, you can add more chilli garlic sauce or even a bit of chili flakes. Enjoy your cooking!",
        "Ingredients": [
            "1. 250g Spaghetti or any pasta of your choice",
            "2. 3 tablespoons of National Foods Chilli Garlic Sauce",
            "3. 2 tablespoons of olive oil",
            "4. 2 cloves of garlic, minced",
            "5. 1 small onion, finely chopped",
            "6. 1 bell pepper (any color), sliced",
            "7. 1 can (400g) of chopped tomatoes",
            "8. Salt to taste",
            "9. 1 tablespoon of sugar",
            "10. 1 cup of water",
            "11. 100g of feta cheese, crumbled",
            "12. Fresh basil leaves for garnish"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Mixed Pickle",
        "Description": "National Mixed Pickle is prepared with high quality ingredients including flavorsome oils, freshly picked succulent mixed vegetables and the perfect balance of spices to give it a delicious spicy and tangy flavor. It contains the perfect mix of vegetables including chatkharaydaar keri, green chillies, carrots and more, tossed in a delicious blend of aromatic spices. This is a favourite of all Pickle lovers, and is enjoyed thouroughly with traditional desi dishes.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/mixed-pickle-jar.png",
        "Recipe": "Here's a simple recipe for a Mixed Pickle Chaat. This recipe uses Mixed Pickle from National Foods as one of its main ingredients.\n\nIngredients:\n1. 1 cup Mixed Pickle from National Foods (preferably the one with a mix of vegetables and fruits)\n2. 1 cup boiled and peeled chickpeas (chana)\n3. 1 cup puffed rice (muri)\n4. 1 medium-sized onion, finely chopped\n5. 1 green chili, finely chopped (optional, for spice)\n6. 1 tbsp chopped coriander leaves (cilantro)\n7. 1 tbsp chopped mint leaves\n8. 1 tbsp chopped peanuts\n9. 1 tbsp roasted gram (chana dal)\n10. Juice of 1 lime\n11. Salt to taste\n\nInstructions:\n1. In a large bowl, mix the Mixed Pickle from National Foods, boiled chickpeas, and puffed rice.\n2. Add the chopped onion, green chili (if using), coriander leaves, mint leaves, peanuts, and roasted gram.\n3. Sprinkle salt to taste and squeeze the juice of 1 lime over the mixture.\n4. Mix well to ensure all the ingredients are evenly coated with the pickle juice and lime juice.\n5. Your Mixed Pickle Chaat is ready to be served. You can enjoy it as it is or with some chopped cucumber or tomato on top for an added crunch.",
        "Ingredients": [
            "1. Mixed Pickle from National Foods (preferably the one with a mix of vegetables and fruits)",
            "2. Boiled and peeled chickpeas (chana)",
            "3. Puffed rice (muri)",
            "4. Medium-sized onion",
            "5. Green chili",
            "6. Chopped coriander leaves (cilantro)",
            "7. Chopped mint leaves",
            "8. Chopped peanuts",
            "9. Roasted gram (chana dal)",
            "10. Lime",
            "11. Salt"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Mango Pickle",
        "Description": "National Mango Pickle contains the goodness of tangy chatkharaydaar keri, tossed in the perfect blend of aromatic spices including red chillies, turmeric, aniseed, fenugreek seed and other savory ingredients. This is a favourite of all Pickle lovers, and is enjoyed thouroughly with traditional desi dishes.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/mango-pickle-jar.png",
        "Recipe": "Here's a simple recipe for a Mango Pickle Chicken Curry:\n\nIngredients:\n1. 500g Chicken Breast, cut into chunks\n2. 200g Mango Pickle from National Foods\n3. 2 medium-sized onions, finely chopped\n4. 2-3 garlic cloves, minced\n5. 1 inch ginger, grated\n6. 2 green chilies, finely chopped\n7. 1 tsp coriander powder\n8. 1 tsp cumin powder\n9. 1 tsp turmeric powder\n10. 1 tsp red chili powder\n11. 2 tbsp vegetable oil\n12. Salt to taste\n13. Fresh coriander leaves for garnish\n\nInstructions:\n1. Heat oil in a pan over medium heat. Add the chopped onions, garlic, ginger, and green chilies. Sauté until the onions turn golden brown.\n2. Add the chicken pieces to the pan and stir fry until they are slightly browned.\n3. Add the coriander powder, cumin powder, turmeric powder, and red chili powder. Stir well to coat the chicken evenly.\n4. Now, add the Mango Pickle from National Foods. Mix well to ensure the chicken is evenly coated with the pickle.\n5. Add salt to taste. If you find the pickle too salty, you can add a little water.\n6. Let the chicken cook on medium heat for about 10-15 minutes, or until it's fully cooked. Stir occasionally to prevent the chicken from sticking to the pan.\n7. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Mango Pickle Chicken Curry! Remember, you can adjust the ingredients to suit your taste.",
        "Ingredients": [
            "1. 500g Chicken Breast, cut into chunks",
            "2. 200g Mango Pickle from National Foods",
            "3. 2 medium-sized onions, finely chopped",
            "4. 2-3 garlic cloves, minced",
            "5. 1 inch ginger, grated",
            "6. 2 green chilies, finely chopped",
            "7. 1 tsp coriander powder",
            "8. 1 tsp cumin powder",
            "9. 1 tsp turmeric powder",
            "10. 1 tsp red chili powder",
            "11. 2 tbsp vegetable oil",
            "12. Salt to taste",
            "13. Fresh coriander leaves for garnish"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Crushed Pickle",
        "Description": "National Crushed Pickles offers a perfectly balanced taste of crushed mixed vegetables in every bite, making it the perfect meal companion. Its unique crushed format makes it easy to eat and allows you to pair it up with anything and everything. Whether used as a condiment, stuffing, topping, ingredient for cooking or even as a spread over paratha, National Crushed Pickle will add just the right excitement to your meal! It is packed in a convenient jar with foil seal which helps keep the freshness intact.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Crushed-Pickles-Bottle.jpg",
        "Recipe": "Here's a simple recipe for a Crushed Pickle and Cream Cheese Spread that you can make using Crushed Pickle from National Foods.\n\nIngredients:\n1. 1 cup (225g) of National Foods Crushed Pickle\n2. 8 oz (226g) of cream cheese, softened\n3. 1/4 cup (59ml) of mayonnaise\n4. 1 tablespoon (14g) of white sugar\n5. 1/2 teaspoon of mustard powder\n6. Salt and pepper to taste\n\nInstructions:\n1. In a large bowl, mix together the softened cream cheese, mayonnaise, sugar, mustard powder, salt, and pepper until smooth.\n2. Stir in the crushed pickle until well combined.\n3. Taste and adjust seasonings if necessary.\n4. Refrigerate for at least 1 hour before serving to allow the flavors to meld together.\n\nThis spread is great for sandwiches, wraps, or as a dip with veggies or crackers. Enjoy!",
        "Ingredients": [
            "1. National Foods Crushed Pickle (1 cup or 225g)",
            "2. Cream cheese (8 oz or 226g, softened)",
            "3. Mayonnaise (1/4 cup or 59ml)",
            "4. White sugar (1 tablespoon or 14g)",
            "5. Mustard powder (1/2 teaspoon)",
            "6. Salt (to taste)",
            "7. Pepper (to taste)"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Hyderabadi Mixed Pickle",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/04/Hyderabadi-Mix-Pickle-Jar-1KG.jpg",
        "Recipe": "Here's a simple recipe for a Hyderabadi Chana Dal that pairs well with the pickle:\n\nIngredients:\n1. 1 cup Chana Dal (split Bengal gram)\n2. 4 cups water\n3. 2 tablespoons ghee (clarified butter)\n4. 1 teaspoon cumin seeds\n5. 1 large onion, finely chopped\n6. 2 green chilies, slit\n7. 1 teaspoon turmeric powder\n8. Salt to taste\n9. 1 cup Hyderabadi Mixed Pickle from National Foods\n\nInstructions:\n1. Rinse the chana dal under cold water until the water runs clear. Soak the dal in enough water to cover it for at least 4 hours, or over night.\n2. Drain the soaked dal and place it in a pressure cooker. Add 4 cups of water, turmeric powder, and salt. Close the pressure cooker and cook on medium heat until 3-4 whistles are released. Turn off the heat and let the pressure release naturally.\n3. Heat ghee in a pan over medium heat. Add cumin seeds and let them sizzle for a few seconds. Add the chopped onions and green chilies, and sauté until the onions are golden brown.\n4. Once the dal is cooked and cooled, mash it slightly with the back of a spoon. Stir in the sautéed onions, green chilies, and ghee. Mix well.\n5. Finally, add the Hyderabadi Mixed Pickle from National Foods and mix it gently into the dal. Serve the Hyderabadi Chana Dal hot with rice or roti.\n\nEnjoy your meal! Remember, the amount of pickle you add can be adjusted based on your taste preference.",
        "Ingredients": [
            "1. Chana Dal (split Bengal gram)",
            "2. Water",
            "3. Ghee (clarified butter)",
            "4. Cumin seeds",
            "5. Large onion",
            "6. Green chilies",
            "7. Turmeric powder",
            "8. Salt",
            "9. Hyderabadi Mixed Pickle from National Foods"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Classic Mayo",
        "Description": "National Classic Mayo is made from premium quality natural ingredients and high grade procedures which makes it thick, creamy and flavorsome. Made with real eggs, National Classic Mayo offers the authentic taste of Mayonnaise along with essential nutrients such as Omega 3 &amp; 6 and Vitamin A. Our Mayo can be used as a spread for burgers, sandwiches and wraps and also as a dip for fries. National products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/classic-mayo-scaled.jpg",
        "Recipe": "Here's a simple recipe for a Classic Chicken Salad using National Foods' Classic Mayo.\n\nIngredients:\n1. 2 boneless, skinless chicken breasts (cooked and chopped)\n2. 1/2 cup of National Foods Classic Mayo\n3. 1/2 cup of diced celery\n4. 1/2 cup of diced red bell pepper\n5. 1/2 cup of diced grapes (seedless)\n6. 1/2 cup of chopped walnuts\n7. Salt and pepper to taste\n8. Lettuce leaves, sliced cucumber, and cherry tomatoes for serving\n\nInstructions:\n1. In a large bowl, combine the cooked and chopped chicken, National Foods Classic Mayo, celery, red bell pepper, grapes, and walnuts.\n2. Season with salt and pepper to taste.\n3. Mix all the ingredients until they are well combined.\n4. Serve the chicken salad on lettuce leaves, topped with sliced cucumber and cherry tomatoes.\n\nEnjoy your Classic Chicken Salad! Remember, you can always adjust the ingredients to your liking. Enjoy your cooking!",
        "Ingredients": [
            "1. 2 boneless, skinless chicken breasts",
            "2. Cooked chicken (from step 1)",
            "3. 1/2 cup National Foods Classic Mayo",
            "4. 1/2 cup diced celery",
            "5. 1/2 cup diced red bell pepper",
            "6. 1/2 cup diced seedless grapes",
            "7. 1/2 cup chopped walnuts",
            "8. Salt",
            "9. Pepper",
            "10. Lettuce leaves",
            "11. Sliced cucumber",
            "12. Cherry tomatoes"
        ]
    },
    {
        "Category": "Our Products",
        "Product": "Garlic Mayo",
        "Description": "National Garlic Mayo is a delicious blend of Garlic and Mayonnaise which will perfectly complement your snacks and meals. It is made from premium quality natural ingredients which makes it thick, creamy and flavorsome. Prepared with real eggs, National Garlic Mayo offers essential nutrients such as Omega 3 &amp; 6 and Vitamin A. National products are carefully packaged under strict hygienic conditions, ensuring quality at every step of the process.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/garlic-mayo-1-scaled.jpg",
        "Recipe": "Here's a simple Garlic Aioli recipe using Garlic Mayo from National Foods as a base. This goes well with fries, vegetables, or as a sandwich spread.\n\n**Garlic Aioli Recipe**\n\nIngredients:\n1. 1 cup Garlic Mayo from National Foods\n2. 1 clove garlic, minced\n3. 1 lemon, juiced\n4. 1 teaspoon Dijon mustard\n5. Salt and pepper to taste\n\nSteps:\n1. In a bowl, combine the Garlic Mayo, minced garlic, lemon juice, and Dijon mustard.\n2. Stir until all the ingredients are well combined.\n3. Season with salt and pepper to taste.\n4. Chill the aioli in the refrigerator for at least 30 minutes before serving to allow the flavors to meld together.\n\nEnjoy your Garlic Aioli! Remember, you can always adjust the ingredients to your liking. If you prefer a stronger garlic flavor, you can use more garlic, and if you prefer a tangier sauce, you can add more lemon juice.",
        "Ingredients": [
            "1. Garlic Mayo from National Foods",
            "2. 1 clove garlic",
            "3. 1 lemon",
            "4. 1 teaspoon Dijon mustard",
            "5. Salt",
            "6. Pepper"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Vanilla Custard",
        "Description": "National Vanilla custard powder is the perfect treat for your everyday sweet cravings with its delightful Vanilla flavor and creamy texture. National ensures you get irresistibly delicious custard in no time! Add it to tarts and trifles, donuts and pies, top with your favourite fruit, or indulge in this creamy delight all on its own.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Vanilla-Custard-3D-scaled-1.jpg",
        "Recipe": "Here's a simple recipe for Vanilla Custard Tart that you can try:\n\nIngredients:\n1. 1 packet of National Foods Vanilla Custard (approximately 400g)\n2. 1 ready-made tart shell (or you can make your own using 2 cups of flour, 1/2 cup of sugar, 125g of butter, and 1 egg)\n3. Fresh fruits (strawberries, blueberries, or any fruit of your choice) for decoration\n\nSteps:\n1. Preheat your oven to 180 degrees Celsius (356 degrees Fahrenheit). If you're making your own tart shell, mix the flour, sugar, and butter until it forms a crumbly mixture. Add the egg and mix until it forms a dough. Press this dough into a tart tin and bake for about 15-20 minutes until lightly golden.\n2. While the tart shell is baking, prepare the custard according to the instructions on the National Foods Vanilla Custard packet. Usually, this involves mixing the custard with milk or cream in a saucepan over medium heat, stirring constantly until it thickens.\n3. Once the tart shell is baked, let it cool completely. Then, pour the prepared custard into the tart shell and smooth the top.\n4. Chill the tart in the fridge for at least 2 hours, or until the custard has set.\n5. Before serving, decorate the tart with fresh fruits. Enjoy your Vanilla Custard Tart!",
        "Ingredients": [
            "1. National Foods Vanilla Custard (approximately 400g)",
            "2. 1 ready-made tart shell or (if making your own)",
            "- 2 cups of flour",
            "- 1/2 cup of sugar",
            "- 125g of butter",
            "- 1 egg",
            "3. Fresh fruits (strawberries, blueberries, or any fruit of your choice) for decoration"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Mango Custard",
        "Description": "National Mango custard powder is the perfect treat for your everyday sweet cravings with its fruity mango flavor and creamy texture. National ensures you get irresistibly delicious custard in no time! Add it to tarts and trifles, donuts and pies, top with your favourite fruit, or indulge in this creamy delight all on its own.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Mango-Custard-3D-scaled-1.jpg",
        "Recipe": "Here's a recipe for Mango Custard Parfait:\n\nIngredients:\n1. 4 servings of Mango Custard from National Foods\n2. 1 ripe mango, sliced\n3. 1 cup of whipped cream (optional)\n4. 1/2 cup of granola or crushed graham crackers (for crunch)\n\nInstructions:\n1. Open the Mango Custard packs and let them stand at room temperature for about 10-15 minutes to make them easier to spoon out.\n2. In a glass or a parfait dish, start by adding a layer of Mango Custard.\n3. Arrange some sliced mango pieces on top of the custard layer.\n4. Repeat the process with another layer of Mango Custard, mango slices, and so on, until you reach the top of the glass.\n5. If you'd like, top it off with a layer of whipped cream.\n6. Sprinkle some granola or crushed graham crackers on top for an added crunch.\n7. Chill the parfait in the refrigerator for at least 30 minutes before serving to let the layers set.\n\nEnjoy your Mango Custard Parfait! Remember, you can always adjust the ingredients to your liking. If you prefer a stronger mango flavor, you can use more mango slices. If you want it to be less sweet, you can reduce the amount of whipped cream or use unsweetened yogurt instead.",
        "Ingredients": [
            "1. 4 servings of Mango Custard from National Foods",
            "2. 1 ripe mango, sliced",
            "3. 1 cup of whipped cream (optional)",
            "4. 1/2 cup of granola or crushed graham crackers"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Strawberry Custard",
        "Description": "National Strawberry custard powder is the perfect treat for your everyday sweet cravings with its fruity strawberry flavor and creamy texture. National ensures you get irresistbly delicious custard in no time! Add it to tarts and trifles, donuts and pies, top with your favourite fruit, or indulge in this creamy delight all on its own.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/STRAWBERRY-CUSTARD-120g-scaled-1.jpg",
        "Recipe": "Here's a simple idea for a Strawberry Custard Parfait:\n\nIngredients:\n1. National Foods Strawberry Custard (as per the serving size suggested on the package)\n2. 200g of fresh strawberries, sliced\n3. 100g of granola or crushed graham crackers\n4. 200ml of whipped cream (optional)\n\nInstructions:\n1. Start by layering the ingredients in a glass or parfait dish. Begin with a layer of granola or crushed graham crackers, followed by a layer of Strawberry Custard, and then a layer of sliced strawberries. Repeat this layering process until you reach the top of the dish.\n2. If you'd like, you can top off the parfait with a dollop of whipped cream and a few extra strawberry slices for garnish.\n3. Chill the parfait in the refrigerator for at least 30 minutes before serving to let the layers set.\n\nEnjoy your Strawberry Custard Parfait! Remember, you can always adjust the ingredients to suit your taste preferences.",
        "Ingredients": [
            "1. National Foods Strawberry Custard",
            "2. 200g of fresh strawberries",
            "3. 100g of granola or crushed graham crackers",
            "4. 200ml of whipped cream (optional)"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Banana Jelly",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/Banana-Jelly-pack-scaled-1.jpg",
        "Recipe": "Title: Banana Jelly Ice Cream Sundae\n\nIngredients:\n1. 1 cup (250g) National Foods Banana Jelly\n2. 2 ripe bananas\n3. 1 cup (240ml) heavy cream\n4. 1 cup (240ml) whole milk\n5. 1/2 cup (100g) granulated sugar\n6. 1 tsp vanilla extract\n7. 1/2 cup (60g) chopped nuts (optional, like almonds or walnuts)\n8. 1/2 cup (100g) sweetened shredded coconut (optional)\n9. 1 cup (240ml) chocolate sauce (homemade or store-bought)\n10. Whipped cream for topping (homemade or store-bought)\n11. Maraschino cherries (optional)\n\nInstructions:\n1. To make the banana jelly ice cream, first, melt the banana jelly in a microwave or over low heat on the stove until smooth. Set aside to cool.\n2. In a blender, combine ripe bananas, heavy cream, whole milk, sugar, and vanilla extract. Blend until smooth.\n3. Transfer the banana mixture into a large mixing bowl. Stir in the cooled banana jelly.\n4. Churn the mixture in an ice cream maker according to the manufacturer's instructions.\n5. Once the ice cream is churned, transfer it to an airtight container. Fold in chopped nuts and shredded coconut if desired.\n6. Freeze the banana jelly ice cream for at least 2-4 hours or until it's firm.\n7. To serve, scoop the banana jelly ice cream into bowls or cones. Drizzle with chocolate sauce, add whipped cream, and top with maraschino cherries if desired. Enjoy!",
        "Ingredients": [
            "1. 1 cup (250g) National Foods Banana Jelly",
            "2. 2 ripe bananas",
            "3. 1 cup (240ml) heavy cream",
            "4. 1 cup (240ml) whole milk",
            "5. 1/2 cup (100g) granulated sugar",
            "6. 1 tsp vanilla extract",
            "7. Optional: 1/2 cup (60g) chopped nuts (like almonds or walnuts)",
            "8. Optional: 1/2 cup (100g) sweetened shredded coconut",
            "9. 1 cup (240ml) chocolate sauce (homemade or store-bought)",
            "10. Whipped cream for topping (homemade or store-bought)",
            "11. Optional: Maraschino cherries"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Mango Jelly",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Mango-Jelly-pack-scaled-1.jpg",
        "Recipe": "Here's a simple recipe for Mango Jelly Fruit Salad that you can prepare using National Foods Mango Jelly.\n\nIngredients:\n1. 200g National Foods Mango Jelly\n2. 1 large ripe mango, peeled and sliced\n3. 1 cup of pineapple chunks\n4. 1 cup of grape halves\n5. 1 cup of sliced strawberries\n6. 1 cup of coconut flakes\n7. 2 tablespoons of fresh lime juice\n\nSteps:\n1. Follow the instructions on the Mango Jelly packet to prepare the jelly. Once it's set, you can slice it into cubes.\n2. In a large bowl, combine the sliced mango, pineapple chunks, grape halves, and sliced strawberries.\n3. Add the set Mango Jelly cubes to the fruit mixture.\n4. Sprinkle the coconut flakes over the fruit and jelly.\n5. Drizzle the fresh lime juice over the salad to add a tangy flavor and prevent the fruit from browning.\n6. Mix the salad gently to ensure all the ingredients are well-combined.\n7. Serve chilled and enjoy!",
        "Ingredients": [
            "1. 200g National Foods Mango Jelly",
            "2. 1 large ripe mango, peeled and sliced",
            "3. 1 cup of pineapple chunks",
            "4. 1 cup of grape halves",
            "5. 1 cup of sliced strawberries",
            "6. 1 cup of coconut flakes",
            "7. 2 tablespoons of fresh lime juice"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Strawberry Jelly",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Strawberry-Jelly-pack-scaled-1.jpg",
        "Recipe": "Here's a simple recipe for Strawberry Jelly Toast with Cream Cheese that you can try using National Foods Strawberry Jelly:\n\nIngredients:\n1. 8 slices of your favorite bread (preferably soft bread like white or whole grain)\n2. 1 cup (250g) of National Foods Strawberry Jelly\n3. 200g of cream cheese, softened\n4. 1 tablespoon of honey (optional)\n5. Fresh strawberries for garnish (optional)\n\nInstructions:\n1. Toast the bread slices until golden brown. You can do this in a toaster or on a skillet over medium heat.\n2. While the bread is toasting, mix the softened cream cheese and honey in a bowl until well combined. If you prefer a tangier taste, you can skip the honey.\n3. Once the bread is toasted, spread a generous layer of the cream cheese mixture on one side of each slice.\n4. Warm up the strawberry jelly in a microwave-safe bowl for about 10-15 seconds, or until it becomes easier to spread.\n5. Spread a layer of the warmed strawberry jelly on top of the cream cheese on half of the bread slices.\n6. Place a jelly-side down slice on top of each cream cheese-topped slice. Press down gently.\n7. If you like, garnish with fresh strawberry slices before serving.\n\nEnjoy your Strawberry Jelly Toast with Cream Cheese!",
        "Ingredients": [
            "1. 8 slices of bread",
            "2. 1 cup of National Foods Strawberry Jelly",
            "3. 200g of cream cheese",
            "4. 1 tablespoon of honey",
            "5. Fresh strawberries"
        ]
    },
    {
        "Category": "Modern Desserts",
        "Product": "Mixed Fruit Jelly",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/mixed-fruit-Jelly-pack-scaled-1.jpg",
        "Recipe": "Here's a simple recipe for Mixed Fruit Jelly Trifle that you can make using National Foods Mixed Fruit Jelly:\n\nIngredients:\n1. National Foods Mixed Fruit Jelly (1 kg)\n2. 500 ml of boiling water\n3. 250 ml of cold water\n4. 2 cups of sliced mixed fruits (like strawberries, grapes, pineapple, and kiwi)\n5. 2 cups of plain yogurt\n6. 1 packet of vanilla pudding mix (125 g)\n7. 3 cups of milk\n8. 300 ml of whipping cream\n9. 2 tablespoons of powdered sugar\n10. 2 packets of digestive biscuits\n\nSteps:\n1. To make the jelly, empty the Mixed Fruit Jelly into a large bowl. Add the boiling water and stir until the jelly is completely dissolved. Add the cold water and stir again. Let it cool down to room temperature.\n2. Once the jelly is cool, pour it into a large trifle dish or individual serving dishes. Refrigerate for at least 2 hours or until the jelly sets.\n3. In a large bowl, mix the vanilla pudding mix with 3 cups of milk. Follow the instructions on the packet to cook and cool the pudding. Once cooled, spread a layer of the pudding over the set jelly.\n4. In another bowl, whip the whipping cream with the powdered sugar until soft peaks form. Spread a layer of whipped cream over the pudding layer.\n5. Arrange a layer of sliced mixed fruits over the whipped cream. Repeat the layers of jelly, pudding, whipped cream, and fruits until you reach the top of the dish.\n6. Finish by topping with a final layer of whipped cream and some sliced fruits. Refrigerate for at least 2 hours before serving.\n\nEnjoy your Mixed Fruit Jelly Trifle!",
        "Ingredients": [
            "1. National Foods Mixed Fruit Jelly (1 kg)",
            "2. 500 ml of boiling water",
            "3. 250 ml of cold water",
            "4. 2 cups of sliced mixed fruits (like strawberries, grapes, pineapple, and kiwi)",
            "5. 2 cups of plain yogurt",
            "6. 1 packet of vanilla pudding mix (125 g)",
            "7. 3 cups of milk",
            "8. 300 ml of whipping cream",
            "9. 2 tablespoons of powdered sugar",
            "10. 2 packets of digestive biscuits"
        ]
    },
    {
        "Category": "Traditional Desserts",
        "Product": "Feerni Mix",
        "Description": "Recreate your favorite traditional dessert with National Feerni Mix. This easy to prepare mix will give you an authentic flavor, creamy thick texture and just the right amount of sweetness, making it the perfect dessert for all your special occasions. Garnish with your favorite dry fruits and nuts.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Feerni-Mix-155g-scaled-1.jpg",
        "Recipe": "Here is a simple recipe for Feerni:\n\nIngredients:\n1. 1 packet of Feerni Mix\n2. 1 cup (240 ml) of cold water\n3. 1 cup (240 ml) of milk\n4. 1/2 cup (120 ml) of condensed milk\n\nInstructions:\n1. In a blender, combine the Feerni Mix, cold water, milk, and condensed milk.\n2. Blend until smooth.\n3. Pour the mixture into a glass and serve chilled.\n\nEnjoy your Feerni! Note that you can adjust the sweetness by using less or more condensed milk according to your preference.",
        "Ingredients": [
            "1. 1 packet of Feerni Mix",
            "2. 1 cup (240 ml) of cold water",
            "3. 1 cup (240 ml) of milk",
            "4. 1/2 cup (120 ml) of condensed milk"
        ]
    },
    {
        "Category": "Traditional Desserts",
        "Product": "Pistachio Kheer Mix",
        "Description": "Recreate your favorite traditional dessert with National Pistachio Kheer Mix. This easy to prepare mix will give you an authentic flavor, creamy texture and just the right amount of sweetness, making it the perfect dessert for all your special occasions.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Pistachio-Kheer-Mix-155g-scaled-1.jpg",
        "Recipe": "Here's a simple recipe for Pistachio Kheer Mix:\n\nIngredients:\n1. National Foods Pistachio Kheer Mix (1 packet)\n2. 5 cups of full-fat milk\n3. 1 cup of water\n4. 1/2 cup of sugar (or to taste)\n5. 1 tsp of cardamom powder\n6. 10-12 sliced almonds (for garnish)\n7. 10-12 sliced pistachios (for garnish)\n\nSteps:\n1. In a large pot, combine the pistachio kheer mix, milk, and water. Stir well to ensure the mix is fully dissolved.\n2. Place the pot on medium heat and bring the mixture to a boil. Stir occasionally to prevent the mixture from sticking to the bottom of the pot.\n3. Once the mixture starts boiling, reduce the heat to low and let it simmer. Stir occasionally for about 10-15 minutes, until the kheer thickens to your desired consistency.\n4. Add the sugar and cardamom powder, stir well, and cook for another 2-3 minutes. Taste the kheer and adjust the sugar if necessary.\n5. Remove the pot from heat and let the kheer cool down to room temperature. This will allow the flavors to meld together.\n6. Garnish the kheer with sliced almonds and pistachios before serving.\n\nEnjoy your homemade Pistachio Kheer! Remember, you can adjust the ingredients to suit your taste preferences.",
        "Ingredients": [
            "1. National Foods Pistachio Kheer Mix",
            "2. 5 cups of full-fat milk",
            "3. 1 cup of water",
            "4. 1/2 cup of sugar",
            "5. 1 tsp of cardamom powder",
            "6. 10-12 sliced almonds (for garnish)",
            "7. 10-12 sliced pistachios (for garnish)"
        ]
    },
    {
        "Category": "Traditional Desserts",
        "Product": "Kheer Mix",
        "Description": "Recreate your favorite traditional dessert with National Kheer Mix. This easy to prepare mix will give you an authentic flavor, creamy texture and just the right amount of sweetness, making it the perfect dessert for all your special occasions.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/kheer-3.png",
        "Recipe": "Here's a simple recipe using Kheer Mix:\n\n**One-Pot National Foods Kheer Recipe**\n\nIngredients:\n1. 1 packet of National Foods Kheer Mix\n2. 6 cups of full-fat milk\n3. 1/2 cup of sugar (or to taste)\n4. 1 teaspoon of cardamom powder\n5. 10-12 almonds and pistachios, sliced (optional for garnish)\n6. 2-3 strands of saffron (optional)\n\nSteps:\n1. Pour the 6 cups of full-fat milk into a large, heavy-bottomed pot.\n2. Add the National Foods Kheer Mix to the milk and stir well until it dissolves completely.\n3. If using saffron, soak it in a little warm milk for 10 minutes and then add it to the pot.\n4. Bring the mixture to a boil over medium heat, stirring occasionally to prevent burning. Once it starts boiling, reduce the heat to low.\n5. Add the sugar and cardamom powder to the pot. Stir until the sugar is completely dissolved.\n6. Cook the kheer on low heat, stirring occasionally, for about 20-25 minutes or until it thickens to your desired consistency.\n7. Remove the pot from the heat and let it cool slightly before serving.\n8. Garnish with sliced almonds and pistachios before serving.\n\nEnjoy your homemade Kheer made with National Foods Kheer Mix!",
        "Ingredients": [
            "1. National Foods Kheer Mix",
            "2. 6 cups of full-fat milk",
            "3. 1/2 cup of sugar",
            "4. 1 teaspoon of cardamom powder",
            "5. 10-12 almonds and pistachios (optional)",
            "6. 2-3 strands of saffron (optional)"
        ]
    },
    {
        "Category": "Traditional Desserts",
        "Product": "Vermicelli",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/vermicelli.png",
        "Recipe": "Here's a simple and popular recipe for Sweet Vermicelli (Seviyan):\n\nIngredients:\n1. 200g National Foods Vermicelli\n2. 2 tablespoons ghee or butter\n3. 1/2 cup sugar (adjust to taste)\n4. 2 cups milk\n5. 2 1/4 teaspoon cardamom powder\n6. 1 tablespoon almonds (sliced)\n7. 1 tablespoon pistachios (sliced)\n8. 1 tablespoon raisins (optional)\n9. A few saffron strands (optional)\n\nInstructions:\n1. Heat ghee in a pan on medium heat.\n2. Add the vermicelli and roast until golden brown, stirring constantly.\n3. In a separate pan, heat the milk and bring it to a boil.\n4. Once the vermicelli is roasted, slowly add the boiled milk and stir.\n5. Add sugar and cardamom powder to the mixture.\n6. Simmer on low heat, stirring occasionally, until the milk is absorbed and the vermicelli is soft.\n7. Garnish with almonds, pistachios, raisins, and saffron.\n8. Serve warm or chilled as desired.",
        "Ingredients": [
            "1. National Foods Vermicelli (200g)",
            "2. 2 tablespoons ghee or butter",
            "3. 1/2 cup sugar (adjust to taste)",
            "4. 2 cups milk",
            "5. 1/4 teaspoon cardamom powder",
            "6. 1 tablespoon almonds (sliced)",
            "7. 1 tablespoon pistachios (sliced)",
            "8. 1 tablespoon raisins (optional)",
            "9. A few saffron strands (optional)"
        ]
    },
    {
        "Category": "Premium Jams",
        "Product": "Chunky Apple Jam",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/chunky-apple-jam.png",
        "Recipe": "Here's a simple and delicious recipe for Apple Jam Bread using Chunky Apple Jam from National Foods.\n\nIngredients:\n1. 2 1/2 cups all-purpose flour\n2. 1 1/2 teaspoons baking powder\n3. 1 teaspoon baking soda\n4. 1/2 teaspoon salt\n5. 3/4 cup unsalted butter, softened\n6. 1 1/2 cups granulated sugar\n7. 2 large eggs\n8. 1 cup buttermilk\n9. 1 cup Chunky Apple Jam from National Foods\n10. 1 cup chopped walnuts (optional)\n\nInstructions:\n1. Preheat your oven to 350°F (175°C) and grease a 9x5-inch loaf pan.\n2. In a medium bowl, whisk together the flour, baking powder, baking soda, and salt. Set aside.\n3. In a large bowl, cream together the softened butter and sugar until light and fluffy.\n4. Beat in the eggs one at a time, then stir in the buttermilk.\n5. Gradually add the flour mixture to the butter mixture, mixing just until combined.\n6. Fold in the Chunky Apple Jam and walnuts (if using).\n7. Pour the batter into the prepared loaf pan, smoothing the top with a spatula.\n8. Bake for 60-70 minutes, or until a toothpick inserted into the center of the bread comes out clean.\n9. Allow the bread to cool in the pan for 10 minutes, then remove it from the pan and transfer it to a wire rack to cool completely.\n\nEnjoy your Apple Jam Bread! Remember, you can always customize this recipe by adding more apple jam or changing the mix-ins to suit your taste.",
        "Ingredients": [
            "1. 2 1/2 cups all-purpose flour",
            "2. 1 1/2 teaspoons baking powder",
            "3. 1 teaspoon baking soda",
            "4. 1/2 teaspoon salt",
            "5. 3/4 cup unsalted butter, softened",
            "6. 1 1/2 cups granulated sugar",
            "7. 2 large eggs",
            "8. 1 cup buttermilk",
            "9. 1 cup Chunky Apple Jam from National Foods",
            "10. 1 cup chopped walnuts (optional)"
        ]
    },
    {
        "Category": "Premium Jams",
        "Product": "Chunky Mango Jam",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/mango-chunky-jam.png",
        "Recipe": "Here's a delicious Chunky Mango Jam Tart recipe that you can make using National Foods Chunky Mango Jam:\n\nIngredients:\n\n1. 1 packet of ready-made shortcrust pastry\n2. 1 jar (340g) of National Foods Chunky Mango Jam\n3. 100g of unsalted butter, room temperature\n4. 100g of caster sugar\n5. 2 large eggs\n6. 100g of plain flour\n7. Optional: A scoop of vanilla ice cream or whipped cream for serving\n\nInstructions:\n\n1. Preheat your oven to 180°C (160°C fan) and line a 20cm tart tin with the ready-made shortcrust pastry. Prick the base with a fork, then bake for 15 minutes until lightly golden. Allow it to cool down.\n\n2. In a large mixing bowl, beat the unsalted butter and caster sugar together until light and creamy. Add the eggs one at a time, mixing well after each addition. Then, fold in the plain flour.\n\n3. Spread the Chunky Mango Jam evenly over the cooled tart base.\n\n4. Pour the batter on top of the jam, and gently spread it out to cover the jam fully.\n\n5. Bake in the preheated oven for 25-30 minutes, or until the top is golden brown and a skewer inserted into the middle comes out clean.\n\n6. Allow the tart to cool in the tin before slicing and serving. You can serve it with a scoop of vanilla ice cream or whipped cream if you like!\n\nEnjoy your Chunky Mango Jam Tart!",
        "Ingredients": [
            "1. 1 packet of ready-made shortcrust pastry",
            "2. 1 jar (340g) of National Foods Chunky Mango Jam",
            "3. 100g of unsalted butter, room temperature",
            "4. 100g of caster sugar",
            "5. 2 large eggs",
            "6. 100g of plain flour",
            "7. Optional: A scoop of vanilla ice cream or whipped cream for serving"
        ]
    },
    {
        "Category": "Premium Jams",
        "Product": "Chunky Strawberry Jam",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/strawberry-chunky-jam.png",
        "Recipe": "Here's a simple recipe for Strawberry Jam Thumbprint Cookies using the Chunky Strawberry Jam from National Foods.\n\nIngredients:\n1. 1 3/4 cups all-purpose flour\n2. 1/2 teaspoon baking powder\n3. 1/2 teaspoon salt\n4. 1 cup unsalted butter, softened\n5. 1 cup granulated sugar\n6. 1 large egg\n7. 2 teaspoons vanilla extract\n8. 1 jar (approx. 340g) National Foods Chunky Strawberry Jam\n\nInstructions:\n1. Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper.\n2. In a medium bowl, whisk together the flour, baking powder, and salt. Set aside.\n3. In a large bowl, using an electric mixer, beat the softened butter and sugar until light and fluffy, about 2-3 minutes.\n4. Beat in the egg and vanilla extract.\n5. Gradually add the dry ingredients to the wet ingredients, mixing just until combined.\n6. Scoop out rounded tablespoons of dough and roll into balls. Place the balls on the prepared baking sheet.\n7. Using your thumb or the back of a spoon, make an indentation in the center of each ball.\n8. Fill each indentation with about 1 teaspoon of the Chunky Strawberry Jam.\n9. Bake for 15-18 minutes, or until the edges are lightly golden.\n10. Allow the cookies to cool on the baking sheet for 5 minutes, then transfer to a wire rack to cool completely.\n\nEnjoy your Strawberry Jam Thumbprint Cookies!",
        "Ingredients": [
            "1. 1 3/4 cups all-purpose flour",
            "2. 1/2 teaspoon baking powder",
            "3. 1/2 teaspoon salt",
            "4. 1 cup unsalted butter, softened",
            "5. 1 cup granulated sugar",
            "6. 1 large egg",
            "7. 2 teaspoons vanilla extract",
            "8. 1 jar (approx. 340g) National Foods Chunky Strawberry Jam"
        ]
    },
    {
        "Category": "Premium Jams",
        "Product": "Chunky Mixed Fruit Jam",
        "Description": "",
        "Image URL": "https://www.nfoods.com/app/uploads/2022/05/mix-fruit-chunky-jam.png",
        "Recipe": "Title: Fruit and Nut Oatmeal Bars\n\nIngredients:\n1. 2 cups of oats\n2. 1 cup of all-purpose flour\n3. 1 cup of chopped nuts (almonds or walnuts work well)\n4. 1/2 cup of brown sugar\n5. 1/2 cup of white sugar\n6. 1/2 teaspoon of salt\n7. 1/2 teaspoon of baking soda\n8. 125g (1/2 cup) of unsalted butter, melted\n9. 1 jar (340g) of Chunky Mixed Fruit Jam from National Foods\n10. 1 egg, beaten\n\nInstructions:\n1. Preheat your oven to 180 degrees Celsius (350 degrees Fahrenheit) and line a 20x30 cm baking dish with baking paper.\n2. In a large bowl, combine the oats, flour, nuts, brown sugar, white sugar, salt, and baking soda.\n3. Stir in the melted butter until the mixture is well coated.\n4. Press half of the oat mixture into the prepared baking dish, pressing firmly to form a compact base.\n5. In a separate bowl, mix the jam and beaten egg until well combined. Spread this mixture evenly over the oat base.\n6. Sprinkle the remaining oat mixture over the jam layer, pressing gently to ensure it sticks to the jam.\n7. Bake in the preheated oven for 25-30 minutes, or until the top is golden brown.\n8. Allow the bars to cool completely in the baking dish before cutting into squares.\n\nEnjoy your Fruit and Nut Oatmeal Bars with a generous serving of Chunky Mixed Fruit Jam from National Foods!",
        "Ingredients": [
            "1. 2 cups of oats",
            "2. 1 cup of all-purpose flour",
            "3. 1 cup of chopped nuts (almonds or walnuts work well)",
            "4. 1/2 cup of brown sugar",
            "5. 1/2 cup of white sugar",
            "6. 1/2 teaspoon of salt",
            "7. 1/2 teaspoon of baking soda",
            "8. 125g (1/2 cup) of unsalted butter",
            "9. 1 jar (340g) of Chunky Mixed Fruit Jam from National Foods",
            "10. 1 egg"
        ]
    },
    {
        "Category": "Jams & Jellies",
        "Product": "Apple Jam",
        "Description": "Experience the delicious taste of National Apple jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/apple-jam.png",
        "Recipe": "Here's a simple recipe for Apple Jam Cake using National Foods Apple Jam. This recipe serves about 10-12 people.\n\nIngredients:\n1. 2 cups (250g) all-purpose flour\n2. 1 1/2 tsp baking powder\n3. 1 tsp baking soda\n4. 1 tsp ground cinnamon\n5. 1/2 tsp salt\n6. 1 cup (226g) unsalted butter, softened\n7. 1 1/2 cups (300g) granulated sugar\n8. 2 large eggs\n9. 2 tsp vanilla extract\n10. 1 1/2 cups (375g) National Foods Apple Jam\n11. 1 cup (240ml) buttermilk\n12. 1 cup (120g) chopped walnuts (optional)\n\nFor the Glaze:\n1. 1 cup (120g) powdered sugar\n2. 2-3 tbsp apple cider vinegar\n3. 1 tsp ground cinnamon\n\nInstructions:\n1. Preheat your oven to 350°F (175°C) and grease a 9-inch round cake pan.\n2. In a medium bowl, whisk together the flour, baking powder, baking soda, cinnamon, and salt. Set aside.\n3. In a large bowl, cream the softened butter and sugar together until light and fluffy.\n4. Beat in the eggs one at a time, then stir in the vanilla extract.\n5. Gradually fold in the apple jam, making sure it's well incorporated.\n6. Alternately add the dry ingredients and buttermilk to the butter mixture, beginning and ending with the dry ingredients. Fold in the chopped walnuts if using.\n7. Pour the batter into the prepared cake pan and smooth the top.\n8. Bake for 60-70 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n9. Allow the cake to cool in the pan for 10 minutes, then transfer it to a wire rack to cool completely.\n\nFor the glaze:\n1. In a small bowl, mix together the powdered sugar, apple cider vinegar, and ground cinnamon until smooth. The glaze should be thin enough to drizzle.\n2. Once the cake is completely cooled, drizzle the glaze over the top.\n\nEnjoy your Apple Jam Cake!",
        "Ingredients": [
            "1. 2 cups (250g) all-purpose flour",
            "2. 1 1/2 tsp baking powder",
            "3. 1 tsp baking soda",
            "4. 1 tsp ground cinnamon",
            "5. 1/2 tsp salt",
            "6. 1 cup (226g) unsalted butter, softened",
            "7. 1 1/2 cups (300g) granulated sugar",
            "8. 2 large eggs",
            "9. 2 tsp vanilla extract",
            "10. 1 1/2 cups (375g) National Foods Apple Jam",
            "11. 1 cup (240ml) buttermilk",
            "12. 1 cup (120g) chopped walnuts (optional)",
            "For the Glaze:",
            "1. 1 cup (120g) powdered sugar",
            "2. 2-3 tbsp apple cider vinegar",
            "3. 1 tsp ground cinnamon"
        ]
    },
    {
        "Category": "Jams & Jellies",
        "Product": "Mixed Fruit Jam",
        "Description": "Experience the delicious taste of National Mixed fruit jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/mix-fruit-jam.png",
        "Recipe": "One recipe you can make using National Foods Mixed Fruit Jam is a simple and delicious Mixed Fruit Toast. Here's the recipe:\n\nIngredients:\n1. 8 slices of bread (preferably sliced bread like white or whole grain)\n2. 2-3 tablespoons of National Foods Mixed Fruit Jam\n3. 50g of unsalted butter, softened\n4. Optional toppings: Fresh fruits like bananas, strawberries, or blueberries, crushed nuts, or a drizzle of honey or maple syrup\n\nInstructions:\n1. Toast the bread slices to your preferred level of crispiness.\n2. While the bread is toasting, soften the unsalted butter.\n3. Once the bread is toasted, spread a thin layer of softened butter on one side of each slice.\n4. Spread a generous amount of National Foods Mixed Fruit Jam on the buttered side of half of the slices.\n5. Place the other half of the slices, buttered side down, on top of the jam-covered slices to make sandwiches.\n6. If desired, add fresh fruits, crushed nuts, or a drizzle of honey or maple syrup on top of the sandwiches before serving.\n7. Cut the sandwiches in half diagonally and serve immediately.\n\nEnjoy your Mixed Fruit Toast! Remember, you can always adjust the amount of jam or butter to your liking.",
        "Ingredients": [
            "1. 8 slices of bread",
            "2. 2-3 tablespoons of National Foods Mixed Fruit Jam",
            "3. 50g of unsalted butter (softened)",
            "4. Fresh fruits (like bananas, strawberries, or blueberries) (optional)",
            "5. Crushed nuts (optional)",
            "6. Honey or maple syrup (for drizzling, optional)"
        ]
    },
    {
        "Category": "Jams & Jellies",
        "Product": "Mango Jam",
        "Description": "Experience the delicious taste of National Mango jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/mango-jam.png",
        "Recipe": "Here's a simple and delicious recipe for Mango Jam Sandwich using National Foods Mango Jam:\n\nIngredients:\n1. 4 slices of bread (preferably soft bread like white or whole grain)\n2. 2-3 tablespoons of National Foods Mango Jam\n3. 1 ripe banana, sliced\n4. 1/2 cup of fresh cream (optional)\n5. A handful of fresh mint leaves\n\nInstructions:\n1. Spread 1 to 1.5 tablespoons of Mango Jam evenly on two slices of bread.\n2. Arrange the sliced bananas on top of the Mango Jam.\n3. If you like, you can spread a thin layer of fresh cream on the other two slices of bread.\n4. Place the cream-covered slices on top of the banana slices, so that the cream is facing outwards.\n5. Press gently to ensure all layers stick together.\n6. Cut the sandwich into halves or quarters, depending on your preference.\n7. Garnish the sandwiches with fresh mint leaves.\n8. Serve immediately and enjoy your Mango Jam Banana Sandwich!",
        "Ingredients": [
            "1. 4 slices of bread",
            "2. 2-3 tablespoons of National Foods Mango Jam",
            "3. 1 ripe banana, sliced",
            "4. 1/2 cup of fresh cream (optional)",
            "5. A handful of fresh mint leaves"
        ]
    },
    {
        "Category": "Jams & Jellies",
        "Product": "Mango Jam",
        "Description": "Experience the delicious taste of National Mango jam, the perfect start to your breakfast every morning This easy to spread jam makes a wonderful spread on all kinds of breads, adds a perfect flavour to your yoghurt and can be used to prepare a wide variety of desserts too.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/mango-small.png",
        "Recipe": "Here's a simple recipe for Mango Jam Tart using National Foods Mango Jam:\n\nIngredients:\n1. 220g (8 oz) pack of all-purpose flour\n2. 115g (4 oz) unsalted butter, cold and diced\n3. 2 tbsp caster sugar\n4. 1 large egg yolk\n5. 2 tbsp cold water\n6. 350g (12 oz) National Foods Mango Jam\n7. 1 tbsp lemon juice\n8. 1 tbsp chopped pistachios (optional)\n\nFor the tart crust:\n1. In a large bowl, mix the flour and caster sugar. Add the cold, diced butter and rub it into the flour mixture until it resembles breadcrumbs.\n2. In a small bowl, beat the egg yolk and water together. Add this to the flour mixture and mix until the dough comes together.\n3. Press the dough into a 20cm (8 in) tart tin, making sure to push it up the sides. Prick the base with a fork and chill in the fridge for 30 minutes.\n4. Preheat your oven to 180°C (350°F) and bake the tart crust for 20-25 minutes, or until it's golden brown. Set aside to cool.\n\nFor the filling:\n1. In a saucepan, heat the Mango Jam over medium heat. Stir in the lemon juice.\n2. Cook for 5 minutes, stirring occasionally, until the jam thickens slightly.\n3. Spread the jam evenly over the cooled tart crust.\n4. Sprinkle the chopped pistachios over the jam (if using).\n\nYour Mango Jam Tart is now ready to enjoy! It's best served at room temperature, but it can also be chilled and served cold. Enjoy!",
        "Ingredients": [
            "1. 220g (8 oz) pack of all-purpose flour",
            "2. 115g (4 oz) unsalted butter, cold and diced",
            "3. 2 tbsp caster sugar",
            "4. 1 large egg yolk",
            "5. 2 tbsp cold water",
            "6. 350g (12 oz) National Foods Mango Jam",
            "7. 1 tbsp lemon juice",
            "8. 1 tbsp chopped pistachios (optional)"
        ]
    },
    {
        "Category": "Jams & Jellies",
        "Product": "Apple Jam",
        "Description": "Experience the delicious taste of National Apple jam, the perfect start to your breakfast every morning This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/apple-small.png",
        "Recipe": "Here's a simple recipe for Apple Jam Tart using the Apple Jam from National Foods:\n\nIngredients:\n1. 1 packet of ready-made shortcrust pastry (or make your own if you prefer)\n2. 1 jar (approximately 400g) of National Foods Apple Jam\n3. 2 tablespoons of lemon juice\n4. 1 egg, beaten\n5. Optional: A sprinkle of sugar for decoration\n\nSteps:\n1. Preheat your oven to 180°C (350°F) and grease a 20cm (8 inch) tart tin.\n2. Roll out the shortcrust pastry on a floured surface and gently press it into the tart tin, ensuring the sides are even. Prick the base with a fork a few times and chill for 15 minutes in the refrigerator.\n3. Blind bake the pastry by lining it with baking paper and adding pie weights or dried beans. Bake for 15 minutes, then remove the weights and paper and bake for another 5 minutes until golden brown. Set aside to cool.\n4. While the pastry is cooling, mix the Apple Jam and lemon juice in a saucepan over medium heat. Stir continuously until the mixture is smooth and has thickened slightly. This should take about 5 minutes.\n5. Once the pastry is completely cool, spread the apple jam mixture evenly over the base.\n6. Brush the edges of the tart with the beaten egg, then bake in the preheated oven for 15-20 minutes, or until the edges are golden brown and the jam is bubbling.\n7. Allow the tart to cool before slicing and serving. You can sprinkle a little sugar on top for extra crunch if you like.\n\nEnjoy your Apple Jam Tart! Remember, you can always adjust the recipe to your taste, adding more lemon juice if you prefer a tangier taste or less if you prefer it sweeter.",
        "Ingredients": [
            "1. 1 packet of ready-made shortcrust pastry",
            "2. 1 jar (approximately 400g) of National Foods Apple Jam",
            "3. 2 tablespoons of lemon juice",
            "4. 1 egg",
            "5. Optional: A sprinkle of sugar for decoration"
        ]
    },
    {
        "Category": "Jams & Jellies",
        "Product": "Mixed Fruit Jam",
        "Description": "Experience the delicious taste of National Mixed fruit jam, the perfect start to your breakfast every morning! This easy to spread jam makes a wonderful spread on all kinds of breads, becomes the perfect sweet topping for pancakes, french toasts and cake and can also be used to prepare a wide variety of desserts too like pastry tarts and cheesecakes!",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/mixfruit-small.png",
        "Recipe": "Here's a simple recipe for Mixed Fruit Jam Tart using the National Foods Mixed Fruit Jam.\n\n**Ingredients:**\n\n1. 1 pack of National Foods Mixed Fruit Jam (approximately 340g)\n2. 2 cups of all-purpose flour\n3. 1 cup of unsalted butter, cold and diced\n4. 1/2 cup of icing sugar\n5. 1 egg yolk\n6. 2 tablespoons of cold water\n7. A pinch of salt\n\n**Instructions:**\n\n1. Preheat your oven to 180 degrees Celsius (356 degrees Fahrenheit).\n2. In a large bowl, combine the flour, salt, and icing sugar. Add the cold, diced butter, and using your fingertips, rub the butter into the flour mixture until the mixture resembles fine breadcrumbs.\n3. Add the egg yolk and cold water, and mix until the dough comes together. If the dough is too dry, add a little more water.\n4. Press two-thirds of the dough into a tart tin, making sure to press it evenly and firmly against the base and sides. Prick the base with a fork a few times to prevent it from puffing up during baking.\n5. Bake the tart base in the preheated oven for 15-20 minutes, or until it's lightly golden.\n6. Allow the tart base to cool slightly, then spread an even layer of the National Foods Mixed Fruit Jam over the base.\n7. Roll out the remaining dough and cut out shapes to decorate the tart. You could use star shapes, hearts, or any other shape you like.\n8. Place the decorated dough shapes on top of the jam, then return the tart to the oven and bake for another 10-15 minutes, or until the tart is golden all over.\n9. Allow the tart to cool completely before slicing and serving. Enjoy your Mixed Fruit Jam Tart!",
        "Ingredients": [
            "1. National Foods Mixed Fruit Jam (approximately 340g)",
            "2. 2 cups of all-purpose flour",
            "3. 1 cup of unsalted butter, cold and diced",
            "4. 1/2 cup of icing sugar",
            "5. 1 egg yolk",
            "6. 2 tablespoons of cold water",
            "7. A pinch of salt"
        ]
    },
    {
        "Category": "Chutneys",
        "Product": "Coriander Chutney",
        "Description": "National Spicy Coriander Chutney brings the flavor of the fresh coriander with a touch of spice and give your food a unique twist.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Coriander-Chutney.png",
        "Recipe": "Here's a simple recipe for a Coriander Chutney Pasta that uses Coriander Chutney from National Foods as one of its key ingredients:\n\nIngredients:\n1. 200g Penne Pasta\n2. 1 cup National Foods Coriander Chutney\n3. 1 can (400g) Chickpeas, drained and rinsed\n4. 2 medium-sized Tomatoes, diced\n5. 1 small Red Onion, finely chopped\n6. 1 Cucumber, diced\n7. 2 cloves Garlic, minced\n8. 1 tsp Cumin Seeds\n9. 1 tsp Mustard Seeds\n10. 1 tbsp Oil\n11. Salt to taste\n12. Lemon Juice (optional)\n13. Fresh Coriander leaves for garnish\n\nSteps:\n1. Cook the penne pasta according to the package instructions until al dente. Drain and set aside.\n2. Heat oil in a pan over medium heat. Add cumin seeds and mustard seeds. Once they start to sizzle, add the minced garlic and sauté until fragrant.\n3. Add the diced tomatoes, onions, and chickpeas to the pan. Sauté until the vegetables are soft.\n4. Stir in the National Foods Coriander Chutney and mix well. Season with salt to taste. If you prefer a tangier taste, you can add a squeeze of lemon juice.\n5. Add the cooked pasta to the pan and mix well to ensure that the pasta is evenly coated with the chutney mixture.\n6. Remove from heat and let it cool for a few minutes.\n7. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Coriander Chutney Pasta!",
        "Ingredients": [
            "1. Penne Pasta",
            "2. National Foods Coriander Chutney",
            "3. Chickpeas (400g can, drained and rinsed)",
            "4. Tomatoes (2 medium-sized, diced)",
            "5. Red Onion (1 small, finely chopped)",
            "6. Cucumber (1, diced)",
            "7. Garlic (2 cloves, minced)",
            "8. Cumin Seeds",
            "9. Mustard Seeds",
            "10. Oil (1 tbsp)",
            "11. Salt (to taste)",
            "12. Lemon Juice (optional)",
            "13. Fresh Coriander leaves"
        ]
    },
    {
        "Category": "Chutneys",
        "Product": "Plum Chutney",
        "Description": "National Sweet &amp; Sour Plum Chutney Sauce gives you a unique twist of flavors that hits the spot every time and add a touch of sweetness with a tangy kick to any snack.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Plum-Chuyney.png",
        "Recipe": "Here's a simple and delicious recipe for Plum Chutney Chicken Curry using National Foods Plum Chutney.\n\nIngredients:\n1. 500g Boneless Chicken Breast, cut into pieces\n2. 2 Tbsp Vegetable Oil\n3. 1 Large Onion, finely chopped\n4. 2 Cloves Garlic, minced\n5. 1 Inch Ginger, grated\n6. 1 Tbsp Curry Powder\n7. 1 Tsp Turmeric\n8. 1 Tsp Cumin Powder\n9. 1 Tsp Coriander Powder\n10. 200g National Foods Plum Chutney\n11. 1 Can (400g) Coconut Milk\n12. Salt to taste\n13. Fresh Cilantro for garnish\n\nInstructions:\n1. Heat oil in a large pan over medium heat. Add the chicken pieces and cook until browned. Remove from pan and set aside.\n2. In the same pan, add onions, garlic, and ginger. Sauté until softened.\n3. Add curry powder, turmeric, cumin powder, and coriander powder. Stir well to coat the onions.\n4. Add the Plum Chutney and stir until well mixed.\n5. Return the chicken to the pan and stir to coat it with the chutney mixture.\n6. Pour in the coconut milk and stir well. Season with salt.\n7. Reduce heat to low, cover the pan, and let it simmer for 20-25 minutes, or until the chicken is cooked through and the sauce has thickened.\n8. Garnish with fresh cilantro before serving.\n\nEnjoy your Plum Chutney Chicken Curry!",
        "Ingredients": [
            "1. 500g Boneless Chicken Breast, cut into pieces",
            "2. 2 Tbsp Vegetable Oil",
            "3. 1 Large Onion, finely chopped",
            "4. 2 Cloves Garlic, minced",
            "5. 1 Inch Ginger, grated",
            "6. 1 Tbsp Curry Powder",
            "7. 1 Tsp Turmeric",
            "8. 1 Tsp Cumin Powder",
            "9. 1 Tsp Coriander Powder",
            "10. 200g National Foods Plum Chutney",
            "11. 1 Can (400g) Coconut Milk",
            "12. Salt to taste",
            "13. Fresh Cilantro for garnish"
        ]
    },
    {
        "Category": "Chutneys",
        "Product": "Mango Chutney",
        "Description": "National Hot Mango Chutney Sauce is a traditional chutney made with the sweetness of mangoes and our signature spices that gives it a flavorful kick.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Hot-Mango-Chutney.png",
        "Recipe": "Here's a simple recipe for Mango Chutney Chicken Curry that you can make using National Foods Mango Chutney.\n\nIngredients:\n1. 500g boneless chicken breasts, cut into bite-sized pieces\n2. 2 tablespoons vegetable oil\n3. 1 large onion, finely chopped\n4. 2 cloves garlic, minced\n5. 1 inch piece of ginger, grated\n6. 1 tablespoon curry powder\n7. 1 can (400g) of coconut milk\n8. 1 jar (340g) of National Foods Mango Chutney\n9. Salt to taste\n10. Fresh coriander leaves for garnish\n\nInstructions:\n1. Heat the oil in a large pan over medium heat. Add the chicken pieces and cook until browned. Remove the chicken from the pan and set aside.\n2. In the same pan, add the onion, garlic, and ginger. Sauté until the onion is translucent.\n3. Add the curry powder to the pan and stir well to coat the onions. Cook for about a minute to allow the flavors to mix.\n4. Add the coconut milk to the pan and stir well. Bring the mixture to a simmer.\n5. Stir in the Mango Chutney and salt to taste. Let the mixture simmer for about 10 minutes.\n6. Return the chicken to the pan and stir well to coat it in the sauce. Let the mixture simmer for another 10-15 minutes, or until the chicken is fully cooked and the sauce has thickened.\n7. Garnish with fresh coriander leaves before serving.\n\nEnjoy your Mango Chutney Chicken Curry!",
        "Ingredients": [
            "1. 500g boneless chicken breasts",
            "2. 2 tablespoons vegetable oil",
            "3. 1 large onion",
            "4. 2 cloves garlic",
            "5. 1 inch piece of ginger",
            "6. 1 tablespoon curry powder",
            "7. 1 can (400g) of coconut milk",
            "8. 1 jar (340g) of National Foods Mango Chutney",
            "9. Salt to taste",
            "10. Fresh coriander leaves"
        ]
    },
    {
        "Category": "Chutneys",
        "Product": "fresh mint-chutney",
        "Description": "National Fresh Mint Chutney gives you the refreshing taste of mint to enjoy with any boring old snack, so give your taste buds a treat with National Fresh Mint Chutney Sauce.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Freshmint-Chutney.png",
        "Recipe": "A classic mint chutney recipe that you can adjust according to the National Foods' product.\n\nClassic Mint Chutney Recipe:\n\nIngredients:\n1. Fresh Mint Leaves - 1 cup (adjust according to the National Foods' product)\n2. Coriander Leaves - 1 cup\n3. Green Chillies - 3-4 (adjust according to your spice tolerance)\n4. Garlic - 2 cloves\n5. Ginger - 1 inch piece\n6. Lemon Juice - 2 tbsp\n7. Salt - to taste\n8. Sugar - 1 tbsp (optional)\n9. Water - as needed\n10. Cumin Seeds (roasted) - 1 tsp\n11. Chopped Coconut (fresh or dried) - 2 tbsp (optional)\n\nInstructions:\n1. Wash and dry the mint and coriander leaves.\n2. In a blender, add mint leaves, coriander leaves, green chilies, garlic, ginger, and lemon juice. Blend until smooth.\n3. Add salt and sugar (if using), and blend again.\n4. If the chutney is too thick, add water little by little to achieve your desired consistency.\n5. Transfer the chutney to a bowl.\n6. Add roasted cumin seeds and chopped coconut (if using), and mix well.\n7. Chill the mint chutney before serving.\n\nEnjoy your mint chutney with your favorite Indian dishes! Remember to adjust the ingredients based on the National Foods' product and your personal taste preferences.",
        "Ingredients": [
            "1. Fresh Mint Leaves",
            "2. Coriander Leaves",
            "3. Green Chillies",
            "4. Garlic",
            "5. Ginger",
            "6. Lemon Juice",
            "7. Salt",
            "8. Sugar",
            "9. Water",
            "10. Cumin Seeds (roasted)",
            "11. Chopped Coconut (fresh or dried)"
        ]
    },
    {
        "Category": "Chutneys",
        "Product": "Tamarnd Chutney",
        "Description": "National Tangy Tamarind Chutney Sauce has the ultimate sweet, sour and tangy flavor. It’s sure to make any dish pop whether its seafood, chicken, snacks or plain french fries.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/chutney.png",
        "Recipe": "Here's a simple and delicious recipe for Chicken Tikka with Tamarind Chutney as a side.\n\nIngredients for Chicken Tikka:\n1. 500g boneless chicken breast, cut into cubes\n2. 2 tablespoons yogurt\n3. 2 tablespoons lemon juice\n4. 2 teaspoons garam masala\n5. 1 teaspoon chili powder\n6. 1 teaspoon cumin powder\n7. 1 teaspoon coriander powder\n8. Salt to taste\n9. 2 tablespoons oil\n\nInstructions for Chicken Tikka:\n1. In a bowl, mix chicken cubes, yogurt, lemon juice, garam masala, chili powder, cumin powder, coriander powder, and salt. Make sure all the chicken pieces are well coated.\n2. Marinate the chicken for at least 2 hours, or preferably overnight.\n3. Preheat your oven to 200 degrees Celsius (around 400 degrees Fahrenheit).\n4. Thread the marinated chicken cubes onto skewers and brush them with oil.\n5. Bake in the preheated oven for 10-15 minutes, until the chicken is cooked through and slightly charred.\n\nIngredients for Tamarind Chutney:\n1. 250g National Foods Tamarind Chutney\n2. 1 tablespoon chopped fresh coriander (optional)\n\nInstructions for Tamarind Chutney:\n1. Warm the Tamarind Chutney in a pan over low heat.\n2. Stir in chopped fresh coriander if desired.\n\nServe the Chicken Tikka with a side of warm Tamarind Chutney. Enjoy your meal!",
        "Ingredients": [
            "1. 500g boneless chicken breast",
            "2. 2 tablespoons yogurt",
            "3. 2 tablespoons lemon juice",
            "4. 2 teaspoons garam masala",
            "5. 1 teaspoon chili powder",
            "6. 1 teaspoon cumin powder",
            "7. 1 teaspoon coriander powder",
            "8. Salt to taste",
            "9. 2 tablespoons oil",
            "10. 250g National Foods Tamarind Chutney",
            "11. 1 tablespoon chopped fresh coriander (optional)"
        ]
    },
    {
        "Category": "Sauces",
        "Product": "Red Chilli Sauce",
        "Description": "National Red Chilli Sauce is the ultimate explosion of flavor that wakes up those taste buds and add some heat to boring snacks.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/red-chilli.png",
        "Recipe": "Here's a simple recipe for you:\n\nIngredients:\n1. 500g chicken breast, sliced\n2. 2 bell peppers (any color), sliced\n3. 2 carrots, sliced\n4. 2 cloves garlic, minced\n5. 1 onion, sliced\n6. 2 cups of mixed vegetables (optional)\n7. 2 tablespoons of vegetable oil\n8. 3-4 tablespoons of National Foods Red Chilli Sauce\n9. 2 tablespoons soy sauce\n10. 1 tablespoon oyster sauce (optional)\n11. Sesame seeds for garnish\n12. Steamed rice to serve\n\nInstructions:\n1. Heat 1 tablespoon of vegetable oil in a large skillet or wok over medium-high heat.\n2. Add the sliced chicken and cook until browned and cooked through. Remove from the skillet and set aside.\n3. In the same skillet, add another tablespoon of oil. Add the garlic, onion, and bell peppers. Stir-fry until the onion becomes translucent.\n4. Add the carrots and mixed vegetables (if using). Stir-fry for another 3-4 minutes.\n5. Return the cooked chicken to the skillet.\n6. In a small bowl, combine the National Foods Red Chilli Sauce, soy sauce, and oyster sauce (if using). Pour this mixture over the chicken and vegetables in the skillet.\n7. Stir everything together to ensure the sauce evenly coats the ingredients. Cook for another 2-3 minutes until the sauce has thickened slightly.\n8. Sprinkle sesame seeds on top and serve with steamed rice.\n\nEnjoy your Spicy Chicken Stir-Fry!",
        "Ingredients": [
            "1. 500g chicken breast, sliced",
            "2. 2 bell peppers (any color), sliced",
            "3. 2 carrots, sliced",
            "4. 2 cloves garlic, minced",
            "5. 1 onion, sliced",
            "6. 2 cups of mixed vegetables (optional)",
            "7. 2 tablespoons of vegetable oil",
            "8. 3-4 tablespoons of National Foods Red Chilli Sauce",
            "9. 2 tablespoons soy sauce",
            "10. 1 tablespoon oyster sauce (optional)",
            "11. Sesame seeds for garnish",
            "12. Steamed rice to serve"
        ]
    },
    {
        "Category": "Sauces",
        "Product": "Green Chilli Sauce",
        "Description": "National Green Chilli Sauce is the ultimate symphony of flavors with a zesty burst of green chillies and our signature spices.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Green-Chilli-Sauce.png",
        "Recipe": "Here's a simple recipe for Green Chilli Pasta that you can make using National Foods Green Chilli Sauce.\n\nIngredients:\n1. 200g spaghetti\n2. 2 tablespoons olive oil\n3. 1 large onion, finely chopped\n4. 3 cloves garlic, minced\n5. 1 can (400g) of chopped tomatoes\n6. 1 jar (225g) of National Foods Green Chilli Sauce\n7. Salt to taste\n8. 1 can (400g) of kidney beans, drained and rinsed\n9. 1 cup frozen peas\n10. 100g feta cheese, crumbled\n11. Fresh basil leaves for garnish\n\nInstructions:\n1. Cook the spaghetti according to the package instructions until al dente. Drain and set aside.\n2. Heat the olive oil in a large pan over medium heat. Add the onion and garlic, and sauté until softened.\n3. Add the chopped tomatoes and National Foods Green Chilli Sauce to the pan. Season with salt, and stir to combine. Let it simmer for about 10 minutes.\n4. Stir in the kidney beans and peas, and cook for another 5 minutes.\n5. Add the cooked spaghetti to the pan, and toss to coat evenly with the sauce.\n6. Remove from heat, and stir in the crumbled feta cheese.\n7. Serve hot, garnished with fresh basil leaves.\n\nEnjoy your Green Chilli Pasta! Remember, you can always adjust the ingredients to suit your taste. Enjoy cooking!",
        "Ingredients": [
            "1. 200g spaghetti",
            "2. 2 tablespoons olive oil",
            "3. 1 large onion, finely chopped",
            "4. 3 cloves garlic, minced",
            "5. 1 can (400g) of chopped tomatoes",
            "6. 1 jar (225g) of National Foods Green Chilli Sauce",
            "7. Salt to taste",
            "8. 1 can (400g) of kidney beans, drained and rinsed",
            "9. 1 cup frozen peas",
            "10. 100g feta cheese, crumbled",
            "11. Fresh basil leaves for garnish"
        ]
    },
    {
        "Category": "Sauces",
        "Product": "Imli Sauce",
        "Description": "National Khatti Meethi Imli Sauce has the ultimate sweet, sour and tangy flavor. It adds a wonderful depth of flavor to various meals and snacks such as samosas, chaats and rolls. Enhance the taste of your snacks with the help of this delicious condiment to get an authentic experience of Pakistani Cuisine.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/imli-souce.png",
        "Recipe": "Here's a simple recipe for Tamarind Chutney using National Foods Imli Sauce:\n\nIngredients:\n1. National Foods Imli Sauce - 1 cup\n2. Water - 1/2 cup\n3. Chili Powder - 1/2 tsp (adjust according to your spice tolerance)\n4. Salt - to taste\n5. 1 tsp of roasted cumin powder (optional)\n6. 1 tsp of chopped garlic (optional)\n\nInstructions:\n1. Heat the National Foods Imli Sauce in a pan over medium heat.\n2. Add water and stir well to mix.\n3. Add chili powder, salt, roasted cumin powder, and garlic (if using).\n4. Let it simmer for a few minutes until the sauce thickens to your desired consistency.\n5. Taste and adjust the seasoning if needed.\n6. Allow it to cool before storing in an airtight container in the refrigerator.\n\nThis Imli Sauce can be used as a dip, a sauce for various dishes, or a flavor enhancer for meals. Enjoy your cooking!",
        "Ingredients": [
            "1. National Foods Imli Sauce",
            "2. Water",
            "3. Chili Powder",
            "4. Salt",
            "5. Roasted cumin powder (optional)",
            "6. Garlic (optional)"
        ]
    },
    {
        "Category": "Chinese Sauces",
        "Product": "Chilli Sauce",
        "Description": "Prepared with the highest quality ingredients, National Chilli Sauce has a distinct aroma and a spicy kick, it is just what you need to enjoy the perfect authentic Chinese taste. Whether you are looking for the right ingredient to prepare a perfect authentic Chinese recipe, or want to add more flavor to your favorite meals, National Chilli Sauce is what you need to enhance the flavour and spiciness of your favourite meals.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/chinese-chilli-sause-scaled.jpg",
        "Recipe": "Here's a simple recipe for Chilli Beef Stir-Fry using National Foods Chilli Sauce as the main seasoning.\n\nIngredients:\n1. 500g beef stir-fry strips\n2. 2 tablespoons of vegetable oil\n3. 2 cloves of garlic, minced\n4. 1 large onion, sliced\n5. 2 bell peppers (any color), sliced\n6. 2 cups of sliced carrots\n7. 2 cups of sliced bok choy\n8. 1 cup of sliced mushrooms\n9. 1 can of drained and rinsed water chestnuts (optional)\n10. 1 cup of National Foods Chilli Sauce\n11. 2 tablespoons of soy sauce\n12. 2 tablespoons of cornstarch mixed with 2 tablespoons of water (for thickening)\n13. 2 green onions, sliced (for garnish)\n\nSteps:\n1. Heat 1 tablespoon of oil in a large skillet or wok over high heat. Add the beef and stir-fry until browned and cooked through. Remove from the skillet and set aside.\n2. In the same skillet, heat the remaining 1 tablespoon of oil. Add the garlic and cook until fragrant.\n3. Add the onion, bell peppers, carrots, bok choy, and mushrooms. Stir-fry for 3-4 minutes, until vegetables are tender-crisp.\n4. If using water chestnuts, add them to the skillet and stir-fry for an additional minute.\n5. Return the beef to the skillet and add the National Foods Chilli Sauce and soy sauce. Stir well to combine.\n6. Push the mixture to one side of the skillet, and add the cornstarch and water mixture to the other side. Stir until the sauce thickens.\n7. Stir the sauce into the meat and vegetable mixture until well combined.\n8. Remove from heat and garnish with sliced green onions before serving.\n\nEnjoy your Chilli Beef Stir-Fry!",
        "Ingredients": [
            "1. 500g beef stir-fry strips",
            "2. Vegetable oil (2 tablespoons)",
            "3. 2 cloves of garlic",
            "4. 1 large onion",
            "5. 2 bell peppers (any color)",
            "6. 2 cups of sliced carrots",
            "7. 2 cups of sliced bok choy",
            "8. 1 cup of sliced mushrooms",
            "9. 1 can of drained and rinsed water chestnuts (optional)",
            "10. National Foods Chilli Sauce (1 cup)",
            "11. Soy sauce (2 tablespoons)",
            "12. Cornstarch (2 tablespoons)",
            "13. Water (2 tablespoons)",
            "14. 2 green onions (for garnish)"
        ]
    },
    {
        "Category": "Chinese Sauces",
        "Product": "Soy Sauce",
        "Description": "Prepared with the highest quality ingredients, National Soy Sauce offers the best taste for enhancing your meals. Whether you are looking for the right ingredient to prepare a perfect authentic Chinese recipe, or want to add more flavor to your favorite meals, National Soy Sauce is just what you need to enjoy the perfect authentic Chinese taste.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/soy-sause-scaled.jpg",
        "Recipe": "Here's a simple recipe for Stir-Fried Vegetables with Tofu and Soy Sauce:\n\nIngredients:\n1. 200g firm tofu, drained and cut into cubes\n2. 2 cups mixed vegetables (like bell peppers, snap peas, carrots, and bok choy)\n3. 2 cloves garlic, minced\n4. 1 inch piece of ginger, peeled and sliced\n5. 2 tablespoons vegetable oil\n6. 3 tablespoons National Foods Soy Sauce\n7. 1 tablespoon oyster sauce (optional, for extra umami flavor)\n8. 1 tablespoon sesame seeds\n9. 1 green onion, sliced\n\nInstructions:\n1. Heat 1 tablespoon of oil in a large pan or wok over medium-high heat. Add the tofu and stir-fry until golden brown, about 3-4 minutes. Remove from the pan and set aside.\n2. In the same pan, add another tablespoon of oil. Add the garlic and ginger and stir-fry for 30 seconds until fragrant.\n3. Add the mixed vegetables and stir-fry for 2-3 minutes until they start to soften.\n4. In a small bowl, mix together the National Foods Soy Sauce and oyster sauce (if using). Pour this mixture over the vegetables and stir well.\n5. Add the tofu back into the pan and stir to combine with the vegetables and sauce.\n6. Cook for another 2-3 minutes until the vegetables are fully cooked and the sauce has thickened slightly.\n7. Remove from heat and sprinkle with sesame seeds and green onions before serving.\n\nEnjoy your stir-fry! Remember, you can adjust the ingredients and seasonings to your taste.",
        "Ingredients": [
            "1. 200g firm tofu",
            "2. 2 cups mixed vegetables (like bell peppers, snap peas, carrots, and bok choy)",
            "3. 2 cloves garlic",
            "4. 1 inch piece of ginger",
            "5. 2 tablespoons vegetable oil",
            "6. 3 tablespoons National Foods Soy Sauce",
            "7. 1 tablespoon oyster sauce (optional)",
            "8. 1 tablespoon sesame seeds",
            "9. 1 green onion"
        ]
    },
    {
        "Category": "Chinese Sauces",
        "Product": "White Vinegar",
        "Description": "National Synthetic Vinegar is the ideal companion for your favorite salads.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/chinese_white_vinegar-scaled.jpg",
        "Recipe": "Here's a recipe for a homemade all-purpose cleaner:\n\nIngredients:\n1. 1 part White Vinegar (from National Foods)\n2. 3 parts water\n3. Optional: a few drops of essential oil for scent (like lemon or tea tree)\n\nInstructions:\n1. Combine equal parts of White Vinegar and water in a spray bottle.\n2. If you'd like to add a scent, add a few drops of your chosen essential oil.\n3. Shake well to mix the ingredients.\n4. Spray the solution onto surfaces and wipe clean with a cloth or sponge.\n\nThis mixture is great for cleaning kitchen counters, bathroom fixtures, windows, and many other surfaces in your home. It's a cost-effective and eco-friendly alternative to store-bought cleaners.",
        "Ingredients": [
            "1. White Vinegar (from National Foods)",
            "2. Water",
            "3. Essential oil (optional, like lemon or tea tree)"
        ]
    },
    {
        "Category": "Ginger Garlic Pastes",
        "Product": "Ginger Paste",
        "Description": "National Ginger Paste is prepared with pure and fresh ginger. It is your secret kitchen companion to help you prepare delicious meals everyday with convenience.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Ginger-Paste-300G.png",
        "Recipe": "Here's a simple and delicious recipe for Ginger Chicken Stir-Fry that you can try:\n\nIngredients:\n1. 500g boneless chicken breasts, sliced\n2. 3 tablespoons National Foods Ginger Paste\n3. 2 tablespoons soy sauce\n4. 1 tablespoon honey\n5. 2 cloves garlic, minced\n6. 1 large bell pepper, sliced\n7. 1 medium onion, sliced\n8. 2 cups mixed vegetables (such as carrots, snap peas, and snow peas)\n9. 2 tablespoons vegetable oil\n10. Salt to taste\n11. 2 green onions, sliced (for garnish)\n\nInstructions:\n1. In a bowl, mix National Foods Ginger Paste, soy sauce, honey, and minced garlic. Add sliced chicken and let it marinate for at least 30 minutes.\n2. Heat vegetable oil in a large skillet or wok over medium-high heat. Add the marinated chicken and cook until browned and cooked through. Remove the chicken from the skillet and set aside.\n3. In the same skillet, add bell pepper, onion, and mixed vegetables. Stir-fry for 3-4 minutes until vegetables are tender-crisp.\n4. Return the cooked chicken to the skillet and stir to combine with the vegetables. Season with salt to taste.\n5. Serve the Ginger Chicken Stir-Fry over steamed rice or noodles, garnished with sliced green onions.\n\nEnjoy your meal! Remember, you can always adjust the ingredients to suit your taste.",
        "Ingredients": [
            "1. 500g boneless chicken breasts, sliced",
            "2. 3 tablespoons National Foods Ginger Paste",
            "3. 2 tablespoons soy sauce",
            "4. 1 tablespoon honey",
            "5. 2 cloves garlic, minced",
            "6. 1 large bell pepper, sliced",
            "7. 1 medium onion, sliced",
            "8. 2 cups mixed vegetables (such as carrots, snap peas, and snow peas)",
            "9. 2 tablespoons vegetable oil",
            "10. Salt to taste",
            "11. 2 green onions, sliced (for garnish)"
        ]
    },
    {
        "Category": "Ginger Garlic Pastes",
        "Product": "Ginger Garlic Paste",
        "Description": "National Ginger &amp; Garlic Paste is prepared with pure and fresh ginger &amp; garlic. It is your secret kitchen companion to help you prepare delicious meals everyday with convenience.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Ginger-Garlic-Paste-750G.png",
        "Recipe": "Here's a simple and delicious recipe for Ginger Garlic Chicken Stir-Fry using National Foods Ginger Garlic Paste.\n\nIngredients:\n1. 500g boneless and skinless chicken breasts, cut into bite-sized pieces\n2. 3 tablespoons of National Foods Ginger Garlic Paste\n3. 2 tablespoons of soy sauce\n4. 1 tablespoon of oyster sauce (optional)\n5. 2 tablespoons of vegetable oil\n6. 2 cloves of garlic, minced\n7. 1 inch of fresh ginger, grated\n8. 1 large bell pepper, sliced\n9. 1 medium onion, sliced\n10. 2 cups of mixed vegetables (like carrots, snap peas, and baby corn)\n11. Salt to taste\n12. 2 green chilies (optional)\n13. 2 tablespoons of cornstarch mixed with 2 tablespoons of water (for the slurry)\n14. 2 green onions, chopped for garnish\n\nInstructions:\n1. In a bowl, mix the National Foods Ginger Garlic Paste, soy sauce, and oyster sauce (if using). Add the chicken pieces and make sure they are well coated. Let it marinate for at least 30 minutes.\n2. Heat 1 tablespoon of oil in a large pan or wok over medium heat. Add the marinated chicken and cook until it's no longer pink in the middle. Remove the chicken from the pan and set it aside.\n3. In the same pan, add another tablespoon of oil. Add the minced garlic and grated ginger, stir-fry for about 30 seconds until fragrant.\n4. Add the sliced bell pepper, onion, and mixed vegetables. Stir-fry for 3-4 minutes until they are slightly tender.\n5. If you like it spicy, add the green chilies at this stage.\n6. Add the chicken back into the pan and stir everything together.\n7. Pour the cornstarch slurry over the stir-fry. Stir continuously for a minute until the sauce thickens.\n8. Season with salt to taste.\n9. Garnish with chopped green onions before serving.\n\nEnjoy your Ginger Garlic Chicken Stir-Fry! Remember, you can always adjust the ingredients to your liking.",
        "Ingredients": [
            "1. 500g boneless and skinless chicken breasts, cut into bite-sized pieces",
            "2. 3 tablespoons of National Foods Ginger Garlic Paste",
            "3. 2 tablespoons of soy sauce",
            "4. 1 tablespoon of oyster sauce (optional)",
            "5. 2 tablespoons of vegetable oil",
            "6. 2 cloves of garlic, minced",
            "7. 1 inch of fresh ginger, grated",
            "8. 1 large bell pepper, sliced",
            "9. 1 medium onion, sliced",
            "10. 2 cups of mixed vegetables (like carrots, snap peas, and baby corn)",
            "11. Salt to taste",
            "12. 2 green chilies (optional)",
            "13. 2 tablespoons of cornstarch",
            "14. 2 tablespoons of water",
            "15. 2 green onions, chopped for garnish"
        ]
    },
    {
        "Category": "Ginger Garlic Pastes",
        "Product": "Garlic Paste",
        "Description": "National Garlic Paste is prepared with pure and fresh garlic. It is your secret kitchen companion to help you prepare delicious meals everyday with convenience.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/Garlic-Paste-750G.png",
        "Recipe": "Here's a step-by-step guide for garlic and herb chicken:\n\nIngredients:\n1. 500g chicken breasts, cut into bite-sized pieces\n2. 3 tablespoons National Foods Garlic Paste\n3. 2 tablespoons olive oil\n4. 1 tablespoon dried basil\n5. 1 tablespoon dried oregano\n6. Salt to taste\n7. Black pepper to taste\n8. 2 tablespoons lemon juice\n9. 2 tablespoons chopped fresh parsley (optional)\n\nInstructions:\n1. In a bowl, mix the garlic paste, olive oil, basil, oregano, salt, and pepper. Make sure the chicken pieces are well coated with this marinade.\n2. Let the chicken marinate for at least 30 minutes, or preferably overnight in the refrigerator.\n3. Heat a pan over medium-high heat. Add the marinated chicken pieces and cook until they are fully cooked, about 7-8 minutes. Stir occasionally to ensure even cooking.\n4. Once the chicken is cooked, add the lemon juice and stir. Let it cook for another 1-2 minutes.\n5. Garnish with fresh parsley before serving.\n\nEnjoy your Garlic and Herb Chicken! Remember, you can always adjust the ingredients to your taste.",
        "Ingredients": [
            "1. 500g chicken breasts",
            "2. 3 tablespoons National Foods Garlic Paste",
            "3. 2 tablespoons olive oil",
            "4. 1 tablespoon dried basil",
            "5. 1 tablespoon dried oregano",
            "6. Salt (to taste)",
            "7. Black pepper (to taste)",
            "8. 2 tablespoons lemon juice",
            "9. 2 tablespoons chopped fresh parsley (optional)"
        ]
    },
    {
        "Category": "seasonings",
        "Product": "Chat Masala",
        "Description": "National Foods offers a range of savory snack mixes and seasonings; which are a combination of spices used in the preparation of traditional snack dishes.",
        "Image URL": "https://www.nfoods.com/app/uploads/2021/06/chat-masala-2.jpg",
        "Recipe": "Here's a simple recipe for Aloo Tikki, a popular Indian snack that you can make using Chat Masala from National Foods.\n\nIngredients:\n1. 500 grams boiled potatoes\n2. 2 green chilies, finely chopped\n3. 1 small onion, finely chopped\n4. 2 cloves garlic, finely chopped\n5. 1 inch ginger, finely chopped\n6. 1 teaspoon coriander powder\n7. 1 teaspoon cumin powder\n8. 2 tablespoons Chat Masala (National Foods)\n9. 2 tablespoons chopped fresh coriander leaves\n10. 2 tablespoons semolina (sooji)\n11. Salt to taste\n12. Oil for frying\n\nInstructions:\n1. Mash the boiled potatoes until they are smooth.\n2. Add finely chopped green chilies, onion, garlic, and ginger to the mashed potatoes.\n3. Add coriander powder, cumin powder, Chat Masala, chopped fresh coriander leaves, and salt to taste. Mix well.\n4. Add semolina to the mixture and mix until it binds well. If the mixture is too soft, you can add a little more semolina.\n5. Make small patties out of the mixture and press them gently to make them flat.\n6. Heat oil in a deep frying pan. Once the oil is hot, carefully slide in the aloo tikki patties. Fry them on both sides until they are golden brown.\n7. Drain the fried aloo tikki on a paper towel to remove excess oil.\n8. Serve hot with green chutney or ketchup.\n\nEnjoy your Aloo Tikki made with National Foods Chat Masala!",
        "Ingredients": [
            "1. 500 grams boiled potatoes",
            "2. 2 green chilies",
            "3. 1 small onion",
            "4. 2 cloves garlic",
            "5. 1 inch ginger",
            "6. 1 teaspoon coriander powder",
            "7. 1 teaspoon cumin powder",
            "8. 2 tablespoons Chat Masala (National Foods)",
            "9. 2 tablespoons chopped fresh coriander leaves",
            "10. 2 tablespoons semolina (sooji)",
            "11. Salt to taste",
            "12. Oil for frying"
        ]
    }
]